STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_TMAP_Peripheral/STM32_WPAN/App/tmap_app.c
      p_conn = APP_GetACLConn(pNotification->ConnHandle);
      if (p_conn != 0)
      {
        if (p_conn->ConfirmIndicationRequired == 1u)
        {
          /* Confirm indication now that the GATT is available */
          ret = aci_gatt_confirm_indication(pNotification->ConnHandle);
          if (ret != BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("  Fail   : aci_gatt_confirm_indication command, result: 0x%02X\n", ret);
          }
          else
          {
            LOG_INFO_APP("  Success: aci_gatt_confirm_indication command\n");
          }
          p_conn->ConfirmIndicationRequired = 0u;
        }

        if (pNotification->Status == BLE_STATUS_SUCCESS)
        {
          p_conn->AudioProfile |= AUDIO_PROFILE_TMAP;
        }
        current_link = CAP_GetCurrentLinkedGAFProfiles(pNotification->ConnHandle);
#if (APP_MCP_ROLE_CLIENT_SUPPORT == 1)
        if ((current_link & MCP_LINK) == MCP_LINK)
        {
          ret = MCP_CLIENT_ConfigureTrackTitleNotification(pNotification->ConnHandle,
                                                           p_conn->GenericMediaPlayerCCID,
                                                           0x01u);
          if (ret != BLE_STATUS_SUCCESS)
          {
            if (ret == BLE_STATUS_BUSY)
            {
              p_conn->PendingContentCtrlOp |= MCP_CLT_OP_CONFIGURE_TRACK_TITLE_NOTIFICATION;
            }
            LOG_INFO_APP("  Fail   : MCP_CLIENT_ConfigureTrackTitleNotification with ConnHandle 0x%04X and CCID %d - result: 0x%02X\n",
                         pNotification->ConnHandle,
                         p_conn->GenericMediaPlayerCCID,
                         ret);
          }
          else
          {
            p_conn->CurrentContentCtrlOp |= MCP_CLT_OP_CONFIGURE_TRACK_TITLE_NOTIFICATION;
            p_conn->MCPLinkupState = APP_MCP_LINKUP_STATE_CONFIGURE_TRACK_TITLE_NOTIF;
            LOG_INFO_APP("  Success: MCP_CLIENT_ConfigureTrackTitleNotification with ConnHandle 0x%04X and CCID %d\n",
                         pNotification->ConnHandle,
                         p_conn->GenericMediaPlayerCCID);
          }
        }
#endif /* (APP_MCP_ROLE_CLIENT_SUPPORT == 1) */
#if (APP_CCP_ROLE_CLIENT_SUPPORT == 1)
        if ((current_link & CCP_LINK) == CCP_LINK)
        {
          ret = CCP_CLIENT_ReadCallState(pNotification->ConnHandle,
                                         p_conn->GenericTelephoneBearerCCID);
          if (ret != BLE_STATUS_SUCCESS)
          {
            if ((ret == BLE_STATUS_BUSY) && (p_conn != 0))
            {
              p_conn->PendingContentCtrlOp |= CCP_CLT_OP_READ_CALL_STATE;
            }
            LOG_INFO_APP("  Fail   : CCP_CLIENT_ReadCallState with ConnHandle 0x%04X and CCID %d - result: 0x%02X\n",
                         pNotification->ConnHandle,
                         p_conn->GenericTelephoneBearerCCID,
                         ret);
          }
          else
          {
            if (p_conn != 0)
            {
              p_conn->CurrentContentCtrlOp |= CCP_CLT_OP_READ_CALL_STATE;
            }
            LOG_INFO_APP("  Success: CCP_CLIENT_ReadCallState with ConnHandle 0x%04X and CCID %d\n",
                         pNotification->ConnHandle,
                         p_conn->GenericTelephoneBearerCCID);
          }
        }
#endif /* (APP_CCP_ROLE_CLIENT_SUPPORT == 1) */
      }
      UNUSED(ret);
      break;
    }
    case TMAP_REM_ROLE_VALUE_EVT:
    {
      uint16_t *tmap_role = (uint16_t *) pNotification->pInfo;
      LOG_INFO_APP("TMAP Remote Role Event with ConnHandle 0x%04X is received, TMAP role : %X\n",
                  pNotification->ConnHandle,
                  *tmap_role);
      UNUSED(tmap_role);
      break;
    }
  }
}

uint8_t TMAPAPP_StartAdvertising(CAP_Announcement_t AnnouncementType
                                 ,uint8_t EnableSolicitationRequest,
                                 uint16_t Appearance)
{
  tBleStatus status;
  uint8_t advPacketLen;
  uint8_t Primary_Adv_Channel_Map = ADV_CH_37 | ADV_CH_38 | ADV_CH_39;
  uint8_t Adv_TX_Power = 0x00;
  uint8_t Scan_Req_Notification_Enable = 0x00;
  uint8_t Secondary_Adv_Max_Skip = 0x00;
  const uint8_t Peer_Address[BD_ADDR_SIZE_LOCAL] = {0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
  uint8_t Pb_Addr_Len;
  uint8_t Pb_Addr[6] = {0x00};
  uint32_t Primary_Adv_Interval_Min;
  uint32_t Primary_Adv_Interval_Max;

  uint8_t Adv_Data[ADV_LEN] = {(ADV_AD_FLAGS_LEN-1), AD_TYPE_FLAGS, (FLAG_BIT_LE_GENERAL_DISCOVERABLE_MODE|FLAG_BIT_BR_EDR_NOT_SUPPORTED),
                               (ADV_LOCAL_NAME_LEN-1), AD_TYPE_COMPLETE_LOCAL_NAME,
                                 'S','T','M', '3', '2', 'W','B','A', '_', '0', '0', '0', '0'};
#if (CFG_TEST_VALIDATION == 1u)
  Adv_Data[5] = 'T';
  Adv_Data[6] = 'M';
  Adv_Data[7] = 'A';
  Adv_Data[8] = 'P';
  Adv_Data[9] = '_';
#endif /*(CFG_TEST_VALIDATION == 1u)*/
  aci_hal_read_config_data(CONFIG_DATA_PUBADDR_OFFSET, &Pb_Addr_Len, &Pb_Addr[0]);
  Adv_Data[ADV_AD_FLAGS_LEN+ADV_LOCAL_NAME_LEN-4] = Hex_To_Char((Pb_Addr[1] & 0xF0) >> 4);
  Adv_Data[ADV_AD_FLAGS_LEN+ADV_LOCAL_NAME_LEN-3] = Hex_To_Char(Pb_Addr[1] & 0x0F);
  Adv_Data[ADV_AD_FLAGS_LEN+ADV_LOCAL_NAME_LEN-2] = Hex_To_Char((Pb_Addr[0] & 0xF0) >> 4);
  Adv_Data[ADV_AD_FLAGS_LEN+ADV_LOCAL_NAME_LEN-1] = Hex_To_Char(Pb_Addr[0] & 0x0F);

  Menu_SetIdentifier((char *)&Adv_Data[ADV_AD_FLAGS_LEN+2], 14);

  /* Start Fast or Low Power Advertising.*/
  if (TMAPAPP_Context.NumConn == 0u)
  {
    Primary_Adv_Interval_Min = FAST_ADV_INTERVAL_MIN;
    Primary_Adv_Interval_Max = FAST_ADV_INTERVAL_MAX;
    LOG_INFO_APP("Start Fast Advertising\n");
  }
  else
  {
    Primary_Adv_Interval_Min = SLOW_ADV_INTERVAL_MIN;
    Primary_Adv_Interval_Max = SLOW_ADV_INTERVAL_MAX;
    LOG_INFO_APP("Start Slow Advertising\n");
  }
  status = aci_gap_adv_set_configuration(ADV_TYPE,
                                         0,
                                         HCI_ADV_EVENT_PROP_CONNECTABLE,
                                         Primary_Adv_Interval_Min,
                                         Primary_Adv_Interval_Max,
                                         Primary_Adv_Channel_Map,
                                         GAP_PUBLIC_ADDR,
                                         GAP_PUBLIC_ADDR,
                                         Peer_Address,
                                         ADV_FILTER,
                                         Adv_TX_Power,
                                         Secondary_Adv_Max_Skip,
                                         0x01,
                                         0,
                                         Scan_Req_Notification_Enable);
  LOG_INFO_APP("aci_gap_adv_set_configuration() returns status 0x%02X\n",status);
  if (status != BLE_STATUS_SUCCESS)
  {
    return status;
  }

  /* Set Extended Advertising data */
  TMAPAPP_BuildAdvDataPacket(&Adv_Data[(ADV_AD_FLAGS_LEN+ADV_LOCAL_NAME_LEN)],
                            &advPacketLen,
                            AnnouncementType,
                            EnableSolicitationRequest,
                            Appearance);
  LOG_INFO_APP("CAP Advertising Packet (Length : %d) :\n", advPacketLen);

  status = hci_le_set_extended_advertising_data(0,
                                                HCI_SET_ADV_DATA_OPERATION_COMPLETE,
                                                0,
                                                (ADV_AD_FLAGS_LEN+ADV_LOCAL_NAME_LEN+advPacketLen),
                                                &Adv_Data[0]);
  LOG_INFO_APP("hci_le_set_extended_advertising_data() returns status 0x%02X\n",status);
  if (status != BLE_STATUS_SUCCESS)
  {
    return status;
  }

  /* Enable Extended Advertising */
  Adv_Set_t adv_set;
  adv_set.Advertising_Handle = 0;
  adv_set.Duration = 0;
  adv_set.Max_Extended_Advertising_Events = 0;
  status = hci_le_set_extended_advertising_enable(0x01, 1, &adv_set);
  LOG_INFO_APP("hci_le_set_extended_advertising_enable() returns status 0x%02X\n",status);
  return status;
}

uint8_t TMAPAPP_StopAdvertising(void)
{
  Adv_Set_t adv_set;
  uint8_t status;
  adv_set.Advertising_Handle = 0;
  adv_set.Duration = 0;
  adv_set.Max_Extended_Advertising_Events = 0;

  status = hci_le_set_extended_advertising_enable(0, 1, &adv_set);

