STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_TMAP_Peripheral/STM32_WPAN/App/tmap_app.c
  return status;
}

uint8_t TMAPAPP_Disconnect(void)
{
  uint8_t status = BLE_STATUS_FAILED;
  for (uint8_t conn = 0u; conn < CFG_BLE_NUM_LINK ; conn++)
  {
    if ( TMAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle != 0xFFFFu)
    {
      status = hci_disconnect(TMAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle,
                              HCI_REMOTE_USER_TERMINATED_CONNECTION_ERR_CODE);
      LOG_INFO_APP("hci_disconnect() of ConnHandle 0x%04X returns status 0x%02X\n",
                   TMAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle,
                   status);
    }
  }

  return status;
}

uint8_t TMAPAPP_VolumeUp(void)
{
#if (APP_VCP_ROLE_RENDERER_SUPPORT == 1u)
  uint8_t status = BLE_STATUS_SUCCESS;
  uint8_t volume;
  if (Mute == 1)
  {
    status = VCP_RENDER_SetMuteState(0);
    LOG_INFO_APP("VCP_RENDER_SetMuteState() with Mute %d returns status 0x%02X\n", Mute, status);
  }

  if (0xFF - Volume > VOLUME_STEP)
  {
    volume = Volume + VOLUME_STEP;
  }
  else
  {
    volume = 0xFF;
  }

  if (status == BLE_STATUS_SUCCESS)
  {
    status = VCP_RENDER_SetAbsVolume(volume);
    LOG_INFO_APP("VCP_RENDER_SetAbsVolume() with volume %d returns status 0x%02X\n", volume, status);
  }
  return status;
#else /*#if (APP_VCP_ROLE_RENDERER_SUPPORT == 1u)*/
  return HCI_COMMAND_DISALLOWED_ERR_CODE;
#endif
}

uint8_t TMAPAPP_VolumeDown(void)
{
#if (APP_VCP_ROLE_RENDERER_SUPPORT == 1u)
  uint8_t status = BLE_STATUS_SUCCESS;
  uint8_t volume;

  if (Volume > VOLUME_STEP)
  {
    volume = Volume - VOLUME_STEP;
  }
  else
  {
    volume = 0;
    status = VCP_RENDER_SetMuteState(1);
    LOG_INFO_APP("VCP_RENDER_SetMuteState() with Mute %d returns status 0x%02X\n", Mute, status);
  }

  if (status == BLE_STATUS_SUCCESS)
  {
    status = VCP_RENDER_SetAbsVolume(volume);
    LOG_INFO_APP("VCP_RENDER_SetAbsVolume() with volume %d returns status 0x%02X\n", volume, status);
  }
  return status;
#else /*#if (APP_VCP_ROLE_RENDERER_SUPPORT == 1u)*/
  return HCI_COMMAND_DISALLOWED_ERR_CODE;
#endif
}

uint8_t TMAPAPP_ToggleMute(void)
{
#if (APP_VCP_ROLE_RENDERER_SUPPORT == 1u)
  uint8_t status;

  Mute = (Mute + 1) % 2;

  status = VCP_RENDER_SetMuteState(Mute);
  LOG_INFO_APP("VCP_RENDER_SetMuteState() returns status 0x%02X\n",status);

  return status;
#else /*#if (APP_VCP_ROLE_RENDERER_SUPPORT == 1u)*/
  return HCI_COMMAND_DISALLOWED_ERR_CODE;
#endif
}

tBleStatus TMAPAPP_NextTrack(void)
{
#if (APP_MCP_ROLE_CLIENT_SUPPORT == 1u)
  tBleStatus status = HCI_COMMAND_DISALLOWED_ERR_CODE;
  GAF_Profiles_Link_t current_link;

  for (uint8_t i = 0; i < CFG_BLE_NUM_LINK; i++)
  {
    if (TMAPAPP_Context.ACL_Conn[i].Acl_Conn_Handle != 0xFFFFu)
    {
      APP_ACL_Conn_t *p_conn = APP_GetACLConn(TMAPAPP_Context.ACL_Conn[i].Acl_Conn_Handle);
      if (p_conn != 0)
      {
        current_link = CAP_GetCurrentLinkedGAFProfiles(p_conn->Acl_Conn_Handle);
        if ((current_link & MCP_LINK) == MCP_LINK)
        {
          status = MCP_CLIENT_MoveNextTrack(p_conn->Acl_Conn_Handle,
                                            p_conn->GenericMediaPlayerCCID);
          if (status != BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("  Fail   : MCP_CLIENT_MoveNextTrack with ConnHandle 0x%04X and CCID %d - result: 0x%02X\n",
                         p_conn->Acl_Conn_Handle,
                         p_conn->GenericMediaPlayerCCID,
                         status);
          }
          else
          {
            if (p_conn != 0)
            {
              p_conn->CurrentContentCtrlOp |= MCP_CLT_OP_MOVE_NEXT_TRACK;
            }
            LOG_INFO_APP("  Success: MCP_CLIENT_MoveNextTrack with ConnHandle 0x%04X and CCID %d\n",
                         p_conn->Acl_Conn_Handle,
                         p_conn->GenericMediaPlayerCCID);
            return status;
          }
        }
      }
    }
  }
  return status;
#else /*#if (APP_MCP_ROLE_CLIENT_SUPPORT == 1u)*/
  return HCI_COMMAND_DISALLOWED_ERR_CODE;
#endif
}

tBleStatus TMAPAPP_PreviousTrack(void)
{
#if (APP_MCP_ROLE_CLIENT_SUPPORT == 1u)
  tBleStatus status = HCI_COMMAND_DISALLOWED_ERR_CODE;
  GAF_Profiles_Link_t current_link;

  for (uint8_t i = 0; i < CFG_BLE_NUM_LINK; i++)
  {
    if (TMAPAPP_Context.ACL_Conn[i].Acl_Conn_Handle != 0xFFFFu)
    {
      APP_ACL_Conn_t *p_conn = APP_GetACLConn(TMAPAPP_Context.ACL_Conn[i].Acl_Conn_Handle);
      if (p_conn != 0)
      {
        current_link = CAP_GetCurrentLinkedGAFProfiles(p_conn->Acl_Conn_Handle);
        if ((current_link & MCP_LINK) == MCP_LINK)
        {
          status = MCP_CLIENT_MovePreviousTrack(p_conn->Acl_Conn_Handle,
                                                p_conn->GenericMediaPlayerCCID);
          if (status != BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("  Fail   : MCP_CLIENT_MovePreviousTrack with ConnHandle 0x%04X and CCID %d - result: 0x%02X\n",
                         p_conn->Acl_Conn_Handle,
                         p_conn->GenericMediaPlayerCCID,
                         status);
          }
          else
          {
            if (p_conn != 0)
            {
              p_conn->CurrentContentCtrlOp |= MCP_CLT_OP_MOVE_PREVIOUS_TRACK;
            }
            LOG_INFO_APP("  Success: MCP_CLIENT_MovePreviousTrack with ConnHandle 0x%04X and CCID %d\n",
                         p_conn->Acl_Conn_Handle,
                         p_conn->GenericMediaPlayerCCID);
            return status;
          }
        }
      }
    }
  }
  return status;
#else /*#if (APP_MCP_ROLE_CLIENT_SUPPORT == 1u)*/
  return HCI_COMMAND_DISALLOWED_ERR_CODE;
#endif
}

tBleStatus TMAPAPP_PlayPause(void)
{
#if (APP_MCP_ROLE_CLIENT_SUPPORT == 1u)
  tBleStatus status = HCI_COMMAND_DISALLOWED_ERR_CODE;
  GAF_Profiles_Link_t current_link;

  for (uint8_t i = 0; i < CFG_BLE_NUM_LINK; i++)
  {
    if (TMAPAPP_Context.ACL_Conn[i].Acl_Conn_Handle != 0xFFFFu)
    {
      APP_ACL_Conn_t *p_conn = APP_GetACLConn(TMAPAPP_Context.ACL_Conn[i].Acl_Conn_Handle);
      if (p_conn != 0)
      {
        current_link = CAP_GetCurrentLinkedGAFProfiles(p_conn->Acl_Conn_Handle);
        if ((current_link & MCP_LINK) == MCP_LINK)
        {
          status = MCP_CLIENT_ReadMediaState(p_conn->Acl_Conn_Handle,
                                             p_conn->GenericMediaPlayerCCID);
          if (status != BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("  Fail   : MCP_CLIENT_ReadMediaState with ConnHandle 0x%04X and CCID %d - result: 0x%02X\n",
                         p_conn->Acl_Conn_Handle,
                         p_conn->GenericMediaPlayerCCID,
                         status);
          }
          else
          {
            if (p_conn != 0)
            {
              p_conn->CurrentContentCtrlOp |= MCP_CLT_OP_READ_MEDIA_STATE;
            }
            p_conn->PlayPauseOperation = 1u;
            LOG_INFO_APP("  Success: MCP_CLIENT_ReadMediaState with ConnHandle 0x%04X and CCID %d\n",
                         p_conn->Acl_Conn_Handle,
                         p_conn->GenericMediaPlayerCCID);
          }
        }
      }
    }
  }
  return status;
#else /*#if (APP_MCP_ROLE_CLIENT_SUPPORT == 1u)*/
  return HCI_COMMAND_DISALLOWED_ERR_CODE;
#endif
}

