STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_TMAP_Peripheral/STM32_WPAN/App/tmap_app.c
tBleStatus TMAPAPP_AnswerCall(void)
{
#if (APP_CCP_ROLE_CLIENT_SUPPORT == 1u)

  tBleStatus status = HCI_COMMAND_DISALLOWED_ERR_CODE;
  GAF_Profiles_Link_t current_link;

  for (uint8_t i = 0; i < CFG_BLE_NUM_LINK; i++)
  {
    if (TMAPAPP_Context.ACL_Conn[i].Acl_Conn_Handle != 0xFFFFu)
    {
      APP_ACL_Conn_t *p_conn = APP_GetACLConn(TMAPAPP_Context.ACL_Conn[i].Acl_Conn_Handle);
      if (p_conn != 0)
      {
        current_link = CAP_GetCurrentLinkedGAFProfiles(p_conn->Acl_Conn_Handle);
        if ((p_conn != 0) && ((current_link & CCP_LINK) == CCP_LINK) && (p_conn->CurrentCallState == CCP_CS_INCOMING))
        {
          status = CCP_CLIENT_AnswerIncomingCall(p_conn->Acl_Conn_Handle,
                                              p_conn->GenericTelephoneBearerCCID,
                                              p_conn->CurrentCallID);
          if (status != BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("  Fail   : CCP_CLIENT_AnswerIncomingCall with ConnHandle 0x%04X and CCID %d - result: 0x%02X\n",
                         p_conn->Acl_Conn_Handle,
                         p_conn->GenericTelephoneBearerCCID,
                         status);
          }
          else
          {
            if (p_conn != 0)
            {
              p_conn->CurrentContentCtrlOp |= CCP_CLT_OP_ANSWER_INC_CALL;
            }
            LOG_INFO_APP("  Success: CCP_CLIENT_AnswerIncomingCall with ConnHandle 0x%04X and CCID %d\n",
                         p_conn->Acl_Conn_Handle,
                         p_conn->GenericTelephoneBearerCCID);
            status = BLE_STATUS_SUCCESS;
          }
        }
      }
    }
  }
  return status;
#else /*#if (APP_CCP_ROLE_CLIENT_SUPPORT == 1u)*/
  return HCI_COMMAND_DISALLOWED_ERR_CODE;
#endif
}

tBleStatus TMAPAPP_TerminateCall(void)
{
#if (APP_CCP_ROLE_CLIENT_SUPPORT == 1u)

  tBleStatus status = HCI_COMMAND_DISALLOWED_ERR_CODE;
  GAF_Profiles_Link_t current_link;

  for (uint8_t i = 0; i < CFG_BLE_NUM_LINK; i++)
  {
    if (TMAPAPP_Context.ACL_Conn[i].Acl_Conn_Handle != 0xFFFFu)
    {
      APP_ACL_Conn_t *p_conn = APP_GetACLConn(TMAPAPP_Context.ACL_Conn[i].Acl_Conn_Handle);
      if (p_conn != 0)
      {
        current_link = CAP_GetCurrentLinkedGAFProfiles(p_conn->Acl_Conn_Handle);
        if ((p_conn != 0) && ((current_link & CCP_LINK) == CCP_LINK) && (p_conn->CurrentCallState != CCP_CS_IDLE))
        {
          status = CCP_CLIENT_TerminateCall(p_conn->Acl_Conn_Handle,
                                         p_conn->GenericTelephoneBearerCCID,
                                         p_conn->CurrentCallID);
          if (status != BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("  Fail   : CCP_CLIENT_TerminateCall with ConnHandle 0x%04X and CCID %d - result: 0x%02X\n",
                         p_conn->Acl_Conn_Handle,
                         p_conn->GenericTelephoneBearerCCID,
                         status);
          }
          else
          {
            if (p_conn != 0)
            {
              p_conn->CurrentContentCtrlOp |= CCP_CLT_OP_TERMINATE_CALL;
            }
            LOG_INFO_APP("  Success: CCP_CLIENT_TerminateCall with ConnHandle 0x%04X and CCID %d\n",
                         p_conn->Acl_Conn_Handle,
                         p_conn->GenericTelephoneBearerCCID);
            status = BLE_STATUS_SUCCESS;
          }
        }
      }
    }
  }
  return status;
#else /*#if (APP_CCP_ROLE_CLIENT_SUPPORT == 1u)*/
  return HCI_COMMAND_DISALLOWED_ERR_CODE;
#endif
}

/**
  * @brief The BLE Audio Stack requests to be executed. BLE_AUDIO_STACK_Task() shall be called.
  * @note  If the Host task is executed in a separate thread, the thread shall be unlocked here.
  */
void BLE_AUDIO_STACK_NotifyToRun(void)
{
  APP_NotifyToRun();
}

void APP_NotifyTxAudioCplt(uint16_t AudioFrameSize)
{
  uint8_t i;
  for (i = 0; i< APP_MAX_NUM_CIS; i++)
  {
    if (TMAPAPP_Context.cis_snk_handle[i] != 0xFFFFu)
    {
      CODEC_ReceiveData(TMAPAPP_Context.cis_snk_handle[i], 1, &aSnkBuff[0] + AudioFrameSize/2 + i);
    }
  }
#if ((APP_TMAP_ROLE & TMAP_ROLE_BROADCAST_MEDIA_RECEIVER) == TMAP_ROLE_BROADCAST_MEDIA_RECEIVER)
  if (TMAPAPP_Context.bap_role & BAP_ROLE_BROADCAST_SINK)
  {
    if (TMAPAPP_Context.BSNK.BIGSyncState == APP_BIG_SYNC_STATE_SYNCHRONIZED)
    {
      for (i = 0; i< TMAPAPP_Context.BSNK.current_num_bis; i++)
      {
        CODEC_ReceiveData(TMAPAPP_Context.BSNK.current_BIS_conn_handles[i], 1, &aSnkBuff[0]  + AudioFrameSize/2 + i);
      }
    }
  }
#endif /*((APP_TMAP_ROLE & TMAP_ROLE_BROADCAST_MEDIA_RECEIVER) == TMAP_ROLE_BROADCAST_MEDIA_RECEIVER)*/
}

void APP_NotifyTxAudioHalfCplt(void)
{
  uint8_t i;
  for (i = 0; i< APP_MAX_NUM_CIS; i++)
  {
    if (TMAPAPP_Context.cis_snk_handle[i] != 0xFFFFu)
    {
      CODEC_ReceiveData(TMAPAPP_Context.cis_snk_handle[i], 1, &aSnkBuff[0] + i);
    }
  }
#if ((APP_TMAP_ROLE & TMAP_ROLE_BROADCAST_MEDIA_RECEIVER) == TMAP_ROLE_BROADCAST_MEDIA_RECEIVER)
  if (TMAPAPP_Context.bap_role & BAP_ROLE_BROADCAST_SINK)
  {
    if (TMAPAPP_Context.BSNK.BIGSyncState == APP_BIG_SYNC_STATE_SYNCHRONIZED)
    {
      for (i = 0; i< TMAPAPP_Context.BSNK.current_num_bis; i++)
      {
        CODEC_ReceiveData(TMAPAPP_Context.BSNK.current_BIS_conn_handles[i], 1, &aSnkBuff[0] + i);
      }
    }
  }
#endif /*((APP_TMAP_ROLE & TMAP_ROLE_BROADCAST_MEDIA_RECEIVER) == TMAP_ROLE_BROADCAST_MEDIA_RECEIVER)*/
}

void CODEC_NotifyDataReady(uint16_t conn_handle, void* decoded_data, uint8_t channel_idx, uint8_t channel_nb)
{
  /* When only one channel is active, duplicate it for fake stereo on SAI */
  uint32_t i;
  uint16_t *pData = (uint16_t *)(decoded_data);   /* 16 bits samples */

  if(pData == (pPrevData + 1)){
    /* we start receiving two channels */
    Nb_Active_Ch = 2;
  }
  pPrevData = pData;

  if (Nb_Active_Ch < 2)
  {
    for (i = 0; i < Sink_frame_size/2; i+=2)
    {
      /* decoded_data is organized with a decimation equal to 2, so we duplicate each sample */
      pData[i+1] = pData[i];
    }
  }
}

