STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_TMAP_Peripheral/STM32_WPAN/App/tmap_app.c
void APP_NotifyRxAudioCplt(uint16_t AudioFrameSize)
{
  uint8_t i;

  for (i = 0; i< APP_MAX_NUM_CIS; i++)
  {
    if (TMAPAPP_Context.cis_src_handle[i] != 0xFFFFu)
    {
      CODEC_SendData(TMAPAPP_Context.cis_src_handle[i], 1, &aSrcBuff[0] + AudioFrameSize/2 + i);
    }
  }
}

void APP_NotifyRxAudioHalfCplt(void)
{
  uint8_t i;

  for (i = 0; i< APP_MAX_NUM_CIS; i++)
  {
    if (TMAPAPP_Context.cis_src_handle[i] != 0xFFFFu)
    {
      CODEC_SendData(TMAPAPP_Context.cis_src_handle[i], 1, &aSrcBuff[0]+i);
    }
  }
}

void TMAPAPP_AclConnected(uint16_t ConnHandle, uint8_t Peer_Address_Type, uint8_t Peer_Address[6], uint8_t role)
{
  APP_ACL_Conn_t *p_conn = APP_GetACLConn(ConnHandle);
  if (p_conn == 0)
  {
    p_conn = APP_AllocateACLConn(ConnHandle);
  }
  if (p_conn != 0)
  {
    p_conn->AudioProfile = AUDIO_PROFILE_NONE;
    Menu_SetProfilesLinked(p_conn->AudioProfile);
    p_conn->CAPLinkupState = APP_CAP_LINKUP_STATE_NONE;
    p_conn->Peer_Address_Type = Peer_Address_Type;
    for (uint8_t i = 0 ; i < 6u; i++)
    {
      p_conn->Peer_Address[i] = Peer_Address[i];
    }
    p_conn->Role = role;
    for (uint8_t i = 0; i < CFG_BLE_NUM_LINK;i++)
    {
      if (TMAPAPP_Context.aASEs[i].acl_conn_handle == 0xFFFFu)
      {
        p_conn->pASEs = &TMAPAPP_Context.aASEs[i];
        p_conn->pASEs->acl_conn_handle = ConnHandle;
        break;
      }
    }

    /* Set Available Audio Contexts */
    p_conn->AvailableSnkAudioContext = TMAPAPP_Context.AvailableSnkAudioContext;
    p_conn->AvailableSrcAudioContext = TMAPAPP_Context.AvailableSrcAudioContext;

    TMAPAPP_Context.NumConn++;
    if (TMAPAPP_Context.NumConn < CFG_BLE_NUM_LINK )
    {
      tBleStatus status;
      uint8_t enable_solicitation_request = 0;
      TMAPAPP_StopAdvertising();

      if (TMAPAPP_Context.BroadcastMode == APP_BROADCAST_MODE_SCAN_DELEGATOR)
      {
        enable_solicitation_request = 1;
      }

      /* Start Advertising */
      if (TMAPAPP_Context.CSIPRank > 0)
      {
        status = TMAPAPP_StartAdvertising(CAP_GENERAL_ANNOUNCEMENT, enable_solicitation_request, GAP_APPEARANCE_EARBUD);
      }
      else
      {
        status = TMAPAPP_StartAdvertising(CAP_GENERAL_ANNOUNCEMENT, enable_solicitation_request, GAP_APPEARANCE_HEADPHONES);
      }
      LOG_INFO_APP("TMAPAPP_StartAdvertising() returns status 0x%02X\n",status);
      UNUSED(status);
    }
  }
}

void TMAPAPP_ConfirmIndicationRequired(uint16_t Conn_Handle)
{
  APP_ACL_Conn_t *p_conn = APP_GetACLConn(Conn_Handle);
  if (p_conn != 0)
  {
    p_conn->ConfirmIndicationRequired = 1u;
  }
}

void TMAPAPP_BondLost(uint16_t Conn_Handle)
{
  /* Force COMPLETE_LINKUP */
  APP_ACL_Conn_t *p_conn = APP_GetACLConn(Conn_Handle);
  if (p_conn != 0)
  {
    switch (p_conn->CAPLinkupState)
    {
      case APP_CAP_LINKUP_STATE_NONE:
      case APP_CAP_LINKUP_STATE_STARTED_RESTORE:
      {
        p_conn->ForceCompleteLinkup = 1u;
        break;
      }
      case APP_CAP_LINKUP_STATE_DONE_RESTORE:
      {
        tBleStatus ret;

        /* Unlink CAP to perform CAP Complete Linkup */
        CAP_Unlink(p_conn->Acl_Conn_Handle, MCP_LINK | CCP_LINK, 0x00);
        ret = CAP_Linkup(p_conn->Acl_Conn_Handle, MCP_LINK | CCP_LINK, 0x01);
        LOG_INFO_APP("CAP_Linkup() on ConnHandle 0x%04x for link mask 0x%02X returns status 0x%02X\n",
                    p_conn->Acl_Conn_Handle,
                    MCP_LINK | CCP_LINK,
                    ret);
        UNUSED(ret);
        p_conn->CAPLinkupState = APP_CAP_LINKUP_STATE_STARTED_COMPLETE;
        break;
      }
      default:
      {
        /* Nothing to do */
        break;
      }
    }
  }
}

void TMAPAPP_CISConnected(uint16_t Conn_Handle)
{
  for (uint8_t i = 0; i< APP_MAX_NUM_CIS; i++)
  {
    if (TMAPAPP_Context.cis_handle[i] == 0xFFFFu)
    {
      TMAPAPP_Context.cis_handle[i] = Conn_Handle;
      TMAPAPP_Context.num_cis_established++;
      break;
    }
  }
}

void TMAPAPP_LinkDisconnected(uint16_t Conn_Handle,uint8_t Reason)
{
  uint8_t i;
  uint8_t status;
  Audio_Context_t snk_context = 0x0000;
  Audio_Context_t src_context = 0x0000;

  APP_ACL_Conn_t *p_conn = APP_GetACLConn(Conn_Handle);
  if (p_conn != 0)
  {
    /*Free CAP Connection Slot*/
    p_conn->Acl_Conn_Handle = 0xFFFFu;
    p_conn->AudioProfile = AUDIO_PROFILE_NONE;
    Menu_SetProfilesLinked(p_conn->AudioProfile);
    p_conn->CAPLinkupState = APP_CAP_LINKUP_STATE_NONE;
    p_conn->LinkupRetry = 0;
    p_conn->ConfirmIndicationRequired = 0u;
    p_conn->ForceCompleteLinkup = 0u;
    p_conn->CurrentContentCtrlOp = 0x0000;
    p_conn->PendingContentCtrlOp = 0x0000;
    TMAPAPP_Context.NumConn--;

    /* Stop Sink if device was connected to Broadcast Assistant */
    TMAPAPP_StopSink();

#if (APP_NUM_SNK_ASE > 0u)
    for ( i = 0; i < APP_NUM_SNK_ASE;i++)
    {
      if (p_conn->pASEs->aSnkASE[i].allocated != 0x00)
      {
        if ( p_conn->pASEs->aSnkASE[i].streaming_audio_context != 0x0000u)
        {
          /* Calculate the available Audio Contexts now ASEs have 'released' streaming audio contexts */
          snk_context |= APP_ReleasedASEStreamingAudioContexts(p_conn,
                                                               &p_conn->pASEs->aSnkASE[i],
                                                               p_conn->pASEs->aSnkASE[i].streaming_audio_context);
        }
        LOG_INFO_APP("Free ASE ID %d on ACL connection handle 0x%04X\n",p_conn->pASEs->aSnkASE[i].ID,Conn_Handle);
        p_conn->pASEs->aSnkASE[i].ID = 0x00;
        p_conn->pASEs->aSnkASE[i].state  = ASE_STATE_IDLE;
        p_conn->pASEs->aSnkASE[i].num_channels  = 0x00;
        p_conn->pASEs->aSnkASE[i].streaming_audio_context = 0x00u;
        p_conn->pASEs->aSnkASE[i].allocated = 0x00u;
      }
    }
#endif /*(APP_NUM_SNK_ASE > 0u)*/
#if (APP_NUM_SRC_ASE > 0u)
    for ( i = 0; i < APP_NUM_SRC_ASE;i++)
    {
      if (p_conn->pASEs->aSrcASE[i].allocated != 0x00)
      {
        if ( p_conn->pASEs->aSrcASE[i].streaming_audio_context != 0x0000u)
        {
          /* Calculate the available Audio Contexts now ASEs have 'released' streaming audio contexts */
          src_context |= APP_ReleasedASEStreamingAudioContexts(p_conn,
                                                               &p_conn->pASEs->aSrcASE[i],
                                                               p_conn->pASEs->aSrcASE[i].streaming_audio_context);
        }
        LOG_INFO_APP("Free ASE ID %d on ACL connection handle 0x%04X\n",p_conn->pASEs->aSrcASE[i].ID,Conn_Handle);
        p_conn->pASEs->aSrcASE[i].ID = 0x00;
        p_conn->pASEs->aSrcASE[i].state  = ASE_STATE_IDLE;
        p_conn->pASEs->aSrcASE[i].num_channels  = 0x00;
        p_conn->pASEs->aSrcASE[i].streaming_audio_context = 0x00u;
        p_conn->pASEs->aSrcASE[i].allocated = 0x00u;
      }
    }
#endif /*(APP_NUM_SRC_ASE > 0u)*/

    p_conn->pASEs->acl_conn_handle = 0xFFFFu;
    p_conn->pASEs = 0;
    p_conn->AvailableSnkAudioContext = 0x0000u;
    p_conn->AvailableSrcAudioContext = 0x0000u;

    /* if context are now available, update them */
    if ((snk_context != 0x0000) || (src_context != 0x0000) )
    {
      uint8_t enable_ongoing = 0u;
      APP_ACL_Conn_t *p_other_conn;

      TMAPAPP_Context.AvailableSnkAudioContext |= snk_context;
      TMAPAPP_Context.AvailableSrcAudioContext |= src_context;

      /* Check if all supported audio contexts are now available and so AUDIO_CONTEXT_UNSPECIFIED should be also
       * set as available.
       */
      if (snk_context != 0x0000)
      {
        /*Check if "Unspecified Audio Context" should be add in available Audio Contexts now*/
        if ( (TMAPAPP_Context.AvailableSnkAudioContext | AUDIO_CONTEXT_UNSPECIFIED) == SUPPORTED_SNK_CONTEXTS)
        {
          TMAPAPP_Context.AvailableSnkAudioContext |= AUDIO_CONTEXT_UNSPECIFIED;
        }
      }
      if (src_context != 0x0000)
      {
        /*Check if "Unspecified Audio Context" should be add in available Audio Contexts now*/
        if ( (TMAPAPP_Context.AvailableSrcAudioContext | AUDIO_CONTEXT_UNSPECIFIED) == SUPPORTED_SRC_CONTEXTS)
        {
          TMAPAPP_Context.AvailableSrcAudioContext |= AUDIO_CONTEXT_UNSPECIFIED;
        }
      }

