STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_TMAP_Peripheral/STM32_WPAN/App/tmap_app.c
      status = CAP_SetAvailableAudioContexts(TMAPAPP_Context.AvailableSnkAudioContext,
                                             TMAPAPP_Context.AvailableSrcAudioContext);
      if (status == BLE_STATUS_SUCCESS)
      {
        LOG_INFO_APP("Set Available Snk Audio Contexts 0x%04X and Available Src Audio Contexts 0x%04X\n",
                     TMAPAPP_Context.AvailableSnkAudioContext,
                     TMAPAPP_Context.AvailableSrcAudioContext);
      }
      else
      {
        LOG_INFO_APP("FAILURE to Set Available Snk Audio Contexts 0x%04X and Available Src Audio Contexts 0x%04X\n",
                     TMAPAPP_Context.AvailableSnkAudioContext,
                     TMAPAPP_Context.AvailableSrcAudioContext);
      }
      /*check if a response to an Enable operation Request is suspended with another CAP Initiator*/
      for (uint8_t conn = 0u; conn < CFG_BLE_NUM_LINK ; conn++)
      {
        if ((TMAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle != 0xFFFFu) && (&TMAPAPP_Context.ACL_Conn[conn] != p_conn))
        {
          p_other_conn = &TMAPAPP_Context.ACL_Conn[conn];
#if (APP_NUM_SNK_ASE > 0u)
          for ( uint8_t i = 0; i < TMAPAPP_Context.NumSnkASEs;i++)
          {
            if (p_other_conn->pASEs->aSnkASE[i].allocated == 1)
            {
              if (p_other_conn->pASEs->aSnkASE[i].enable_req == 1)
              {
                enable_ongoing = 1u;
                /* Send an response to the Enable Operation request if no CIS is still up*/
                if (TMAPAPP_Context.num_cis_established == 0u)
                {
                  status = CAP_Unicast_EnableOpRsp(p_other_conn->Acl_Conn_Handle,
                                                   p_other_conn->pASEs->aSnkASE[i].ID,
                                                   ASE_OP_RESP_SUCCESS,
                                                   ASE_OP_RESP_NO_REASON);
                  if (status != BLE_STATUS_SUCCESS)
                  {
                    LOG_INFO_APP("  Fail   : Enable Operation Response returns status 0x%02X for ASE ID %d on ConnHandle 0x%04X\n",
                                 status,
                                 p_other_conn->pASEs->aSnkASE[i].ID,
                                 p_other_conn->Acl_Conn_Handle);
                  }
                  else
                  {
                    LOG_INFO_APP("  Success: Enable Operation Response for ASE ID %d on ConnHandle 0x%04X\n",
                                 p_other_conn->pASEs->aSnkASE[i].ID,
                                 p_other_conn->Acl_Conn_Handle);
                  }
                }
              }
            }
          }
#endif /* (APP_NUM_SNK_ASE > 0u) */
#if (APP_NUM_SRC_ASE > 0u)
          for ( uint8_t i = 0; i < TMAPAPP_Context.NumSrcASEs;i++)
          {
            if (p_other_conn->pASEs->aSrcASE[i].allocated == 1)
            {
              if (p_other_conn->pASEs->aSrcASE[i].enable_req == 1)
              {
                enable_ongoing = 1u;
                /* Send an response to the Enable Operation request if no CIS is still up*/
                if (TMAPAPP_Context.num_cis_established == 0u)
                {
                  status = CAP_Unicast_EnableOpRsp(p_other_conn->Acl_Conn_Handle,
                                p_other_conn->pASEs->aSrcASE[i].ID,
                                ASE_OP_RESP_SUCCESS,
                                ASE_OP_RESP_NO_REASON);
                  if (status != BLE_STATUS_SUCCESS)
                  {
                    LOG_INFO_APP("  Fail   : Enable Operation Response returns status 0x%02X for ASE ID %d on ConnHandle 0x%04X\n",
                                 status,
                                 p_other_conn->pASEs->aSrcASE[i].ID,
                                 p_other_conn->Acl_Conn_Handle);
                  }
                  else
                  {
                    LOG_INFO_APP("  Success: Enable Operation Response for ASE ID %d on ConnHandle 0x%04X\n",
                                 p_other_conn->pASEs->aSrcASE[i].ID,
                                 p_other_conn->Acl_Conn_Handle);
                  }
                }
              }
            }
          }
#endif /* (APP_NUM_SRC_ASE > 0u) */
        }
      }
      /* Check if no response to an Enable Request is in progress to update Audio Contexts availability to
      * the connected CAP Initiators.
      */
      if (enable_ongoing == 0u)
      {
        for (uint8_t conn = 0u; conn < CFG_BLE_NUM_LINK ; conn++)
        {
          if (TMAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle != 0xFFFFu)
          {
            p_other_conn = &TMAPAPP_Context.ACL_Conn[conn];
            if ((p_other_conn->AvailableSnkAudioContext != TMAPAPP_Context.AvailableSnkAudioContext) \
                || (p_other_conn->AvailableSrcAudioContext != TMAPAPP_Context.AvailableSrcAudioContext))
            {
              /*update the available Audio Contexts of the all the connected CAP Initiators*/
              status = CAP_UpdateAvailableAudioContexts(p_other_conn->Acl_Conn_Handle,
                                                        TMAPAPP_Context.AvailableSnkAudioContext,
                                                        TMAPAPP_Context.AvailableSrcAudioContext);
              LOG_INFO_APP("Send Update Available Snk Audio Contexts 0x%04X and Available Src Audio Contexts 0x%04X with CAP Initiator on ConnHandle 0x%04X returns status 0x%02X\n",
                           TMAPAPP_Context.AvailableSnkAudioContext,
                           TMAPAPP_Context.AvailableSrcAudioContext,
                           p_other_conn->Acl_Conn_Handle,
                           status);
              p_other_conn->AvailableSnkAudioContext = TMAPAPP_Context.AvailableSnkAudioContext;
              p_other_conn->AvailableSrcAudioContext = TMAPAPP_Context.AvailableSrcAudioContext;
              UNUSED(status);
            }
            else
            {
              LOG_INFO_APP("Available Snk Audio Contexts 0x%04X and Available Src Audio Contexts 0x%04X with CAP Initiator on ConnHandle 0x%04X haven't changed\n",
                           TMAPAPP_Context.AvailableSnkAudioContext,
                           TMAPAPP_Context.AvailableSrcAudioContext,
                           p_other_conn->Acl_Conn_Handle);
            }
          }
        }
      }
    }
    /* Check if the disconnection is issued to a local User action*/
    if (Reason != HCI_CONNECTION_TERMINATED_BY_LOCAL_HOST_ERR_CODE)
    {
      uint8_t enable_solicitation_request = 0;
      if (TMAPAPP_Context.BroadcastMode == APP_BROADCAST_MODE_SCAN_DELEGATOR)
      {
        enable_solicitation_request = 1;
      }

