STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_TMAP_Peripheral/STM32_WPAN/App/tmap_app.c
      TMAPAPP_StopAdvertising();
      /* Start Advertising */
      if (TMAPAPP_Context.CSIPRank > 0)
      {
        status = TMAPAPP_StartAdvertising(CAP_GENERAL_ANNOUNCEMENT, enable_solicitation_request, GAP_APPEARANCE_EARBUD);
      }
      else
      {
        status = TMAPAPP_StartAdvertising(CAP_GENERAL_ANNOUNCEMENT, enable_solicitation_request, GAP_APPEARANCE_HEADPHONES);
      }
      LOG_INFO_APP("TMAPAPP_StartAdvertising() returns status 0x%02X\n",status);
      Menu_SetWaitConnPage();
    }
    else
    {
      TMAPAPP_StopAdvertising();
      Menu_SetStartupPage();
    }
    UNUSED(status);
  }
  else
  {
    /* Check if the Connection Handle corresponds to a CIS link */
    for (uint8_t i = 0; i< APP_MAX_NUM_CIS; i++)
    {
      if (TMAPAPP_Context.cis_handle[i] == Conn_Handle)
      {
        TMAPAPP_Context.cis_handle[i] = 0xFFFFu;
        TMAPAPP_Context.num_cis_established--;
        if (TMAPAPP_Context.num_cis_established == 0u)
        {
          LOG_INFO_APP("Deinitialized Audio Peripherals\n");
          MX_AudioDeInit();
#if (CFG_LCD_SUPPORTED == 1)
          Menu_SetNoStreamPage();
#endif /* (CFG_LCD_SUPPORTED == 1) */
          /*check if a response to an Enable operation Request is suspended with another CAP Initiator*/
          for (uint8_t conn = 0u; conn < CFG_BLE_NUM_LINK ; conn++)
          {
            if (TMAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle != 0xFFFFu)
            {
              p_conn = &TMAPAPP_Context.ACL_Conn[conn];
#if (APP_NUM_SNK_ASE > 0u)
              for ( uint8_t i = 0; i < TMAPAPP_Context.NumSnkASEs;i++)
              {
                if (p_conn->pASEs->aSnkASE[i].allocated == 1)
                {
                  if (p_conn->pASEs->aSnkASE[i].enable_req == 1)
                  {
                    status = CAP_Unicast_EnableOpRsp(p_conn->Acl_Conn_Handle,
                                  p_conn->pASEs->aSnkASE[i].ID,
                                  ASE_OP_RESP_SUCCESS,
                                  ASE_OP_RESP_NO_REASON);
                    LOG_INFO_APP("Enable Operation Response returns status 0x%02X for ASE ID %d on ConnHandle 0x%04X\n",
                                status,
                                p_conn->pASEs->aSnkASE[i].ID,
                                p_conn->Acl_Conn_Handle);
                  }
                }
              }
#endif /* (APP_NUM_SNK_ASE > 0u) */
#if (APP_NUM_SRC_ASE > 0u)
              for ( uint8_t i = 0; i < TMAPAPP_Context.NumSrcASEs;i++)
              {
                if (p_conn->pASEs->aSrcASE[i].allocated == 1)
                {
                  if (p_conn->pASEs->aSrcASE[i].enable_req == 1)
                  {
                    status = CAP_Unicast_EnableOpRsp(p_conn->Acl_Conn_Handle,
                                  p_conn->pASEs->aSrcASE[i].ID,
                                  ASE_OP_RESP_SUCCESS,
                                  ASE_OP_RESP_NO_REASON);
                    LOG_INFO_APP("Enable Operation Response returns status 0x%02X for ASE ID %d on ConnHandle 0x%04X\n",
                                status,
                                p_conn->pASEs->aSrcASE[i].ID,
                                p_conn->Acl_Conn_Handle);
                  }
                }
              }
#endif /* (APP_NUM_SRC_ASE > 0u) */
            }
          }
        }
        break;
      }
    }
  }
}

uint8_t TMAPAPP_SyncToPA(uint8_t AdvSID, uint8_t *pAdvAddress, uint8_t AdvAddressType)
{
#if ((APP_TMAP_ROLE & TMAP_ROLE_BROADCAST_MEDIA_RECEIVER) == TMAP_ROLE_BROADCAST_MEDIA_RECEIVER)
  uint8_t status;
  TMAPAPP_Context.BSNK.PASyncState = APP_PA_SYNC_STATE_SYNCHRONIZING;
  status = CAP_Broadcast_StartPASync(AdvSID,
                                     pAdvAddress,
                                     AdvAddressType,
                                     PA_EVENT_SKIP,
                                     PA_SYNC_TIMEOUT);
  LOG_INFO_APP("==>> Starting Broadcasting DiscoveryDevice with Source %02X:%02X:%02X:%02X:%02X:%02X\n",
                    pAdvAddress[5],
                    pAdvAddress[4],
                    pAdvAddress[3],
                    pAdvAddress[2],
                    pAdvAddress[1],
                    pAdvAddress[0]);
  if (status != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : CAP_Broadcast_StartPASync() function, result: 0x%02X\n", status);
  }
  else
  {
    LOG_INFO_APP("  Success: CAP_Broadcast_StartPASync() function\n");
  }
  return status;
#else /*((APP_TMAP_ROLE & TMAP_ROLE_BROADCAST_MEDIA_RECEIVER) == TMAP_ROLE_BROADCAST_MEDIA_RECEIVER)*/
  return HCI_UNSUPPORTED_FEATURE_OR_PARAMETER_VALUE_ERR_CODE;
#endif /*((APP_TMAP_ROLE & TMAP_ROLE_BROADCAST_MEDIA_RECEIVER) == TMAP_ROLE_BROADCAST_MEDIA_RECEIVER)*/
}

uint8_t TMAPAPP_StartSink(void)
{
#if ((APP_TMAP_ROLE & TMAP_ROLE_BROADCAST_MEDIA_RECEIVER) == TMAP_ROLE_BROADCAST_MEDIA_RECEIVER)
  uint8_t ret;

  LOG_INFO_APP(">>==  Start Sink\n");

  ret = CAP_Broadcast_StartAdvReportParsing();
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : CAP_Broadcast_StartAdvReportParsing() function, result: 0x%02X\n", ret);
  }
  else
  {
    LOG_INFO_APP("  Success: CAP_Broadcast_StartAdvReportParsing() function\n");
  }

  if (ret == BLE_STATUS_SUCCESS)
  {
    Scan_Param_Phy_t scan_param_phy;
    scan_param_phy.Scan_Type     = 0x00; /*Passive scanning*/
    scan_param_phy.Scan_Interval = SCAN_INTERVAL;
    scan_param_phy.Scan_Window   = SCAN_WINDOW;
    /* Starts an Observation procedure */
    ret = aci_gap_ext_start_scan( 0x00,
                                  GAP_OBSERVATION_PROC,
                                  0x00,                         /* Address type: Public */
                                  0x00,                         /* Filter duplicates: No */
                                  0x00,                         /* Scan continuously until explicitly disable */
                                  0x00,                         /* Scan continuously */
                                  0x00,                         /* Filter policy: Accept all */
                                  HCI_SCANNING_PHYS_LE_1M,
                                  &scan_param_phy);
    if (ret != BLE_STATUS_SUCCESS)
    {
      LOG_INFO_APP("  Fail   : aci_gap_ext_start_scan() function with Scan procedure 0x%02X, result: 0x%02X\n",
                   GAP_OBSERVATION_PROC,
                   ret);
    }
    else
    {
      LOG_INFO_APP("  Success: aci_gap_ext_start_scan() function with Scan procedure 0x%02X\n",
                   GAP_OBSERVATION_PROC);
      TMAPAPP_Context.BSNK.ScanState = APP_SCAN_STATE_SCANNING;
    }
  }

  return ret;
#else /*((APP_TMAP_ROLE & TMAP_ROLE_BROADCAST_MEDIA_RECEIVER) == TMAP_ROLE_BROADCAST_MEDIA_RECEIVER)*/
  return HCI_UNSUPPORTED_FEATURE_OR_PARAMETER_VALUE_ERR_CODE;
#endif /*((APP_TMAP_ROLE & TMAP_ROLE_BROADCAST_MEDIA_RECEIVER) == TMAP_ROLE_BROADCAST_MEDIA_RECEIVER)*/
}

uint8_t TMAPAPP_StopSink(void)
{
#if ((APP_TMAP_ROLE & TMAP_ROLE_BROADCAST_MEDIA_RECEIVER) == TMAP_ROLE_BROADCAST_MEDIA_RECEIVER)
  uint8_t ret = BLE_STATUS_SUCCESS;

  LOG_INFO_APP(">>==  Start Stop Broadcast Sink\n");

  if (TMAPAPP_Context.BSNK.ScanState == APP_SCAN_STATE_SCANNING)
  {
    ret = CAP_Broadcast_StopAdvReportParsing();
    if (ret != BLE_STATUS_SUCCESS)
    {
      LOG_INFO_APP("  Fail   : CAP_Broadcast_StopAdvReportParsing() function, result: 0x%02X\n", ret);
    }
    else
    {
      LOG_INFO_APP("  Success: CAP_Broadcast_StopAdvReportParsing() function\n");
    }

    ret = aci_gap_terminate_gap_proc(GAP_OBSERVATION_PROC);
    if (ret != BLE_STATUS_SUCCESS)
    {
      LOG_INFO_APP("  Fail   : aci_gap_terminate_gap_proc() function, result: 0x%02X\n", ret);
    }
    else
    {
      TMAPAPP_Context.BSNK.ScanState = APP_SCAN_STATE_IDLE;
      LOG_INFO_APP("  Success: aci_gap_terminate_gap_proc() function\n");
    }
  }

