STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_TMAP_Peripheral/STM32_WPAN/App/tmap_app.c
  if (TMAPAPP_Context.BSNK.PASyncState != APP_PA_SYNC_STATE_IDLE)
  {
    ret = CAP_Broadcast_StopPASync(TMAPAPP_Context.BSNK.PASyncHandle);
    if (ret != BLE_STATUS_SUCCESS)
    {
      LOG_INFO_APP("  Fail   : CAP_Broadcast_StopPASync() function, result: 0x%02X\n", ret);
    }
    else
    {
      LOG_INFO_APP("  Success: CAP_Broadcast_StopPASync() function\n");
      TMAPAPP_Context.BSNK.PASyncState = APP_PA_SYNC_STATE_IDLE;
    }
  }

  if (TMAPAPP_Context.BSNK.BIGSyncState != APP_BIG_SYNC_STATE_IDLE)
  {
    ret = CAP_Broadcast_StopBIGSync(BIG_HANDLE);
    if (ret != BLE_STATUS_SUCCESS)
    {
      LOG_INFO_APP("  Fail   : CAP_Broadcast_StopBIGSync() function, result: 0x%02X\n", ret);
    }
    else
    {
      LOG_INFO_APP("  Success: CAP_Broadcast_StopBIGSync() function\n");
      TMAPAPP_Context.BSNK.BIGSyncState = APP_BIG_SYNC_STATE_IDLE;
    }
  }

  LOG_INFO_APP(">>==  End Stop Broadcast Sink\n");
  return ret;

#else /*((APP_TMAP_ROLE & TMAP_ROLE_BROADCAST_MEDIA_RECEIVER) == TMAP_ROLE_BROADCAST_MEDIA_RECEIVER)*/
  return HCI_UNSUPPORTED_FEATURE_OR_PARAMETER_VALUE_ERR_CODE;
#endif /*((APP_TMAP_ROLE & TMAP_ROLE_BROADCAST_MEDIA_RECEIVER) == TMAP_ROLE_BROADCAST_MEDIA_RECEIVER)*/
}

void TMAPAPP_SetBroadcastMode(APP_BroadcastMode_t mode)
{
  TMAPAPP_Context.BroadcastMode = mode;
}

void TMAPAPP_ClearDatabase(void)
{
  BLE_AUDIO_STACK_DB_ClearAllRecords();
}
/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/

static tBleStatus CAPAPP_Init(Audio_Role_t AudioRole, uint8_t csip_config_id)
{
  tBleStatus status;
  Audio_Role_t audio_role = 0;
  Audio_Context_t available_snk_context = 0;
  Audio_Context_t available_src_context = 0;
  Audio_Context_t supported_snk_context = 0;
  Audio_Context_t supported_src_context = 0;
#if (APP_NUM_SNK_PAC_RECORDS > 0u)
  uint8_t a_snk_cap_id[MIN_NUM_BAP_SNK_CODEC_CAP] = BAP_MANDATORY_SNK_CODEC_CAP_LIST;
  uint8_t num_snk_capabilities = 0;
#endif /*(APP_NUM_SNK_PAC_RECORDS > 0u)*/
#if (APP_NUM_SRC_PAC_RECORDS > 0u)
  uint8_t a_src_cap_id[MIN_NUM_BAP_SRC_CODEC_CAP] = BAP_MANDATORY_SRC_CODEC_CAP_LIST;
  uint8_t num_src_capabilities = 0;
#endif /*(APP_NUM_SRC_PAC_RECORDS > 0u)*/
  Audio_Location_t audio_locations = FRONT_LEFT;

  LOG_INFO_APP("CAPAPP_Init() with audio role 0x%02X\n",AudioRole);

  /*Clear the CAP Configuration*/
  memset(&APP_CAP_Config, 0, sizeof(CAP_Config_t));

  /*Clear the BAP Configuration*/
  memset(&APP_BAP_Config, 0, sizeof(BAP_Config_t));

  /*Clear the MICP Configuration*/
  memset(&APP_MICP_Config, 0, sizeof(MICP_Config_t));

  /*Clear the VCP Configuration*/
  memset(&APP_VCP_Config, 0, sizeof(VCP_Config_t));

  /*Clear the CCP Configuration*/
  memset(&APP_CCP_Config, 0, sizeof(CCP_Config_t));

  /*Clear the MCP Configuration*/
  memset(&APP_MCP_Config, 0, sizeof(MCP_Config_t));

  /*Clear the CSIP Configuration*/
  memset(&APP_CSIP_Config, 0, sizeof(CSIP_Config_t));

  APP_CAP_Config.Role = APP_CAP_ROLE;
  APP_CAP_Config.MaxNumLinks = CFG_BLE_NUM_LINK;
  APP_CAP_Config.pStartRamAddr = (uint8_t *)&aCAPMemBuffer;
  APP_CAP_Config.RamSize = CAP_DYN_ALLOC_SIZE;
#if (APP_BAP_ROLE_UNICAST_SERVER_SUPPORT == 1u)
  APP_BAP_Config.Role |= BAP_ROLE_UNICAST_SERVER;
#endif /*(APP_BAP_ROLE_UNICAST_SERVER_SUPPORT == 1u)*/
#if (APP_BAP_ROLE_UNICAST_CLIENT_SUPPORT == 1u)
  APP_BAP_Config.Role |= BAP_ROLE_UNICAST_CLIENT;
#endif /*(APP_BAP_ROLE_UNICAST_CLIENT_SUPPORT == 1u)*/
#if (APP_BAP_ROLE_BROADCAST_SOURCE_SUPPORT == 1u)
  APP_BAP_Config.Role |= BAP_ROLE_BROADCAST_SOURCE;
#endif /*(APP_BAP_ROLE_BROADCAST_SOURCE_SUPPORT == 1u)*/
#if (APP_BAP_ROLE_BROADCAST_SINK_SUPPORT == 1u)
  APP_BAP_Config.Role |= BAP_ROLE_BROADCAST_SINK;
#endif /*(APP_BAP_ROLE_BROADCAST_SINK_SUPPORT == 1u)*/
#if (APP_BAP_ROLE_SCAN_DELEGATOR_SUPPORT == 1u)
  APP_BAP_Config.Role |= BAP_ROLE_SCAN_DELEGATOR;
#endif /*(APP_BAP_ROLE_SCAN_DELEGATOR_SUPPORT == 1u)*/
#if (APP_BAP_ROLE_BROADCAST_ASSISTANT_SUPPORT == 1u)
  APP_BAP_Config.Role |= BAP_ROLE_BROADCAST_ASSISTANT;
#endif /*(APP_BAP_ROLE_BROADCAST_ASSISTANT_SUPPORT == 1u)*/

  APP_BAP_Config.MaxNumBleLinks = CFG_BLE_NUM_LINK;
  APP_BAP_Config.MaxNumUSRLinks = MAX_NUM_USR_LINK;

  /*Published Audio Capabilities of Unicast Server and Broadcast Sink Configuration*/
  APP_BAP_Config.PACSSrvConfig.MaxNumSnkPACRecords = APP_NUM_SNK_PAC_RECORDS;
  APP_BAP_Config.PACSSrvConfig.MaxNumSrcPACRecords = APP_NUM_SRC_PAC_RECORDS;
  APP_BAP_Config.PACSSrvConfig.pStartRamAddr = (uint8_t *)&aPACSSrvMemBuffer;
  APP_BAP_Config.PACSSrvConfig.RamSize = BAP_PACS_SRV_DYN_ALLOC_SIZE;

#if ((APP_TMAP_ROLE & TMAP_ROLE_BROADCAST_MEDIA_RECEIVER) == TMAP_ROLE_BROADCAST_MEDIA_RECEIVER)
  if ((APP_BAP_Config.Role & BAP_ROLE_SCAN_DELEGATOR) == BAP_ROLE_SCAN_DELEGATOR)
  {
    /*Broadcast Audio Scan for Scan Delegator Configuration*/
    APP_BAP_Config.BASSSrvConfig.MaxNumBSRC = MAX_NUM_SDE_BSRC_INFO;
    APP_BAP_Config.BASSSrvConfig.MaxCodecConfSize = MAX_BASS_CODEC_CONFIG_SIZE;
    APP_BAP_Config.BASSSrvConfig.MaxMetadataLength = MAX_BASS_METADATA_SIZE;
    APP_BAP_Config.BASSSrvConfig.MaxNumBaseSubgroups = MAX_NUM_BASS_BASE_SUBGROUPS;
    APP_BAP_Config.BASSSrvConfig.pStartRamAddr = (uint8_t *)&aBASSSrvMemBuffer;
    APP_BAP_Config.BASSSrvConfig.RamSize = BAP_BASS_SRV_DYN_ALLOC_SIZE;
  }

  if (((APP_BAP_Config.Role & BAP_ROLE_SCAN_DELEGATOR) == BAP_ROLE_SCAN_DELEGATOR)
   || ((APP_BAP_Config.Role & BAP_ROLE_BROADCAST_SINK) == BAP_ROLE_BROADCAST_SINK))
  {
    /* BASE structure for fragmented PA reports */
    APP_BAP_Config.BASEStrConfig.pStartRamAddr = (uint8_t *)&aBASEMemBuffer;
    APP_BAP_Config.BASEStrConfig.RamSize = BAP_BASE_TOTAL_BUFFER_SIZE;
  }
#endif /*((APP_TMAP_ROLE & TMAP_ROLE_BROADCAST_MEDIA_RECEIVER) == TMAP_ROLE_BROADCAST_MEDIA_RECEIVER)*/

  /*Audio Stream Endpoint of Unicast Server Configuration*/
  APP_BAP_Config.ASCSSrvConfig.AudioRole = AudioRole;
  APP_BAP_Config.ASCSSrvConfig.MaxNumSnkASEs = APP_NUM_SNK_ASE;
  APP_BAP_Config.ASCSSrvConfig.MaxNumSrcASEs = APP_NUM_SRC_ASE;
  APP_BAP_Config.ASCSSrvConfig.MaxCodecConfSize = MAX_USR_CODEC_CONFIG_SIZE;
  APP_BAP_Config.ASCSSrvConfig.MaxMetadataLength = MAX_USR_METADATA_SIZE;
  APP_BAP_Config.ASCSSrvConfig.CachingEn = APP_ASCS_CACHING;
  APP_BAP_Config.ASCSSrvConfig.pStartRamAddr = (uint8_t *)&aASCSSrvMemBuffer;
  APP_BAP_Config.ASCSSrvConfig.RamSize = BAP_ASCS_SRV_DYN_ALLOC_SIZE;

  /*Isochronous Channels Configuration*/
  APP_BAP_Config.ISOChnlConfig.MaxNumCIG = MAX_NUM_CIG;
  APP_BAP_Config.ISOChnlConfig.MaxNumCISPerCIG = MAX_NUM_CIS_PER_CIG;
  APP_BAP_Config.ISOChnlConfig.MaxNumBIG = MAX_NUM_BIG;
  APP_BAP_Config.ISOChnlConfig.MaxNumBISPerBIG = MAX_NUM_BIS_PER_BIG;
  APP_BAP_Config.ISOChnlConfig.pStartRamAddr = (uint8_t *)&aISOChnlMemBuffer;
  APP_BAP_Config.ISOChnlConfig.RamSize = BAP_ISO_CHNL_DYN_ALLOC_SIZE;

  /* Non-Volatile Memory Management for BAP Services restoration */
  APP_BAP_Config.NvmMgmtConfig.pStartRamAddr = (uint8_t *)&aNvmMgmtMemBuffer;
  APP_BAP_Config.NvmMgmtConfig.RamSize = BAP_NVM_MGMT_DYN_ALLOC_SIZE;

#if (APP_CCP_ROLE_CLIENT_SUPPORT == 1u)
  APP_CCP_Config.Role = CCP_ROLE_CLIENT;
  APP_CCP_Config.MaxNumBleLinks = CFG_BLE_NUM_LINK;
  APP_CCP_Config.Clt.ProceduresMask = CCP_CLT_SUPPORT_PROC_ALL;
  APP_CCP_Config.Clt.MaxNumTBInstPerConn = APP_CCP_NUM_REMOTE_BEARER_INSTANCES;
  APP_CCP_Config.Clt.MaxCallURILength = APP_CCP_CALL_URI_LENGTH;
  APP_CCP_Config.Clt.pStartRamAddr = (uint8_t*)aCCPCltMemBuffer;
  APP_CCP_Config.Clt.RamSize = BLE_CCP_CLT_DYN_ALLOC_SIZE;
#endif /*(APP_CCP_ROLE_CLIENT_SUPPORT == 1u)*/

