STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_TMAP_Peripheral/STM32_WPAN/App/tmap_app.c
  return status;
}

static tBleStatus TMAPAPP_TMAPInit(uint16_t Role)
{
  uint8_t status;
  TMAP_Config_t tmap_config;
  uint8_t i;
#if (APP_NUM_SNK_PAC_RECORDS > 0)
  uint8_t snk_record_i = MIN_NUM_BAP_SNK_PAC_RECORDS;
  uint8_t a_ct_snk_pac_id[MIN_NUM_TMAP_CT_SRC_CODEC_CAP] = TMAP_MANDATORY_CT_SRC_CODEC_CAP_LIST;
  uint8_t a_mr_snk_pac_id[MIN_NUM_TMAP_MR_SNK_CODEC_CAP] = TMAP_MANDATORY_MR_SNK_CODEC_CAP_LIST;
#endif /*(APP_NUM_SNK_PAC_RECORDS > 0)*/
#if (APP_NUM_SRC_PAC_RECORDS > 0)
  uint8_t src_record_i = MIN_NUM_BAP_SRC_PAC_RECORDS;
  uint8_t a_ct_src_pac_id[MIN_NUM_TMAP_CT_SNK_CODEC_CAP] = TMAP_MANDATORY_CT_SNK_CODEC_CAP_LIST;
#endif /*(APP_NUM_SRC_PAC_RECORDS > 0)*/
  uint8_t ret = BLE_STATUS_SUCCESS;

  tmap_config.Role = Role;
  tmap_config.MaxNumBleLinks = CFG_BLE_NUM_LINK;
  tmap_config.pStartRamAddr = (uint8_t *)&aTMAPMemBuffer;
  tmap_config.RamSize = TMAP_DYN_ALLOC_SIZE;

  status = USECASE_DEV_MGMT_Init();

  if (status == BLE_STATUS_SUCCESS)
  {
    if (tmap_config.Role & TMAP_ROLE_CALL_TERMINAL)
    {
#if (APP_NUM_SNK_PAC_RECORDS > 0u)
      /* Register the mandatory CT Role Sink Codec Capabilities */
      /*Set Codec ID configuration*/
      TMAPAPP_Context.aSnkPACRecord[snk_record_i].Cap.CodecID.CodingFormat = AUDIO_CODING_FORMAT_LC3;
      TMAPAPP_Context.aSnkPACRecord[snk_record_i].Cap.CodecID.CompanyID = COMPANY_ID;
      TMAPAPP_Context.aSnkPACRecord[snk_record_i].Cap.CodecID.VsCodecID = 0x0000;

      /* Set supported codec capabilities configuration */
      TMAPAPP_Context.aSnkCap[snk_record_i][0] = 0x03;
      TMAPAPP_Context.aSnkCap[snk_record_i][1] = CODEC_CAP_SAMPLING_FREQ;
      for (i = 0; i < MIN_NUM_TMAP_CT_SNK_CODEC_CAP ;i++)
      {
        TMAPAPP_Context.aSnkCap[snk_record_i][2] |= (uint8_t) (APP_CodecSpecificCap[a_ct_snk_pac_id[i]].Freq);
        TMAPAPP_Context.aSnkCap[snk_record_i][3] |= (uint8_t) ((APP_CodecSpecificCap[a_ct_snk_pac_id[i]].Freq >> 8 ));
      }

      TMAPAPP_Context.aSnkCap[snk_record_i][4] = 0x02;
      TMAPAPP_Context.aSnkCap[snk_record_i][5] = CODEC_CAP_FRAME_DURATION;

      for (i = 0; i < MIN_NUM_TMAP_CT_SNK_CODEC_CAP ;i++)
      {
        TMAPAPP_Context.aSnkCap[snk_record_i][6] |= APP_CodecSpecificCap[a_ct_snk_pac_id[i]].FrameDuration;
      }

      TMAPAPP_Context.aSnkCap[snk_record_i][7] = 0x05;
      TMAPAPP_Context.aSnkCap[snk_record_i][8] = CODEC_CAP_OCTETS_PER_CODEC_FRAME;
      for (i = 0; i < MIN_NUM_TMAP_CT_SNK_CODEC_CAP ;i++)
      {
        uint32_t min_octet_per_codec_frame = APP_CodecSpecificCap[a_ct_snk_pac_id[i]].MinOctetsPerCodecFrame;
        uint32_t max_octet_per_codec_frame = APP_CodecSpecificCap[a_ct_snk_pac_id[i]].MaxOctetsPerCodecFrame;

        if (i > 0)
        {
          min_octet_per_codec_frame = MIN(min_octet_per_codec_frame,
                                          TMAPAPP_Context.aSnkCap[snk_record_i][9] + (TMAPAPP_Context.aSnkCap[snk_record_i][10] << 8));
          max_octet_per_codec_frame = MAX(max_octet_per_codec_frame,
                                          TMAPAPP_Context.aSnkCap[snk_record_i][11] + (TMAPAPP_Context.aSnkCap[snk_record_i][12] << 8));
        }

        TMAPAPP_Context.aSnkCap[snk_record_i][9] = (uint8_t) (min_octet_per_codec_frame);
        TMAPAPP_Context.aSnkCap[snk_record_i][10] = (uint8_t) (min_octet_per_codec_frame >> 8 );
        TMAPAPP_Context.aSnkCap[snk_record_i][11] = (uint8_t) (max_octet_per_codec_frame);
        TMAPAPP_Context.aSnkCap[snk_record_i][12] = (uint8_t) (max_octet_per_codec_frame >> 8);
      }

      TMAPAPP_Context.aSnkCap[snk_record_i][13] = 0x02;
      TMAPAPP_Context.aSnkCap[snk_record_i][14] = CODEC_CAP_AUDIO_CHNL_COUNTS;
      TMAPAPP_Context.aSnkCap[snk_record_i][15] = (APP_MAX_CHANNEL_PER_SNK_ASE | SUPPORTED_AUDIO_CHNL_COUNT_1);

      TMAPAPP_Context.aSnkPACRecord[snk_record_i].Cap.pSpecificCap = &TMAPAPP_Context.aSnkCap[snk_record_i][0];
      TMAPAPP_Context.aSnkPACRecord[snk_record_i].Cap.SpecificCapLength = 16u;

      /* metadata in Audio Codec Configuration*/
      TMAPAPP_Context.aSnkPACRecord[snk_record_i].Cap.MetadataLength = 0x04;
      TMAPAPP_Context.aSnkMetadata[snk_record_i][0] = METADATA_PREFERRED_AUDIO_CONTEXTS_LENGTH;
      TMAPAPP_Context.aSnkMetadata[snk_record_i][1] = METADATA_PREFERRED_AUDIO_CONTEXTS;
      TMAPAPP_Context.aSnkMetadata[snk_record_i][2] = (uint8_t) (AUDIO_CONTEXT_CONVERSATIONAL);
      TMAPAPP_Context.aSnkMetadata[snk_record_i][3] = (uint8_t) (AUDIO_CONTEXT_CONVERSATIONAL >> 8 );
      TMAPAPP_Context.aSnkPACRecord[snk_record_i].Cap.pMetadata = &TMAPAPP_Context.aSnkMetadata[snk_record_i][0];

      ret = CAP_RegisterSnkPACRecord(&TMAPAPP_Context.aSnkPACRecord[snk_record_i],
                                     &TMAPAPP_Context.aSnkPACRecordHandle[snk_record_i]);
      if (ret == BLE_STATUS_SUCCESS)
      {
        LOG_INFO_APP("Successfully registered Sink PAC Record id %d\n",snk_record_i);
        snk_record_i++;
      }
      else
      {
        LOG_INFO_APP("Failed to register Sink PAC Record id %d\n",snk_record_i);
        return ret;
      }
#endif /* (APP_NUM_SNK_PAC_RECORDS > 0u)*/

#if (APP_NUM_SRC_PAC_RECORDS > 0u)
      /* Register the mandatory CT Role Source Codec Capabilities */
      /*Set Codec ID configuration*/
      TMAPAPP_Context.aSrcPACRecord[src_record_i].Cap.CodecID.CodingFormat = AUDIO_CODING_FORMAT_LC3;
      TMAPAPP_Context.aSrcPACRecord[src_record_i].Cap.CodecID.CompanyID = COMPANY_ID;
      TMAPAPP_Context.aSrcPACRecord[src_record_i].Cap.CodecID.VsCodecID = 0x0000;

      /* Set supported codec capabilities configuration */
      TMAPAPP_Context.aSrcCap[src_record_i][0] = 0x03;
      TMAPAPP_Context.aSrcCap[src_record_i][1] = CODEC_CAP_SAMPLING_FREQ;
      for (i = 0; i < MIN_NUM_TMAP_CT_SRC_CODEC_CAP ;i++)
      {
        TMAPAPP_Context.aSrcCap[src_record_i][2] |= (uint8_t) (APP_CodecSpecificCap[a_ct_src_pac_id[i]].Freq);
        TMAPAPP_Context.aSrcCap[src_record_i][3] |= (uint8_t) ((APP_CodecSpecificCap[a_ct_src_pac_id[i]].Freq >> 8 ));
      }

      TMAPAPP_Context.aSrcCap[src_record_i][4] = 0x02;
      TMAPAPP_Context.aSrcCap[src_record_i][5] = CODEC_CAP_FRAME_DURATION;
      for (i = 0; i < MIN_NUM_TMAP_CT_SRC_CODEC_CAP ;i++)
      {
        TMAPAPP_Context.aSrcCap[src_record_i][6] |= APP_CodecSpecificCap[a_ct_src_pac_id[i]].FrameDuration;
      }

