STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_TMAP_Peripheral/STM32_WPAN/App/tmap_app.c
      TMAPAPP_Context.aSrcCap[src_record_i][7] = 0x05;
      TMAPAPP_Context.aSrcCap[src_record_i][8] = CODEC_CAP_OCTETS_PER_CODEC_FRAME;
      for (i = 0; i < MIN_NUM_TMAP_CT_SRC_CODEC_CAP ;i++)
      {
        uint32_t min_octet_per_codec_frame = APP_CodecSpecificCap[a_ct_src_pac_id[i]].MinOctetsPerCodecFrame;
        uint32_t max_octet_per_codec_frame = APP_CodecSpecificCap[a_ct_src_pac_id[i]].MaxOctetsPerCodecFrame;

        if (i > 0)
        {
          min_octet_per_codec_frame = MIN(min_octet_per_codec_frame,
                                          TMAPAPP_Context.aSrcCap[src_record_i][9] + (TMAPAPP_Context.aSrcCap[src_record_i][10] << 8));
          max_octet_per_codec_frame = MAX(max_octet_per_codec_frame,
                                          TMAPAPP_Context.aSrcCap[src_record_i][11] + (TMAPAPP_Context.aSrcCap[src_record_i][12] << 8));
        }

        TMAPAPP_Context.aSrcCap[src_record_i][9] = (uint8_t) (min_octet_per_codec_frame);
        TMAPAPP_Context.aSrcCap[src_record_i][10] = (uint8_t) (min_octet_per_codec_frame >> 8 );
        TMAPAPP_Context.aSrcCap[src_record_i][11] = (uint8_t) (max_octet_per_codec_frame);
        TMAPAPP_Context.aSrcCap[src_record_i][12] = (uint8_t) (max_octet_per_codec_frame >> 8);
      }

      TMAPAPP_Context.aSrcCap[src_record_i][13] = 0x02;
      TMAPAPP_Context.aSrcCap[src_record_i][14] = CODEC_CAP_AUDIO_CHNL_COUNTS;
      TMAPAPP_Context.aSrcCap[src_record_i][15] = (APP_MAX_CHANNEL_PER_SRC_ASE | SUPPORTED_AUDIO_CHNL_COUNT_1);

      TMAPAPP_Context.aSrcPACRecord[src_record_i].Cap.pSpecificCap = &TMAPAPP_Context.aSrcCap[src_record_i][0];
      TMAPAPP_Context.aSrcPACRecord[src_record_i].Cap.SpecificCapLength = 16u;

      /* metadata in Audio Codec Configuration*/
      TMAPAPP_Context.aSrcPACRecord[src_record_i].Cap.MetadataLength = 0x04;
      TMAPAPP_Context.aSrcMetadata[src_record_i][0] = METADATA_PREFERRED_AUDIO_CONTEXTS_LENGTH;
      TMAPAPP_Context.aSrcMetadata[src_record_i][1] = METADATA_PREFERRED_AUDIO_CONTEXTS;
      TMAPAPP_Context.aSrcMetadata[src_record_i][2] = (uint8_t) (AUDIO_CONTEXT_CONVERSATIONAL);
      TMAPAPP_Context.aSrcMetadata[src_record_i][3] = (uint8_t) (AUDIO_CONTEXT_CONVERSATIONAL >> 8 );
      TMAPAPP_Context.aSrcPACRecord[src_record_i].Cap.pMetadata = &TMAPAPP_Context.aSrcMetadata[src_record_i][0];

      ret = CAP_RegisterSrcPACRecord(&TMAPAPP_Context.aSrcPACRecord[src_record_i],
                                     &TMAPAPP_Context.aSrcPACRecordHandle[src_record_i]);
      if (ret == BLE_STATUS_SUCCESS)
      {
        LOG_INFO_APP("Successfully registered Source PAC Record id %d\n",src_record_i);
        src_record_i++;
      }
      else
      {
        LOG_INFO_APP("Failed to register Source PAC Record id %d\n",src_record_i);
        return ret;
      }
#endif /* (APP_NUM_SRC_PAC_RECORDS > 0u)*/
    }
    if (tmap_config.Role & (TMAP_ROLE_UNICAST_MEDIA_RECEIVER | TMAP_ROLE_BROADCAST_MEDIA_RECEIVER))
    {
#if (APP_NUM_SNK_PAC_RECORDS > 0u)
      /* Register the mandatory CT Role Codec Capabilities */
      /*Set Codec ID configuration*/
      TMAPAPP_Context.aSnkPACRecord[snk_record_i].Cap.CodecID.CodingFormat = AUDIO_CODING_FORMAT_LC3;
      TMAPAPP_Context.aSnkPACRecord[snk_record_i].Cap.CodecID.CompanyID = COMPANY_ID;
      TMAPAPP_Context.aSnkPACRecord[snk_record_i].Cap.CodecID.VsCodecID = 0x0000;

      /* Set supported codec capabilities configuration */
      TMAPAPP_Context.aSnkCap[snk_record_i][0] = 0x03;
      TMAPAPP_Context.aSnkCap[snk_record_i][1] = CODEC_CAP_SAMPLING_FREQ;
      for (i = 0; i < MIN_NUM_TMAP_MR_SNK_CODEC_CAP; i++)
      {
        TMAPAPP_Context.aSnkCap[snk_record_i][2] |= (uint8_t) (APP_CodecSpecificCap[a_mr_snk_pac_id[i]].Freq);
        TMAPAPP_Context.aSnkCap[snk_record_i][3] |= (uint8_t) ((APP_CodecSpecificCap[a_mr_snk_pac_id[i]].Freq >> 8 ));
      }

      TMAPAPP_Context.aSnkCap[snk_record_i][4] = 0x02;
      TMAPAPP_Context.aSnkCap[snk_record_i][5] = CODEC_CAP_FRAME_DURATION;
      for (i = 0; i < MIN_NUM_TMAP_MR_SNK_CODEC_CAP; i++)
      {
        TMAPAPP_Context.aSnkCap[snk_record_i][6] |= APP_CodecSpecificCap[a_mr_snk_pac_id[i]].FrameDuration;
      }

      TMAPAPP_Context.aSnkCap[snk_record_i][7] = 0x05;
      TMAPAPP_Context.aSnkCap[snk_record_i][8] = CODEC_CAP_OCTETS_PER_CODEC_FRAME;
      for (i = 0; i < MIN_NUM_TMAP_MR_SNK_CODEC_CAP; i++)
      {
        uint32_t min_octet_per_codec_frame = APP_CodecSpecificCap[a_mr_snk_pac_id[i]].MinOctetsPerCodecFrame;
        uint32_t max_octet_per_codec_frame = APP_CodecSpecificCap[a_mr_snk_pac_id[i]].MaxOctetsPerCodecFrame;

        if (i > 0)
        {
          min_octet_per_codec_frame = MIN(min_octet_per_codec_frame,
                                          TMAPAPP_Context.aSnkCap[snk_record_i][9] + (TMAPAPP_Context.aSnkCap[snk_record_i][10] << 8));
          max_octet_per_codec_frame = MAX(max_octet_per_codec_frame,
                                          TMAPAPP_Context.aSnkCap[snk_record_i][11] + (TMAPAPP_Context.aSnkCap[snk_record_i][12] << 8));
        }

        TMAPAPP_Context.aSnkCap[snk_record_i][9] = (uint8_t) (min_octet_per_codec_frame);
        TMAPAPP_Context.aSnkCap[snk_record_i][10] = (uint8_t) (min_octet_per_codec_frame >> 8 );
        TMAPAPP_Context.aSnkCap[snk_record_i][11] = (uint8_t) (max_octet_per_codec_frame);
        TMAPAPP_Context.aSnkCap[snk_record_i][12] = (uint8_t) (max_octet_per_codec_frame >> 8);
      }

      TMAPAPP_Context.aSnkCap[snk_record_i][13] = 0x02;
      TMAPAPP_Context.aSnkCap[snk_record_i][14] = CODEC_CAP_AUDIO_CHNL_COUNTS;
      TMAPAPP_Context.aSnkCap[snk_record_i][15] =  (APP_MAX_CHANNEL_PER_SNK_ASE | SUPPORTED_AUDIO_CHNL_COUNT_1);

      TMAPAPP_Context.aSnkPACRecord[snk_record_i].Cap.pSpecificCap = &TMAPAPP_Context.aSnkCap[snk_record_i][0];
      TMAPAPP_Context.aSnkPACRecord[snk_record_i].Cap.SpecificCapLength = 16u;

      /* metadata in Audio Codec Configuration*/
      TMAPAPP_Context.aSnkPACRecord[snk_record_i].Cap.MetadataLength = 0x04;
      TMAPAPP_Context.aSnkMetadata[snk_record_i][0] = METADATA_PREFERRED_AUDIO_CONTEXTS_LENGTH;
      TMAPAPP_Context.aSnkMetadata[snk_record_i][1] = METADATA_PREFERRED_AUDIO_CONTEXTS;
      TMAPAPP_Context.aSnkMetadata[snk_record_i][2] = (uint8_t) (AUDIO_CONTEXT_MEDIA);
      TMAPAPP_Context.aSnkMetadata[snk_record_i][3] = (uint8_t) (AUDIO_CONTEXT_MEDIA >> 8 );
      TMAPAPP_Context.aSnkPACRecord[snk_record_i].Cap.pMetadata = &TMAPAPP_Context.aSnkMetadata[snk_record_i][0];

      ret = CAP_RegisterSnkPACRecord(&TMAPAPP_Context.aSnkPACRecord[snk_record_i],
                                     &TMAPAPP_Context.aSnkPACRecordHandle[snk_record_i]);
      if (ret == BLE_STATUS_SUCCESS)
      {
        LOG_INFO_APP("Successfully registered Sink PAC Record id %d\n",snk_record_i);
        snk_record_i++;
      }
      else
      {
        LOG_INFO_APP("Failed to register Sink PAC Record id %d\n",snk_record_i);
        return ret;
      }
#endif /* (APP_NUM_SNK_PAC_RECORDS > 0u)*/
    }
  }
  return TMAP_Init(&tmap_config);
}

/**
  * @brief  Notify CAP Events for App
  * @param  pNotification: pointer on notification information
 */
static void TMAPAPP_CAPNotification(CAP_Notification_Evt_t *pNotification)
{
  LOG_INFO_APP("CAP Event : 0x%02X\n",pNotification->EvtOpcode);

  switch(pNotification->EvtOpcode)
  {
    case CAP_LINKUP_COMPLETE_EVT:
    {
      GAF_Profiles_Link_t current_link = CAP_GetCurrentLinkedGAFProfiles(pNotification->ConnHandle);
      APP_ACL_Conn_t *p_conn;
      LOG_INFO_APP("CAP Linkup Complete on Connhandle 0x%04X with status 0x%02X\n",
                   pNotification->ConnHandle,
                   pNotification->Status);

