STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_TMAP_Peripheral/STM32_WPAN/App/tmap_app.c
    case CAP_UNICAST_SERVER_ENABLE_REQ_EVT:
    {
      BAP_ASE_Enable_Req_Params_t *p_info = (BAP_ASE_Enable_Req_Params_t *)pNotification->pInfo;
      tBleStatus ret;
      APP_ASE_Info_t *p_ase = 0;
      APP_ACL_Conn_t *p_conn = 0;
      APP_ACL_Conn_t *p_other_conn = 0;
      Audio_Context_t audio_context = 0x0000;
      Audio_Context_t snk_context = TMAPAPP_Context.AvailableSnkAudioContext;
      Audio_Context_t src_context = TMAPAPP_Context.AvailableSrcAudioContext;

      LOG_INFO_APP("Enable Operation Request for ASE ID %d in state %d is received from remote CAP Initiator on ConnHandle 0x%04X\n",
                  p_info->ASE_ID,
                  p_info->State,
                  pNotification->ConnHandle);
      p_conn = APP_GetACLConn(pNotification->ConnHandle);
      if (p_conn != 0)
      {
        uint8_t status = LTV_GetStreamingAudioContexts((uint8_t *)p_info->pMetadata,
                                                       p_info->MetadataLength,
                                                       &audio_context);
        if(status == 1u)
        {
          LOG_INFO_APP("ASE ID 0x%02X on ConnHandle 0x%04X would be associated to a Streaming Audio Contexts 0x%04X\n",
                       p_info->ASE_ID,
                       pNotification->ConnHandle,
                       audio_context);
          /* Set audio contexts to removed from availability according to the streaming audio contexts associated to the
           * ASE.
           */
          if (p_info->Type == ASE_SINK)
          {
            /* Remove the contexts which are not available according to Streaming Audio contexts of the ASE */
            snk_context = APP_UnavailableAudioContexts(ASE_SINK,snk_context,audio_context);
          }
          else /*(p_info->Type & ASE_SOURCE)*/
          {
            /* Remove the contexts which are not available according to Streaming Audio contexts of the ASE */
            src_context = APP_UnavailableAudioContexts(ASE_SOURCE,src_context,audio_context);
          }

          LOG_INFO_APP("Previous Available Contexts are : Snk 0x%04X  - Src  0x%04X\n",
                       TMAPAPP_Context.AvailableSnkAudioContext,
                       TMAPAPP_Context.AvailableSrcAudioContext);
          LOG_INFO_APP("Calculated New Available Contexts are : Snk 0x%04X  - Src  0x%04X\n",
                       snk_context,
                       src_context);

          /*Set new available audio contexts for BAP Announcement*/
          status = CAP_SetAvailableAudioContexts(snk_context,src_context);
          if (status == BLE_STATUS_SUCCESS)
          {
            if (p_info->Type == ASE_SINK)
            {
              TMAPAPP_Context.AvailableSnkAudioContext = snk_context;
            }
            else
            {
              TMAPAPP_Context.AvailableSrcAudioContext = src_context;
            }
            LOG_INFO_APP("Set Available Snk Audio Contexts 0x%04X and Available Src Audio Contexts 0x%04X\n",
                         TMAPAPP_Context.AvailableSnkAudioContext,
                         TMAPAPP_Context.AvailableSrcAudioContext);
          }
          else
          {
            LOG_INFO_APP("FAILURE to Set Available Snk Audio Contexts 0x%04X and Available Src Audio Contexts 0x%04X\n",
                         snk_context,
                         src_context);
          }
          if (TMAPAPP_Context.NumConn < CFG_BLE_NUM_LINK )
          {
            uint8_t enable_solicitation_request = 0;
            if (TMAPAPP_Context.BroadcastMode == APP_BROADCAST_MODE_SCAN_DELEGATOR)
            {
              enable_solicitation_request = 1;
            }
            TMAPAPP_StopAdvertising();
            /* Start Advertising */
            if (TMAPAPP_Context.CSIPRank > 0)
            {
              status = TMAPAPP_StartAdvertising(CAP_GENERAL_ANNOUNCEMENT, enable_solicitation_request, GAP_APPEARANCE_EARBUD);
            }
            else
            {
              status = TMAPAPP_StartAdvertising(CAP_GENERAL_ANNOUNCEMENT, enable_solicitation_request, GAP_APPEARANCE_HEADPHONES);
            }
            LOG_INFO_APP("TMAPAPP_StartAdvertising() returns status 0x%02X\n",status);
          }

        }
        else
        {
          /*No Streaming Audio Context*/
        }

        if (TMAPAPP_Context.NumConn == 1u )
        {
          /* If only one CAP Initiator is connected, we can accept directly the Enable Operation Request*/
          p_ase = APP_GetASE(p_info->ASE_ID,pNotification->ConnHandle);
          if (p_ase != 0)
          {
            ret = CAP_Unicast_EnableOpRsp(pNotification->ConnHandle,
                                      p_info->ASE_ID,
                                      ASE_OP_RESP_SUCCESS,
                                      ASE_OP_RESP_NO_REASON);
            LOG_INFO_APP("Enable Operation Response returns status 0x%02X for ASE ID %d on ConnHandle 0x%04X\n",
                        ret,
                        p_info->ASE_ID,
                        pNotification->ConnHandle);
          }
        }
        else
        {
          uint8_t delay_resp = 0u;

          if ((p_conn->AvailableSnkAudioContext != SUPPORTED_SNK_CONTEXTS) \
              || (p_conn->AvailableSrcAudioContext != SUPPORTED_SRC_CONTEXTS))
          {
            /*update the available Audio Contexts of the CAP Initiator requesting the enable operation*/
            ret = CAP_UpdateAvailableAudioContexts(pNotification->ConnHandle,
                                                   SUPPORTED_SNK_CONTEXTS,
                                                   SUPPORTED_SRC_CONTEXTS);
            LOG_INFO_APP("Send Update Available Snk Audio Contexts 0x%04X and Available Src Audio Contexts 0x%04X with CAP Initiator on ConnHandle 0x%04X returns status 0x%02X\n",
                         SUPPORTED_SNK_CONTEXTS,
                         SUPPORTED_SRC_CONTEXTS,
                         pNotification->ConnHandle,
                         ret);
            p_conn->AvailableSnkAudioContext = SUPPORTED_SNK_CONTEXTS;
            p_conn->AvailableSrcAudioContext = SUPPORTED_SRC_CONTEXTS;
            UNUSED(status);
          }
          else
          {
            LOG_INFO_APP("Available Snk Audio Contexts 0x%04X and Available Src Audio Contexts 0x%04X with CAP Initiator on ConnHandle 0x%04X haven't changed\n",
                         SUPPORTED_SNK_CONTEXTS,
                         SUPPORTED_SRC_CONTEXTS,
                         p_conn->Acl_Conn_Handle);
          }

          /*check if streaming is ongoing on another connection. If yes, the CAP Acceptor terminates the Audio Stream*/
          for (uint8_t conn = 0u; conn < CFG_BLE_NUM_LINK ; conn++)
          {
            uint8_t streaming_ongoing = 0u;
            if ((TMAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle != 0xFFFFu) \
                && (&TMAPAPP_Context.ACL_Conn[conn] != p_conn))
            {
              p_other_conn = &TMAPAPP_Context.ACL_Conn[conn];
#if (APP_NUM_SNK_ASE > 0u)
              for ( uint8_t i = 0; i < TMAPAPP_Context.NumSnkASEs;i++)
              {
                if (p_other_conn->pASEs->aSnkASE[i].allocated == 1)
                {
                  if ((p_other_conn->pASEs->aSnkASE[i].state == ASE_STATE_ENABLING) \
                    || (p_other_conn->pASEs->aSnkASE[i].state == ASE_STATE_STREAMING))
                  {
                    streaming_ongoing = 1u;
                  }
                }
              }
#endif /* (APP_NUM_SNK_ASE > 0u) */
#if (APP_NUM_SRC_ASE > 0u)
              for ( uint8_t i = 0; i < TMAPAPP_Context.NumSrcASEs;i++)
              {
                if (p_other_conn->pASEs->aSrcASE[i].allocated == 1)
                {
                  if ((p_other_conn->pASEs->aSrcASE[i].state == ASE_STATE_ENABLING) \
                    || (p_other_conn->pASEs->aSrcASE[i].state == ASE_STATE_STREAMING))
                  {
                    streaming_ongoing = 1u;
                  }
                }
              }
#endif /* (APP_NUM_SRC_ASE > 0u) */

