STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_TMAP_Peripheral/STM32_WPAN/App/tmap_app.c
              if ((p_other_conn->AvailableSnkAudioContext != TMAPAPP_Context.AvailableSnkAudioContext) \
                  || (p_other_conn->AvailableSrcAudioContext != TMAPAPP_Context.AvailableSrcAudioContext))
              {
                /*we update the Audio Contexts availability to other connected CAP Initiator*/
                ret = CAP_UpdateAvailableAudioContexts(p_other_conn->Acl_Conn_Handle,
                                                       TMAPAPP_Context.AvailableSnkAudioContext,
                                                       TMAPAPP_Context.AvailableSrcAudioContext);
                LOG_INFO_APP("Send Update Available Snk Audio Contexts 0x%04X and Available Src Audio Contexts 0x%04X with CAP Initiator on ConnHandle 0x%04X returns status 0x%02X\n",
                             TMAPAPP_Context.AvailableSnkAudioContext,
                             TMAPAPP_Context.AvailableSrcAudioContext,
                             p_other_conn->Acl_Conn_Handle,
                             ret);
                p_other_conn->AvailableSnkAudioContext = TMAPAPP_Context.AvailableSnkAudioContext;
                p_other_conn->AvailableSrcAudioContext = TMAPAPP_Context.AvailableSrcAudioContext;
                UNUSED(status);
              }
              else
              {
                LOG_INFO_APP("Available Snk Audio Contexts 0x%04X and Available Src Audio Contexts 0x%04X with CAP Initiator on ConnHandle 0x%04X haven't changed\n",
                             TMAPAPP_Context.AvailableSnkAudioContext,
                             TMAPAPP_Context.AvailableSrcAudioContext,
                             p_other_conn->Acl_Conn_Handle);
              }
              if ( streaming_ongoing == 1u)
              {
                delay_resp = 1u;
                p_ase = APP_GetASE(p_info->ASE_ID,pNotification->ConnHandle);
                if (p_ase != 0)
                {
                  p_ase->enable_req = 1u;
                  LOG_INFO_APP("Delay Enable Operation Response for ASE ID %d on ConnHandle 0x%04X\n",
                              p_info->ASE_ID,
                              pNotification->ConnHandle);
                }
                LOG_INFO_APP("Terminate Audio Stream with CAP Initiator on ConnHandle 0x%04X shall be terminated before send a response to the Enable Request\n");
                /*Terminate the streaming with this device*/
                ret = CAP_Unicast_TerminateAudioStream(p_other_conn->Acl_Conn_Handle);
                LOG_INFO_APP("Terminate Audio Stream with CAP Initiator on ConnHandle 0x%04X returns status 0x%02X\n",
                             p_other_conn->Acl_Conn_Handle,
                             ret);

              }
              UNUSED(ret);
            }
          }
          /* Check if Audio Stream termination is in progress or not to send a response to an Enable Operation */
          if (delay_resp == 0u)
          {
            p_ase = APP_GetASE(p_info->ASE_ID,pNotification->ConnHandle);
            if (p_ase != 0)
            {
              ret = CAP_Unicast_EnableOpRsp(pNotification->ConnHandle,
                                            p_info->ASE_ID,
                                            ASE_OP_RESP_SUCCESS,
                                            ASE_OP_RESP_NO_REASON);
              LOG_INFO_APP("Enable Operation Response returns status 0x%02X for ASE ID %d on ConnHandle 0x%04X\n",
                          ret,
                          p_info->ASE_ID,
                          pNotification->ConnHandle);
            }
          }
        }
      }
      UNUSED(ret);
      break;
    }

    case CAP_UNICAST_PREFERRED_QOS_REQ_EVT:
    {
        BAP_PrefQoSConfReq_t *info = (BAP_PrefQoSConfReq_t *)pNotification->pInfo;
        Sampling_Freq_t frequency;
        Frame_Duration_t frame_duration;
        uint8_t blocksPerSDU;
        uint16_t sduInterval;
        uint16_t octetsPerFrame;
        uint8_t i;
        uint8_t offset = 0;
        uint32_t controller_delay_min;
        uint8_t num_snk_ases = TMAPAPP_Context.NumSnkASEs;
        uint8_t num_src_ases = TMAPAPP_Context.NumSrcASEs;

        LOG_INFO_APP("Preferred Server QoS Settings is requested for ASE ID %d (Type 0x%02X)\n",info->ASE_ID,info->Type);
        LOG_INFO_APP("  Target Latency : %d\n", info->TargetLatency);
        LOG_INFO_APP("  Target Phy %d to achieve the Target Latency\n",info->TargetPhy);
        LOG_INFO_APP("  Codec ID\n");
        LOG_INFO_APP("    Coding format : 0x%02X\n",info->CodecConf.CodecID.CodingFormat);
        LOG_INFO_APP("    Company id : 0x%04X\n",info->CodecConf.CodecID.CompanyID);
        LOG_INFO_APP("    VS codec id : 0x%04X\n",info->CodecConf.CodecID.VsCodecID);
        frequency = LTV_GetConfiguredSamplingFrequency(info->CodecConf.pSpecificConf,info->CodecConf.SpecificConfLength);
        LOG_INFO_APP("    Frequency : %d\n", frequency);
        frame_duration = LTV_GetConfiguredFrameDuration(info->CodecConf.pSpecificConf,info->CodecConf.SpecificConfLength);
        LOG_INFO_APP("    Frame Duration : %d\n", frame_duration);
        octetsPerFrame = LTV_GetConfiguredOctetsPerCodecFrame(info->CodecConf.pSpecificConf,info->CodecConf.SpecificConfLength);
        LOG_INFO_APP("    Octets Per Codec Frame : %d\n", octetsPerFrame);
        blocksPerSDU = LTV_GetConfiguredFramesBlockPerSdu(info->CodecConf.pSpecificConf,info->CodecConf.SpecificConfLength);
        if (blocksPerSDU == 0)
        {
          blocksPerSDU = 1; /* default value */
        }
        LOG_INFO_APP("    Codec Frame Blocks Per SDU : %d\n",blocksPerSDU);
        if (frame_duration == FRAME_DURATION_7_5_MS)
        {
          if (frequency == SAMPLE_FREQ_44100_HZ)
          {
            sduInterval = 8163*blocksPerSDU;
          }
          else
          {
            sduInterval = 7500*blocksPerSDU;
          }
        }
        else if (frame_duration == FRAME_DURATION_10_MS)
        {
          if (frequency == SAMPLE_FREQ_44100_HZ)
          {
            sduInterval = 10884*blocksPerSDU;
          }
          else
          {
            sduInterval = 10000*blocksPerSDU;
          }
        }
        else
        {
          LOG_INFO_APP("Unsupported frame duration\n",frame_duration);
          *(info->pResp) = ASE_OP_RESP_UNSUPPORTED_CONF_PARAM;
          *(info->pReason) = ASE_OP_RESP_REASON_CODEC_SPEC_CONF;
          return;
        }
        LOG_INFO_APP("  Min Controller Delay in Source role %d us\n",info->SrcControllerDelayMin);
        LOG_INFO_APP("  Max Controller Delay in Source role %d us\n",info->SrcControllerDelayMax);
        LOG_INFO_APP("  Min Controller Delay in Sink role %d us\n",info->SnkControllerDelayMin);
        LOG_INFO_APP("  Max Controller Delay in Sink role %d us\n",info->SnkControllerDelayMax);

        LOG_INFO_APP("Calculated SDU Interval : %d us\n",sduInterval);

        *(info->pResp) = ASE_OP_RESP_SUCCESS;
        *(info->pReason) = ASE_OP_RESP_NO_REASON;
        info->pPrefQoSConfRsp->Framing = APP_DEFAULT_BAP_FRAMING;
        info->pPrefQoSConfRsp->PrefPHY = APP_DEFAULT_BAP_PREF_PHY;
        info->pPrefQoSConfRsp->PrefRetransmissionNumber = APP_DEFAULT_BAP_PREF_RETRANSMISSIONS;
        info->pPrefQoSConfRsp->MaxTransportLatency = APP_DEFAULT_BAP_MAX_TRANSPORT_LATENCY;
#if (ENABLE_AUDIO_HIGH_RELIABILITY == 1u)
        if(info->TargetLatency > TARGET_LATENCY_BALANCED_RELIABILITY)
        {
          offset = 16;
        }
#endif /* (ENABLE_AUDIO_HIGH_RELIABILITY == 1u) */
        for(i = 0;i<15;i++)
        {
          if((frequency == APP_QoSConf[i+offset].freq) \
              && (sduInterval == APP_QoSConf[i+offset].sdu_interval) \
              && (octetsPerFrame == APP_QoSConf[i+offset].max_sdu))
          {
            info->pPrefQoSConfRsp->PrefRetransmissionNumber = APP_QoSConf[i+offset].rtx_num;
            info->pPrefQoSConfRsp->MaxTransportLatency = APP_QoSConf[i+offset].max_tp_latency;
          }
        }
        /*maximum simulateous Sink ASEs in streaming is 2 sink ASEs*/
        if (num_snk_ases > 2u)
        {
          num_snk_ases = 2u;
        }
        /*maximum simulateous Source ASEs in streaming is 2 source ASEs*/
        if (num_src_ases > 2u)
        {
          num_src_ases = 2u;
        }

        /* Adjust the minimum controller delay according to the fact that other ASEs could be in streaming in the
         * same time that the specified ASE
         */
        controller_delay_min = (num_snk_ases * info->SnkControllerDelayMin) + (num_src_ases * info->SrcControllerDelayMin);

