STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_TMAP_Peripheral/STM32_WPAN/App/tmap_app.c
    case CAP_MCP_INST_DEACTIVATED_EVT:
    {
      uint8_t *ccid = (uint8_t *)pNotification->pInfo;
      LOG_INFO_APP("Media Player Instance with CCID %d is no more associated to Audio Stream with remote TMAP Device (connection handle 0x%04X)\n",
                  *ccid,
                  pNotification->ConnHandle);
      UNUSED(ccid);
    }
    break;

    case CAP_CCP_LINKUP_EVT:
    {
      APP_ACL_Conn_t *p_conn;
      LOG_INFO_APP("Call Control Profile is linked on ConnHandle 0x%04X\n",pNotification->ConnHandle);
      p_conn = APP_GetACLConn(pNotification->ConnHandle);
      if ((p_conn != 0) && (pNotification->Status == BLE_STATUS_SUCCESS))
      {
        p_conn->AudioProfile |= AUDIO_PROFILE_CCP;
        Menu_SetProfilesLinked(p_conn->AudioProfile);
      }
    }
    break;

    case CAP_CCP_INST_ACTIVATED_EVT:
    {
      CAP_CCP_InstInfo_Evt_t *info = (CAP_CCP_InstInfo_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("Telephone Bearer Instance with CCID %d is active to control Audio Stream with remote TMAP Device (connHandle 0x%04X)\n",
                  info->ContentControlID,
                  pNotification->ConnHandle);
      if (info->FeaturesMask & CCP_FEATURE_BEARER_SIGNAL_STRENGTH)
      {
        LOG_INFO_APP("Bearer Signal Strength ( and associated Signal Strength Reporting Interval) is supported on remote TMAP Device\n");
      }
      if (info->FeaturesMask & CCP_FEATURE_INC_CALL_TARGET_BEARER_URI)
      {
        LOG_INFO_APP("Incoming Call Target Bearer URI is supported on remote TMAP Device\n");
      }
      if (info->FeaturesMask & CCP_FEATURE_CALL_FRIENDLY_NAME)
      {
        LOG_INFO_APP("Call friendly Name is supported on remote TMAP Device\n");
      }
    }
    break;

    case CAP_CCP_INST_DEACTIVATED_EVT:
    {
      uint8_t *ccid = (uint8_t *)pNotification->pInfo;
      LOG_INFO_APP("Telephone Bearer Instance with CCID %d is no more associated to Audio Stream with remote TMAP Device (connection handle 0x%04X)\n",
                  *ccid,
                  pNotification->ConnHandle);
      UNUSED(ccid);
    }
    break;

#if ((APP_TMAP_ROLE & TMAP_ROLE_BROADCAST_MEDIA_RECEIVER) == TMAP_ROLE_BROADCAST_MEDIA_RECEIVER)
    case CAP_BROADCAST_AUDIO_UP_EVT:
    {
      Sampling_Freq_t sampling_freq;
      char freq_text[8] = {0};
      LOG_INFO_APP(">>== CAP_BROADCAST_AUDIO_UP_EVT\n");

      sampling_freq = LTV_GetConfiguredSamplingFrequency(
          &TMAPAPP_Context.BSNK.base_group.pSubgroups[0].pCodecSpecificConf[0],
          TMAPAPP_Context.BSNK.base_group.pSubgroups[0].CodecSpecificConfLength);

      switch (sampling_freq)
      {
        case SAMPLE_FREQ_8000_HZ:
        {
          strncpy(&freq_text[0], "8KHz",5u);
          break;
        }
        case SAMPLE_FREQ_16000_HZ:
        {
          strncpy(&freq_text[0], "16KHz",6u);
          break;
        }
        case SAMPLE_FREQ_24000_HZ:
        {
          strncpy(&freq_text[0], "24KHz",6u);
          break;
        }
        case SAMPLE_FREQ_32000_HZ:
        {
          strncpy(&freq_text[0], "32KHz",6u);
          break;
        }
        case SAMPLE_FREQ_44100_HZ:
        {
          strncpy(&freq_text[0], "44.1KHz",8u);
          break;
        }
        case SAMPLE_FREQ_48000_HZ:
        {
          strncpy(&freq_text[0], "48KHz",6u);
          break;
        }
        default:
        {
          strncpy(&freq_text[0], "Unknown",8u);
          break;
        }
      }

      if (TMAPAPP_Context.BroadcastMode == APP_BROADCAST_MODE_SINK_ONLY)
      {
        Menu_SetBroadcastSyncedPage(freq_text);
      }
      else
      {
        Menu_SetScanDelegSyncedPage(freq_text);
      }
    }
    break;

    case CAP_BROADCAST_AUDIO_DOWN_EVT:
    {
      LOG_INFO_APP(">>== CAP_BROADCAST_AUDIO_DOWN_EVT\n");
      Stop_TxAudio();
      MX_AudioDeInit();

      if (TMAPAPP_Context.BroadcastMode == APP_BROADCAST_MODE_SINK_ONLY)
      {
        Menu_SetBroadcastScanPage();
        TMAPAPP_StopSink();
        TMAPAPP_StartSink();
      }
      else
      {
        Menu_SetNoStreamPage();
      }
    }
    break;

    case CAP_BROADCAST_SOURCE_ADV_REPORT_EVT:
    {
      BAP_Broadcast_Source_Adv_Report_Data_t *data = (BAP_Broadcast_Source_Adv_Report_Data_t*) pNotification->pInfo;
      LOG_INFO_APP(">>== CAP_BROADCAST_SOURCE_ADV_REPORT_EVT\n");
      LOG_INFO_APP("     - Broadcasting Device with address %02X:%02X:%02X:%02X:%02X:%02X\n",
                  data->pAdvAddress[5],
                  data->pAdvAddress[4],
                  data->pAdvAddress[3],
                  data->pAdvAddress[2],
                  data->pAdvAddress[1],
                  data->pAdvAddress[0]);
      if(TMAPAPP_Context.BSNK.PASyncState == APP_PA_SYNC_STATE_IDLE
         && TMAPAPP_Context.BSNK.BIGSyncState == APP_BIG_SYNC_STATE_IDLE)
      {
        uint8_t parse_index = 0;
        char name[30] = "Unknown";
        char bid[12] = "ID:0x\0";
        const uint8_t* name_ptr = 0;
        uint8_t name_len = 0;

        while (parse_index + 3 < data->AdvertisingDataLength)
        {
          /* First priority to the Broadcast Name */
          if (data->pAdvertisingData[parse_index + 1] == 0x30)
          {
            name_ptr = &data->pAdvertisingData[parse_index + 2];
            name_len = MIN(data->pAdvertisingData[parse_index] - 1, 29);
            break;
          }
          /* Second priority to the Complete Local Name */
          else if (data->pAdvertisingData[parse_index + 1] == AD_TYPE_COMPLETE_LOCAL_NAME)
          {
            name_ptr = &data->pAdvertisingData[parse_index + 2];
            name_len = MIN(data->pAdvertisingData[parse_index] - 1, 29);
          }
          /* Third priority to the Broadcast ID */
          else if (data->pAdvertisingData[parse_index + 1] == AD_TYPE_SERVICE_DATA &&
              data->pAdvertisingData[parse_index + 2] == 0x52 &&
              data->pAdvertisingData[parse_index + 3] == 0x18)
          {
            sprintf(&bid[5],"%X", data->pAdvertisingData[parse_index + 6]);
            sprintf(&bid[7],"%X", data->pAdvertisingData[parse_index + 5]);
            sprintf(&bid[9],"%X",data->pAdvertisingData[parse_index + 4]);
          }
          parse_index += data->pAdvertisingData[parse_index] + 1;
        }
        if (name_ptr != 0)
        {
          UTIL_MEM_cpy_8(&name[0], name_ptr, name_len);
          name[name_len] = '\0';
        }
        else if (bid[5] != '\0')
        {
          UTIL_MEM_cpy_8(&name[0], bid, 11);
          name[11] = '\0';
        }
#if (CFG_TEST_VALIDATION == 1u)
        if (memcmp(&name[0], "TMAP_WBA", 8u) != 0)
        {
          return;
        }
#endif /*(CFG_TEST_VALIDATION == 1u)*/
        Menu_AddBroadcastSource(data->AdvSID, (uint8_t *) &data->pAdvAddress[0],
                                data->AdvAddressType, &name[0]);
      }
    }
    break;

    case CAP_BROADCAST_PA_SYNC_ESTABLISHED_EVT:
    {
      uint8_t ret;
      LOG_INFO_APP(">>== CAP_BROADCAST_PA_SYNC_ESTABLISHED_EVT\n");
      BAP_PA_Sync_Established_Data_t *data = (BAP_PA_Sync_Established_Data_t*) pNotification->pInfo;
      LOG_INFO_APP("     - Status : 0x%02x\n",pNotification->Status);
      LOG_INFO_APP("     - SyncHandle : 0x%02x\n",data->SyncHandle);
      TMAPAPP_Context.BSNK.PASyncHandle = data->SyncHandle;
      TMAPAPP_Context.BSNK.PASyncState = APP_PA_SYNC_STATE_SYNCHRONIZED;

