STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_TMAP_Peripheral/STM32_WPAN/App/tmap_app.c
      ret = CAP_Broadcast_StopAdvReportParsing();
      if (ret != BLE_STATUS_SUCCESS)
      {
        LOG_INFO_APP("  Fail   : CAP_Broadcast_StopAdvReportParsing() function, result: 0x%02X\n", ret);
      }
      else
      {
        LOG_INFO_APP("  Success: CAP_Broadcast_StopAdvReportParsing() function\n");
      }
      ret = aci_gap_terminate_gap_proc(GAP_OBSERVATION_PROC);
      if (ret != BLE_STATUS_SUCCESS)
      {
        LOG_INFO_APP("  Fail   : aci_gap_terminate_gap_proc() function, result: 0x%02X\n", ret);
      }
      else
      {
        TMAPAPP_Context.BSNK.ScanState = APP_SCAN_STATE_IDLE;
        LOG_INFO_APP("  Success: aci_gap_terminate_gap_proc() function\n");
      }
    }
    break;

    case CAP_BROADCAST_PA_SYNC_LOST_EVT:
      LOG_INFO_APP(">>== CAP_BROADCAST_PA_SYNC_LOST_EVT\n");
      TMAPAPP_Context.BSNK.PASyncState = APP_PA_SYNC_STATE_IDLE;
    break;

    case CAP_BROADCAST_BASE_REPORT_EVT:
    {
      BAP_BASE_Report_Data_t *base_data;
      uint8_t status;
      uint8_t index = 0;
      uint8_t i;
      uint8_t j;
      uint8_t k;
      uint8_t l;
      uint8_t is_different;
      uint8_t payload_len = 0;
      LOG_INFO_APP(">>== CAP_BROADCAST_BASE_REPORT_EVT\n");

      base_data = (BAP_BASE_Report_Data_t*) pNotification->pInfo;
      if (TMAPAPP_Context.BSNK.PASyncState == APP_PA_SYNC_STATE_SYNCHRONIZED)
      {
        TMAPAPP_Context.BSNK.PASyncState = APP_PA_SYNC_STATE_BASE_RECEIVED;
        /* First BASE report after PA sync, force the parsing */
        is_different = 0x01u;
      }
      else
      {
        is_different = CAP_Broadcast_IsBASEGroupDifferent(base_data->pBasePayload,
                                              base_data->BasePayloadLength,
                                              &(TMAPAPP_Context.BSNK.base_group),
                                              &(index));
      }
      if (is_different == 0x00u)
      {
        payload_len += index;
        for (i = 0; i < TMAPAPP_Context.BSNK.base_group.NumSubgroups && is_different == 0x00u; i++)
        {
          is_different = CAP_Broadcast_IsBASESubgroupDifferent(base_data->pBasePayload + payload_len,
                                                    base_data->BasePayloadLength - payload_len,
                                                    &(TMAPAPP_Context.BSNK.base_subgroups[i]),
                                                    &(index));
          payload_len += index;
          for (j = 0; (j < TMAPAPP_Context.BSNK.base_subgroups[i].NumBISes && is_different == 0x00u); j++)
          {
            is_different = CAP_Broadcast_IsBASEBISDifferent(base_data->pBasePayload + payload_len,
                                                          base_data->BasePayloadLength - payload_len,
                                                          &(TMAPAPP_Context.BSNK.base_bis[j]),
                                                          &(index));
            payload_len += index;
          }
        }
      }
      if (is_different == 0x00u)
      {
        /* BASE report is not different from the one in TMAPAPP_Context.BSNK */
        /* No need to parse, copy, or log it again*/
        break;
      }
      status = CAP_Broadcast_ParseBASEGroup(base_data->pBasePayload,
                                            base_data->BasePayloadLength,
                                            &(TMAPAPP_Context.BSNK.base_group),
                                            &(index));

      if (status == BLE_STATUS_SUCCESS)
      {
        LOG_INFO_APP("==>> Start BAP BSNK Parse BASE Group INFO\n");
        LOG_INFO_APP("   Payload Len role : 0x%02x\n",base_data->BasePayloadLength);
        LOG_INFO_APP("   Presentation_delay: 0x%08x\n",TMAPAPP_Context.BSNK.base_group.PresentationDelay);
        LOG_INFO_APP("   Num_subgroups : 0x%02x\n",TMAPAPP_Context.BSNK.base_group.NumSubgroups);
        base_data->pBasePayload += index;
        base_data->BasePayloadLength -= index;

        if(TMAPAPP_Context.BSNK.BIGSyncState == APP_BIG_SYNC_STATE_IDLE)
        {
          TMAPAPP_Context.BSNK.num_sync_bis = 0;
        }

        /* Parse Subgroups */
        for (i = 0; i < TMAPAPP_Context.BSNK.base_group.NumSubgroups && status == BLE_STATUS_SUCCESS; i++)
        {
          status = CAP_Broadcast_ParseBASESubgroup(base_data->pBasePayload,
                                                    base_data->BasePayloadLength,
                                                    &(TMAPAPP_Context.BSNK.base_subgroups[i]),
                                                    &(index));
          base_data->pBasePayload += index;
          base_data->BasePayloadLength -= index;

          LOG_INFO_APP("    BAP_BSNK_ParseBASESubgroup INFO Number :%d\n", i);
          LOG_INFO_APP("    Codec ID : 0x%08x\n",TMAPAPP_Context.BSNK.base_subgroups[i].CodecID);
          LOG_INFO_APP("    Codec specific config length : %d bytes\n",
                      TMAPAPP_Context.BSNK.base_subgroups[i].CodecSpecificConfLength);
          if (TMAPAPP_Context.BSNK.base_subgroups[i].CodecSpecificConfLength > 0u)
          {
            for (k = 0;k<TMAPAPP_Context.BSNK.base_subgroups[i].CodecSpecificConfLength;k++)
            {
              if (TMAPAPP_Context.BSNK.base_subgroups[i].pCodecSpecificConf[k] > 0u)
              {
                LOG_INFO_APP("      Length: 0x%02x\n",TMAPAPP_Context.BSNK.base_subgroups[i].pCodecSpecificConf[k]);
                LOG_INFO_APP("        Type: 0x%02x\n",TMAPAPP_Context.BSNK.base_subgroups[i].pCodecSpecificConf[k+1u]);
                LOG_INFO_APP("        Value: 0x");
                for (l = 0 ;l<(TMAPAPP_Context.BSNK.base_subgroups[i].pCodecSpecificConf[k]-1);l++)
                {
                  LOG_INFO_APP("%02x",TMAPAPP_Context.BSNK.base_subgroups[i].pCodecSpecificConf[k+2u+l]);
                }
                LOG_INFO_APP("\n");
              }
              k+=TMAPAPP_Context.BSNK.base_subgroups[i].pCodecSpecificConf[k];
            }
          }
          LOG_INFO_APP("    Metadata length : %d bytes\n",TMAPAPP_Context.BSNK.base_subgroups[i].MetadataLength);
          if (TMAPAPP_Context.BSNK.base_subgroups[i].MetadataLength > 0)
          {
            for (k = 0;k<TMAPAPP_Context.BSNK.base_subgroups[i].MetadataLength;k++)
            {
              if (TMAPAPP_Context.BSNK.base_subgroups[i].pMetadata[k] > 0u)
              {
                LOG_INFO_APP("      Length: 0x%02x\n",TMAPAPP_Context.BSNK.base_subgroups[i].pMetadata[k]);
                LOG_INFO_APP("        Type: 0x%02x\n",TMAPAPP_Context.BSNK.base_subgroups[i].pMetadata[k+1u]);
                LOG_INFO_APP("        Value: 0x");
                for (l = 0 ;l<(TMAPAPP_Context.BSNK.base_subgroups[i].pMetadata[k]-1);l++)
                {
                  LOG_INFO_APP("%02x",TMAPAPP_Context.BSNK.base_subgroups[i].pMetadata[k+2u+l]);
                }
                LOG_INFO_APP("\n");
              }
              k+=TMAPAPP_Context.BSNK.base_subgroups[i].pMetadata[k];
            }
          }
          LOG_INFO_APP("    Num_BIS : %d\n",TMAPAPP_Context.BSNK.base_subgroups[i].NumBISes);

          /* Parse BIS */
          for (j = 0; (j < TMAPAPP_Context.BSNK.base_subgroups[i].NumBISes) && (status == BLE_STATUS_SUCCESS); j++)
          {
            status = CAP_Broadcast_ParseBASEBIS(base_data->pBasePayload,
                                                base_data->BasePayloadLength,
                                                &(TMAPAPP_Context.BSNK.base_bis[j]),
                                                &(index));
            base_data->pBasePayload += index;
            base_data->BasePayloadLength -= index;

            LOG_INFO_APP("      BIS INDEX : 0x%02x\n",TMAPAPP_Context.BSNK.base_bis[j].BIS_Index);
            LOG_INFO_APP("      Codec specific config length : %d bytes\n",TMAPAPP_Context.BSNK.base_bis[j].CodecSpecificConfLength);
            Audio_Chnl_Allocation_t channel_alloc = 0x00000000;
            if (TMAPAPP_Context.BSNK.base_bis[j].CodecSpecificConfLength > 0u)
            {
              for (int k = 0;k<TMAPAPP_Context.BSNK.base_bis[j].CodecSpecificConfLength;k++)
              {
                if (TMAPAPP_Context.BSNK.base_bis[j].pCodecSpecificConf[k] > 0u)
                {
                  LOG_INFO_APP("        Length: 0x%02x\n",TMAPAPP_Context.BSNK.base_bis[j].pCodecSpecificConf[k]);
                  LOG_INFO_APP("          Type: 0x%02x\n",TMAPAPP_Context.BSNK.base_bis[j].pCodecSpecificConf[k+1u]);
                  LOG_INFO_APP("          Value: 0x");
                  for (int l = 0 ;l<(TMAPAPP_Context.BSNK.base_bis[j].pCodecSpecificConf[k]-1);l++)
                  {
                    LOG_INFO_APP("%02x",TMAPAPP_Context.BSNK.base_bis[j].pCodecSpecificConf[k+2u+l]);
                  }
                  LOG_INFO_APP("\n");
                }
                k+=TMAPAPP_Context.BSNK.base_bis[j].pCodecSpecificConf[k];
              }
              channel_alloc = LTV_GetConfiguredAudioChannelAllocation(TMAPAPP_Context.BSNK.base_bis[j].pCodecSpecificConf,
                                                                      TMAPAPP_Context.BSNK.base_bis[j].CodecSpecificConfLength);
            }
            if (channel_alloc == 0x00000000)
            {
              /* No channel alloc on BIS level, get channel alloc on subgroup level */
              channel_alloc = LTV_GetConfiguredAudioChannelAllocation(TMAPAPP_Context.BSNK.base_subgroups[i].pCodecSpecificConf,
                                                                      TMAPAPP_Context.BSNK.base_subgroups[i].CodecSpecificConfLength);
            }
            if(channel_alloc != 0x00000000)
            {
              LOG_INFO_APP("      Audio Channels Allocation Configuration : 0x%08X\n",channel_alloc);
              LOG_INFO_APP("      Number of Audio Channels %d \n",APP_GetBitsAudioChnlAllocations(channel_alloc));
            }
            if(TMAPAPP_Context.BSNK.BIGSyncState == APP_BIG_SYNC_STATE_IDLE)
            {
              if (TMAPAPP_Context.BSNK.Audio_Location != 0x00000000)
              {
                /* check if the Channel allocation matches with the Sink Audio Location supported by the Broadcast Sink */
                if(channel_alloc != 0x00000000)
                {
                  if ((TMAPAPP_Context.BSNK.Audio_Location & channel_alloc) != 0x00000000)
                  {
                    TMAPAPP_Context.BSNK.sync_bis_index[TMAPAPP_Context.BSNK.num_sync_bis] = (j+1);
                    TMAPAPP_Context.BSNK.num_sync_bis++;
                  }
                }
                else
                {
                  TMAPAPP_Context.BSNK.sync_bis_index[TMAPAPP_Context.BSNK.num_sync_bis] = (j+1);
                  TMAPAPP_Context.BSNK.num_sync_bis++;
                }
              }
              else
              {
                TMAPAPP_Context.BSNK.sync_bis_index[TMAPAPP_Context.BSNK.num_sync_bis] = (j+1);
                TMAPAPP_Context.BSNK.num_sync_bis++;
              }
            }
          }
        }
        LOG_INFO_APP("==>> End Start BAP BSNK Parse BASE Group INFO\n");

        if (TMAPAPP_Context.BSNK.BIGSyncState == APP_BIG_SYNC_STATE_IDLE)
        {
          memcpy(&TMAPAPP_Context.BSNK.codec_specific_config_subgroup[0],
                  TMAPAPP_Context.BSNK.base_subgroups[0].pCodecSpecificConf,
                  TMAPAPP_Context.BSNK.base_subgroups[0].CodecSpecificConfLength);

          uint32_t freq = LTV_GetConfiguredSamplingFrequency(TMAPAPP_Context.BSNK.base_subgroups[0].pCodecSpecificConf,
                                                              TMAPAPP_Context.BSNK.base_subgroups[0].CodecSpecificConfLength);

          LOG_INFO_APP("==>> Audio Clock with Sample Frequency Type 0x%02X Initialization\n",freq);
          TMAPAPP_Context.ConfiguredSampleFrequency = freq;
          AudioClock_Init(freq);
        }
      }
      break;
    }

    case CAP_BROADCAST_BIGINFO_REPORT_EVT:
    {
      if ((TMAPAPP_Context.BSNK.BIGSyncState == APP_BIG_SYNC_STATE_IDLE) \
          && (TMAPAPP_Context.BroadcastMode == APP_BROADCAST_MODE_SINK_ONLY))
      {
        uint8_t status;
        BAP_BIGInfo_Report_Data_t *data = (BAP_BIGInfo_Report_Data_t *) pNotification->pInfo;

        LOG_INFO_APP("  CAP_Broadcast_StartBIGSync() function for %d BIEses:\n", TMAPAPP_Context.BSNK.num_sync_bis);
        for (uint8_t i = 0u; i < TMAPAPP_Context.BSNK.num_sync_bis;i++)
        {
          LOG_INFO_APP("  BIS Index %d\n", TMAPAPP_Context.BSNK.sync_bis_index[i]);
        }
        status = CAP_Broadcast_StartBIGSync(BIG_HANDLE,
                                      data->SyncHandle,
                                      &(TMAPAPP_Context.BSNK.sync_bis_index[0]),
                                      TMAPAPP_Context.BSNK.num_sync_bis,
                                      &(TMAPAPP_Context.BSNK.base_group),
                                      0u,
                                      BAP_BROADCAST_ENCRYPTION,
                                      aAPP_BroadcastCode,
                                      BIG_MSE,
                                      BIG_SYNC_TIMEOUT);
        if (status != BLE_STATUS_SUCCESS)
        {
          LOG_INFO_APP("  Fail   : CAP_Broadcast_StartBIGSync() function, result: 0x%02X\n", status);
        }
        else
        {
          LOG_INFO_APP("  Success: CAP_Broadcast_StartBIGSync() function\n");
          TMAPAPP_Context.BSNK.BIGSyncState = APP_BIG_SYNC_STATE_SYNCHRONIZING;
          Menu_SetBISSyncPage();
        }
      }
      break;
    }

    case CAP_BROADCAST_BIG_SYNC_ESTABLISHED_EVT:
      {
        tBleStatus ret;
        BAP_BIG_Sync_Established_Data_t *data = (BAP_BIG_Sync_Established_Data_t*) pNotification->pInfo;
        LOG_INFO_APP(">>== CAP_BROADCAST_BIG_SYNC_ESTABLISHED_EVT\n");
        LOG_INFO_APP("     - Status = 0x%02x\n",pNotification->Status);

        if (pNotification->Status == BLE_STATUS_SUCCESS)
        {
          LOG_INFO_APP("     - BIG_Handle = 0x%02x\n",data->BIGHandle);
          LOG_INFO_APP("     - Num BISes = %d\n",data->NumBISes);

          UTIL_MEM_cpy_8(&(TMAPAPP_Context.BSNK.current_BIS_conn_handles[0]),
                         data->pConnHandle,
                         (data->NumBISes * sizeof(uint16_t)));
          TMAPAPP_Context.BSNK.current_num_bis = data->NumBISes;
          TMAPAPP_Context.BSNK.BIGSyncState = APP_BIG_SYNC_STATE_SYNCHRONIZED;

          if (TMAPAPP_Context.BroadcastMode == APP_BROADCAST_MODE_SINK_ONLY)
          {
            ret = CAP_Broadcast_StopPASync(TMAPAPP_Context.BSNK.PASyncHandle);
            if (ret != BLE_STATUS_SUCCESS)
            {
              LOG_INFO_APP("  Fail   : CAP_Broadcast_StopPASync() function, result: 0x%02X\n", ret);
            }
            else
            {
              LOG_INFO_APP("  Success: CAP_Broadcast_StopPASync() function\n");
              TMAPAPP_Context.BSNK.PASyncState = APP_PA_SYNC_STATE_IDLE;
            }
          }
          APP_BroadcastSetupAudio(AUDIO_ROLE_SINK);
        }
        else
        {
          TMAPAPP_Context.BSNK.BIGSyncState = APP_BIG_SYNC_STATE_IDLE;
          if (TMAPAPP_Context.BroadcastMode == APP_BROADCAST_MODE_SINK_ONLY)
          {
            Menu_SetBroadcastScanPage();
            TMAPAPP_StopSink();
            TMAPAPP_StartSink();
          }
          else
          {
            Menu_SetNoStreamPage();
          }
        }
      }
      break;

    case CAP_BROADCAST_BIG_SYNC_LOST_EVT:
      {
        LOG_INFO_APP(">>== CAP_BROADCAST_BIG_SYNC_LOST_EVT\n");
        TMAPAPP_Context.BSNK.BIGSyncState = APP_BIG_SYNC_STATE_IDLE;
      }
      break;

