STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_TMAP_Peripheral/STM32_WPAN/App/tmap_app.c
    case CAP_BROADCAST_SDE_ADD_SOURCE_REQ_EVT:
    {
      LOG_INFO_APP(">>== CAP_BROADCAST_SDE_ADD_SOURCE_REQ_EVT\n");

      CAP_Broadcast_AcceptAddBroadcastSource();
      break;
    }

    case CAP_BROADCAST_SDE_MODIFY_SOURCE_REQ_EVT:
    {
      LOG_INFO_APP(">>== CAP_BROADCAST_SDE_MODIFY_SOURCE_REQ_EVT\n");

      CAP_Broadcast_AcceptModifyBroadcastSource();
      break;
    }

    case CAP_BROADCAST_SDE_PA_SYNC_TERMINATED_EVT:
    {
      LOG_INFO_APP(">>== CAP_BROADCAST_SDE_PA_SYNC_TERMINATED_EVT\n");
      TMAPAPP_Context.BSNK.PASyncState = APP_PA_SYNC_STATE_IDLE;
      break;
    }

    case CAP_BROADCAST_SDE_BIG_SYNC_TERMINATED_EVT:
    {
      LOG_INFO_APP(">>== CAP_BROADCAST_SDE_BIG_SYNC_TERMINATED_EVT\n");
      TMAPAPP_Context.BSNK.BIGSyncState = APP_BIG_SYNC_STATE_IDLE;
      break;
    }

    case CAP_BROADCAST_SDE_START_SCAN_REQ_EVT:
    {
      uint8_t status;

      LOG_INFO_APP(">>== CAP_BROADCAST_SDE_START_SCAN_REQ_EVT\n");

      status = CAP_Broadcast_StartAdvReportParsing();

      if (status == BLE_STATUS_SUCCESS)
      {
        Scan_Param_Phy_t scan_param_phy;
        scan_param_phy.Scan_Type     = 0x00; /*Passive scanning*/
        scan_param_phy.Scan_Interval = SCAN_INTERVAL;
        scan_param_phy.Scan_Window   = SCAN_WINDOW;
        /* Starts an Observation procedure */
        status = aci_gap_ext_start_scan( 0x00,
                                        GAP_OBSERVATION_PROC,
                                        0x00,                         /* Address type: Public */
                                        0x00,                         /* Filter duplicates: No */
                                        0x00,                         /* Scan continuously until explicitly disable */
                                        0x00,                         /* Scan continuously */
                                        0x00,                         /* Filter policy: Accept all */
                                        HCI_SCANNING_PHYS_LE_1M,
                                        &scan_param_phy);
        if (status != BLE_STATUS_SUCCESS)
        {
          LOG_INFO_APP("  Fail   : aci_gap_ext_start_scan() function with Scan procedure 0x%02X, result: 0x%02X\n",
                       GAP_OBSERVATION_PROC,
                       status);
        }
        else
        {
          LOG_INFO_APP("  Success: aci_gap_ext_start_scan() function with Scan procedure 0x%02X\n",
                       GAP_OBSERVATION_PROC);
        }
      }

      *(pNotification->pInfo) = status;

      TMAPAPP_Context.BSNK.BIGSyncState = APP_BIG_SYNC_STATE_IDLE;
      break;
    }

#endif /*((APP_TMAP_ROLE & TMAP_ROLE_BROADCAST_MEDIA_RECEIVER) == TMAP_ROLE_BROADCAST_MEDIA_RECEIVER)*/
    default:
      break;
  }
}
static void LinkupRetry_TimerCallback(void *arg)
{
  UTIL_SEQ_SetTask(1U << CFG_TASK_APP_LINKUP_RETRY_TIMER_ID, CFG_SEQ_PRIO_0);
}
static void APP_LinkupTaskHandler(void)
{
  tBleStatus status;
  LOG_INFO_APP("Retry to perform Linkup with a remote connected device\n");
  for (uint8_t conn = 0; conn < CFG_BLE_NUM_LINK ; conn++)
  {
    if ( TMAPAPP_Context.ACL_Conn[conn].LinkupRetry == 1u)
    {
      /*Update LinkupRetry flag to indicate that Linkup retry has been handled*/
      TMAPAPP_Context.ACL_Conn[conn].LinkupRetry = 0xFFu;
      status = TMAPAPP_Linkup(TMAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle);
      if (status == BLE_STATUS_SUCCESS)
      {
        return;
      }
    }
  }
}

#if ((APP_TMAP_ROLE & TMAP_ROLE_BROADCAST_MEDIA_RECEIVER) == TMAP_ROLE_BROADCAST_MEDIA_RECEIVER)
static uint8_t APP_BroadcastSetupAudio(Audio_Role_t role)
{
  Sampling_Freq_t sampling_freq;
  Frame_Duration_t frame_duration;
  uint8_t direction = DATA_PATH_INPUT;
  uint32_t controller_delay;
  uint32_t controller_delay_min = 0;
  uint32_t controller_delay_max = 0;
  uint8_t a_codec_id[5] = {0x00,0x00,0x00,0x00,0x00};
  tBleStatus ret;

  LOG_INFO_APP("==>> Start APP_BroadcastSetupAudio function\n");

  a_codec_id[0] = AUDIO_CODING_FORMAT_LC3;

  sampling_freq = LTV_GetConfiguredSamplingFrequency(
      &TMAPAPP_Context.BSNK.base_group.pSubgroups[0].pCodecSpecificConf[0],
      TMAPAPP_Context.BSNK.base_group.pSubgroups[0].CodecSpecificConfLength);

  frame_duration = LTV_GetConfiguredFrameDuration(
      &TMAPAPP_Context.BSNK.base_group.pSubgroups[0].pCodecSpecificConf[0],
      TMAPAPP_Context.BSNK.base_group.pSubgroups[0].CodecSpecificConfLength);

  if ((sampling_freq != 0) && (frame_duration != 0xFF))
  {
    APP_StartBroadcastAudio(role);
    MX_AudioInit(role,
                 sampling_freq,
                 frame_duration,
                 (uint8_t *)aSnkBuff,
                 NULL);

    /* AUDIO_ROLE_SINK */
    direction = DATA_PATH_OUTPUT;
    CAP_Broadcast_ReadSupportedControllerDelay(TMAPAPP_Context.BSNK.current_num_bis,
                                               DATA_PATH_OUTPUT,
                                               a_codec_id,
                                               &controller_delay_min,
                                               &controller_delay_max);

    /* choice of implementation : we try to use as much as possible the controller RAM for delaying before the application RAM*/
    controller_delay = TMAPAPP_Context.BSNK.base_group.PresentationDelay - APP_DELAY_SNK_MIN;

    /* check that we don't exceed the maximum value */
    if (controller_delay > controller_delay_max)
    {
      controller_delay = controller_delay_max;
      LOG_INFO_APP("Controller delay clipped to maximum value %d us\n", controller_delay);
    }
    else if (controller_delay < controller_delay_min)
    {
      controller_delay = controller_delay_min;
      LOG_INFO_APP("Controller delay clipped to minimum value %d us\n", controller_delay);
      LOG_INFO_APP("Warning, could not respect the presentation delay (too low)\n");
    }
    else
    {
      LOG_INFO_APP("Controller delay chosen to %d us\n", controller_delay);
    }

    /* compute the application delay */
    LOG_INFO_APP("Expecting application to respect the delay of %d us\n",
                (TMAPAPP_Context.BSNK.base_group.PresentationDelay - controller_delay));
    if ((TMAPAPP_Context.BSNK.base_group.PresentationDelay - controller_delay) > APP_DELAY_SNK_MAX)
    {
      LOG_INFO_APP("Warning, could not respect the presentation delay (too high)\n");
    }

