STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_TMAP_Peripheral/STM32_WPAN/App/tmap_app.c
    status = LTV_GetPreferredAudioContexts((uint8_t *)pMetadata,MetadataLength,&audio_context);
    if(status == 1u)
    {
      LOG_INFO_APP("ASE ID 0x%02X on ConnHandle 0x%04X is associated to a Preferred Audio Contexts 0x%04X\n",
                   pASE->ID,
                   ConnHandle,
                   audio_context);
    }
  }
}

/* Update the available audio contextsaccording to a Audio Contexts in use
 * Return new available audio contexts
*/
static uint16_t APP_UnavailableAudioContexts(ASE_Type_t Type,
                                             Audio_Context_t AvailableAudioContext,
                                             Audio_Context_t AudioContexts)
{
  Audio_Context_t res_audio_contexts = AvailableAudioContext;
  if (Type == ASE_SINK)
  {
    /* Remove the contexts which are not available according to Streaming Audio contexts of the other ASEs */
    if (AudioContexts & AUDIO_CONTEXT_MEDIA)
    {
      /*If Audio Contexts includes Media type :  Media, Alerts, Sound Effects and Unspecified Contexts would be no more available*/
      res_audio_contexts &= ( ~(AUDIO_CONTEXT_MEDIA | AUDIO_CONTEXT_UNSPECIFIED | AUDIO_CONTEXT_ALERTS | AUDIO_CONTEXT_SOUND_EFFECTS));
    }
    if (AudioContexts & AUDIO_CONTEXT_ALERTS)
    {
      /*If Audio Contexts includes Alerts type :  Media, Alerts, Sound Effects and Unspecified Contexts would be no more available*/
      res_audio_contexts &= ( ~(AUDIO_CONTEXT_ALERTS | AUDIO_CONTEXT_UNSPECIFIED | AUDIO_CONTEXT_MEDIA | AUDIO_CONTEXT_SOUND_EFFECTS));
    }
    if (AudioContexts & AUDIO_CONTEXT_SOUND_EFFECTS)
    {
      /*If Audio Contexts includes Sound Effect type :  Sound Effect and Unspecified Contexts be would no more available*/
      res_audio_contexts &= ( ~(AUDIO_CONTEXT_SOUND_EFFECTS | AUDIO_CONTEXT_UNSPECIFIED));
    }
    if (AudioContexts & AUDIO_CONTEXT_RINGTONE)
    {
      /*If Audio Contexts includes RingTone type :  Ringtone, Media, Alerts, Sound Effects and Unspecified Contexts would be no more available*/
      res_audio_contexts &= ( ~(AUDIO_CONTEXT_RINGTONE | AUDIO_CONTEXT_UNSPECIFIED | AUDIO_CONTEXT_MEDIA | AUDIO_CONTEXT_ALERTS | AUDIO_CONTEXT_SOUND_EFFECTS));
    }
    if (AudioContexts & AUDIO_CONTEXT_CONVERSATIONAL)
    {
      /*If Audio Contexts includes Conversational type :  Conversational still available but Ringtone, Media, Alerts, Sound Effects and Unspecified Contexts would no more available*/
      res_audio_contexts &= ( ~(AUDIO_CONTEXT_UNSPECIFIED | AUDIO_CONTEXT_RINGTONE | AUDIO_CONTEXT_MEDIA | AUDIO_CONTEXT_ALERTS | AUDIO_CONTEXT_SOUND_EFFECTS));
    }
  }
  else
  {
    if (AudioContexts & AUDIO_CONTEXT_CONVERSATIONAL)
    {
      /*If Audio Contexts includes Conversational type :  Conversational still available but Unspecified Context would no more available*/
      res_audio_contexts &= ( ~(AUDIO_CONTEXT_UNSPECIFIED));
    }
  }
  return res_audio_contexts;
}
/* Release the Streaming Audio Contexts associated to an ASE to update the available audio contexts
 * and return new available audio contexts
*/
static uint16_t APP_ReleasedASEStreamingAudioContexts(APP_ACL_Conn_t *pConn,APP_ASE_Info_t *pASE, uint16_t AudioContexts)
{
  Audio_Context_t available_context = 0;
  Audio_Context_t use_context = 0;

  /* Check if potential removed Audio Contexts is also associated to an Enabling/streaming ASE in order to
   * check if it would be available or not
   */
#if (APP_NUM_SNK_ASE > 0u)
  if (pASE->type == ASE_SINK)
  {
    available_context = AudioContexts;
    for (uint8_t conn = 0u; conn < CFG_BLE_NUM_LINK ; conn++)
    {
      if (TMAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle != 0xFFFFu)
      {
        for ( uint8_t i = 0; i < TMAPAPP_Context.NumSnkASEs;i++)
        {
          if ((TMAPAPP_Context.ACL_Conn[conn].pASEs->aSnkASE[i].allocated == 1) \
              && (&TMAPAPP_Context.ACL_Conn[conn].pASEs->aSnkASE[i] != pASE))
          {
            if ((TMAPAPP_Context.ACL_Conn[conn].pASEs->aSnkASE[i].state == ASE_STATE_ENABLING) \
              || (TMAPAPP_Context.ACL_Conn[conn].pASEs->aSnkASE[i].state == ASE_STATE_STREAMING))
            {
              use_context |= TMAPAPP_Context.ACL_Conn[conn].pASEs->aSnkASE[i].streaming_audio_context;
              available_context &= ~TMAPAPP_Context.ACL_Conn[conn].pASEs->aSnkASE[i].streaming_audio_context;
              LOG_INFO_APP("Streaming Audio Contexts 0x%04X associated to ASE ID %d on ConnHandle 0x%04X still in use\n",
                           TMAPAPP_Context.ACL_Conn[conn].pASEs->aSnkASE[i].streaming_audio_context,
                           TMAPAPP_Context.ACL_Conn[conn].pASEs->aSnkASE[i].ID,
                           TMAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle);
            }
          }
        }
      }
    }
    /* if audio contexts are now available, update them because if audio contexts are released, other audio contexts
     * become also available
     */
    if (available_context != 0x0000)
    {
      if (available_context & AUDIO_CONTEXT_MEDIA)
      {
        available_context |= SUPPORTED_SNK_MEDIA_RECEIVER_CONTEXTS;
      }
      if (available_context & AUDIO_CONTEXT_ALERTS)
      {
        available_context |= SUPPORTED_SNK_MEDIA_RECEIVER_CONTEXTS;
      }
      if (available_context & AUDIO_CONTEXT_RINGTONE)
      {
        available_context |= SUPPORTED_SNK_MEDIA_RECEIVER_CONTEXTS;
      }
      if (available_context & AUDIO_CONTEXT_CONVERSATIONAL)
      {
        available_context |= SUPPORTED_SNK_MEDIA_RECEIVER_CONTEXTS;
      }
      /* Remove the contexts which are not available according to Streaming Audio contexts of the other ASEs */
      available_context = APP_UnavailableAudioContexts(ASE_SINK,available_context,use_context);
      if (available_context != 0x0000)
      {
        LOG_INFO_APP("Add Audio Contexts 0x%04X to Available Snk Audio Contexts 0x%04X\n",
                     available_context,
                     TMAPAPP_Context.AvailableSnkAudioContext);
      }
    }
  }
#endif /* (APP_NUM_SNK_ASE > 0u) */
#if (APP_NUM_SRC_ASE > 0u)
  if (pASE->type == ASE_SOURCE)
  {
    available_context = AudioContexts;
    for (uint8_t conn = 0u; conn < CFG_BLE_NUM_LINK ; conn++)
    {
      if (TMAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle != 0xFFFFu)
      {
        for ( uint8_t i = 0; i < TMAPAPP_Context.NumSrcASEs;i++)
        {
          if ((TMAPAPP_Context.ACL_Conn[conn].pASEs->aSrcASE[i].allocated == 1) \
              && (&TMAPAPP_Context.ACL_Conn[conn].pASEs->aSrcASE[i] != pASE))
          {
            if ((TMAPAPP_Context.ACL_Conn[conn].pASEs->aSrcASE[i].state == ASE_STATE_ENABLING) \
              || (TMAPAPP_Context.ACL_Conn[conn].pASEs->aSrcASE[i].state == ASE_STATE_STREAMING))
            {
              use_context |= TMAPAPP_Context.ACL_Conn[conn].pASEs->aSrcASE[i].streaming_audio_context;
              available_context &= ~TMAPAPP_Context.ACL_Conn[conn].pASEs->aSrcASE[i].streaming_audio_context;
              LOG_INFO_APP("Streaming Audio Contexts 0x%04X associated to ASE ID %d on ConnHandle 0x%04X still in use\n",
                           TMAPAPP_Context.ACL_Conn[conn].pASEs->aSrcASE[i].streaming_audio_context,
                           TMAPAPP_Context.ACL_Conn[conn].pASEs->aSrcASE[i].ID,
                           TMAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle);
            }
          }
        }
      }
    }
    /* Remove the contexts which are not available according to Streaming Audio contexts of the other ASEs */
    available_context = APP_UnavailableAudioContexts(ASE_SOURCE,available_context,use_context);
    if (available_context != 0x0000)
    {
      LOG_INFO_APP("Add Audio Contexts 0x%04X to Available Src Audio Contexts 0x%04X\n",
                   available_context,
                   TMAPAPP_Context.AvailableSrcAudioContext);
    }
  }
#endif /* (APP_NUM_SRC_ASE > 0u) */

