STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_TMAP_Peripheral/STM32_WPAN/App/tmap_app.c
    /* SAI/I2C peripheral driver requests to set decimation to 2*/

    if (role == AUDIO_ROLE_SOURCE)
    {
      param.Decimation = 1;
    }
    else
    {
      param.Decimation = 2;
    }

    /*Data Path ID is vendor-specific transport interface : 0x01 for "Shared memory of SAI"*/
    status = CAP_Unicast_SetupAudioDataPath(CIS_ConnHandle,
                                            ASE_ID,
                                            DATA_PATH_SAMPLE_CIRC_BUF,
                                            ControllerDelay,
                                            CONFIGURE_DATA_PATH_SAMPLE_LEN,
                                            (uint8_t *)&param);
    LOG_INFO_APP("Setup Unicast Audio Data Path for ASE ID %d on CIS connection handle 0x%04X with controller delay at %d us returns status 0x%02X\n",
                ASE_ID,
                CIS_ConnHandle,
                ControllerDelay,
                status);
    if(status != BLE_STATUS_SUCCESS)
    {
      /*remove cis_handle*/
      if (role == AUDIO_ROLE_SOURCE)
      {
        for (i = 0; i< APP_MAX_NUM_CIS; i++)
        {
          if (TMAPAPP_Context.cis_src_handle[i] == CIS_ConnHandle)
          {
            TMAPAPP_Context.cis_src_handle[i] = 0xFFFFu;
            TMAPAPP_Context.num_cis_src--;
            break;
          }
        }
      }
      else if (role == AUDIO_ROLE_SINK)
      {
        for (i = 0; i< APP_MAX_NUM_CIS; i++)
        {
          if (TMAPAPP_Context.cis_snk_handle[i] == CIS_ConnHandle)
          {
            TMAPAPP_Context.cis_snk_handle[i] = 0xFFFFu;
            TMAPAPP_Context.num_cis_snk--;
            break;
          }
        }
      }
    }
    else
    {
      APP_ASE_Info_t *p_app_ase;
      p_app_ase = APP_GetASE(ASE_ID,ACL_ConnHandle);
      if (p_app_ase != 0)
      {
        LOG_INFO_APP("Audio Data Path is complete with remaining Application delay for audio process to respect : %dus\n",
                     (p_app_ase->presentation_delay - p_app_ase->controller_delay));
      }
    }
  }
  else
  {
    LOG_INFO_APP("No Audio Stream Endpoint with ASE ID %d on ACL connection handle 0x%04X status 0x%02X\n",
                 ASE_ID,
                 ACL_ConnHandle);
    status = BLE_STATUS_INVALID_PARAMS;
  }
  UNUSED(num_chnls);
  return status;
}

static uint8_t APP_GetBitsAudioChnlAllocations(Audio_Chnl_Allocation_t ChnlLocations)
{

  uint8_t bits = 0u;
  uint8_t i;

  for (i = 0; i < (8u*sizeof(Audio_Chnl_Allocation_t)); i++)
  {
    if (ChnlLocations & (1u<<i))
    {
      bits++;
    }
  }
  return bits;
}

/*Audio Source */
static int32_t start_audio_source(void)
{
  return Start_RxAudio();
}

/*Audio Sink */
static int32_t start_audio_sink(void)
{
  /* reset numbers of active channels */
  Nb_Active_Ch = 0;

  return Start_TxAudio();
}

#if (APP_CCP_ROLE_CLIENT_SUPPORT == 1u)
/**
  * @brief  Notify CCP Meta Events
  * @param  pNotification: pointer on notification information
 */
static void CCP_MetaEvt_Notification(CCP_Notification_Evt_t *pNotification)
{
  tBleStatus ret;
  APP_ACL_Conn_t *p_conn = APP_GetACLConn(pNotification->ConnHandle);

  switch(pNotification->EvtOpcode)
  {
    case CCP_CLT_CALL_STATE_EVT:
    {
      CCP_CLT_Call_State_Params_Evt_t *cs_params = (CCP_CLT_Call_State_Params_Evt_t *)pNotification->pInfo;
      if (p_conn != 0)
      {
        p_conn->CurrentCallID = cs_params->CallIdx;
        p_conn->CurrentCallState = cs_params->State;
      }
      switch(cs_params->State)
      {
        case CCP_CS_IDLE:
          LOG_INFO_APP("Call %d is terminated on Telephone Bearer ID %d\n",
                      cs_params->CallIdx,
                      pNotification->ContentControlID);
          Menu_SetCallState("IDLE");
        break;

        case CCP_CS_INCOMING:
          LOG_INFO_APP("Call %d is Incoming : A remote party is calling on Telephone Bearer ID %d\n",
                      cs_params->CallIdx,
                      pNotification->ContentControlID);
          Menu_SetCallState("INCOMING");
          if ((p_conn != 0) && ((p_conn->CurrentContentCtrlOp & CCP_CLT_OP_READ_FEATURES_STATUS) == 0) \
              && ((p_conn->PendingContentCtrlOp & CCP_CLT_OP_READ_FEATURES_STATUS) == 0))
          {
            ret = CCP_CLIENT_ReadFeaturesStatus(pNotification->ConnHandle,pNotification->ContentControlID);
            if (ret != BLE_STATUS_SUCCESS)
            {
              if (ret == BLE_STATUS_BUSY)
              {
                p_conn->PendingContentCtrlOp |= CCP_CLT_OP_READ_FEATURES_STATUS;
              }
              LOG_INFO_APP("  Fail   : CCP_CLIENT_ReadFeaturesStatus with ConnHandle 0x%04X and CCID %d - result: 0x%02X\n",
                           pNotification->ConnHandle,
                           pNotification->ContentControlID,
                           ret);
            }
            else
            {
              p_conn->CurrentContentCtrlOp |= CCP_CLT_OP_READ_FEATURES_STATUS;
              LOG_INFO_APP("  Success: CCP_CLIENT_ReadFeaturesStatus with ConnHandle 0x%04X and CCID %d\n",
                           pNotification->ConnHandle,
                           pNotification->ContentControlID);
            }
          }
        break;

        case CCP_CS_DIALING:
          LOG_INFO_APP("Call %d is dialing on Telephone Bearer ID %d (remote party not already alerted)\n",
                       cs_params->CallIdx,
                       pNotification->ContentControlID);
          Menu_SetCallState("DIALING");
          if ((p_conn != 0) && ((p_conn->CurrentContentCtrlOp & CCP_CLT_OP_READ_FEATURES_STATUS) == 0) \
              && ((p_conn->PendingContentCtrlOp & CCP_CLT_OP_READ_FEATURES_STATUS) == 0))
          {
            ret = CCP_CLIENT_ReadFeaturesStatus(pNotification->ConnHandle,pNotification->ContentControlID);
            if (ret != BLE_STATUS_SUCCESS)
            {
              if (ret == BLE_STATUS_BUSY)
              {
                p_conn->PendingContentCtrlOp |= CCP_CLT_OP_READ_FEATURES_STATUS;
              }
              LOG_INFO_APP("  Fail   : CCP_CLIENT_ReadFeaturesStatus with ConnHandle 0x%04X and CCID %d - result: 0x%02X\n",
                           pNotification->ConnHandle,
                           pNotification->ContentControlID,
                           ret);
            }
            else
            {
              p_conn->CurrentContentCtrlOp |= CCP_CLT_OP_READ_FEATURES_STATUS;
              LOG_INFO_APP("  Success: CCP_CLIENT_ReadFeaturesStatus with ConnHandle 0x%04X and CCID %d\n",
                           pNotification->ConnHandle,
                           pNotification->ContentControlID);
            }
          }
        break;

        case CCP_CS_ALERTING:
          LOG_INFO_APP("remote party is being alerted on connectio handle 0x%04X on Telephone Bearer ID %d\n",
                      pNotification->ConnHandle,
                      pNotification->ContentControlID);
          Menu_SetCallState("ALERTING");
        break;

        case CCP_CS_ACTIVE:
          LOG_INFO_APP("Call %d is active on Telephone Bearer ID %d\n",
                      cs_params->CallIdx,
                      pNotification->ContentControlID);
          Menu_SetCallState("ACTIVE");
        break;

        case CCP_CS_LOCALLY_HELD:
          LOG_INFO_APP("Call %d is connected but held locally on Telephone Bearer ID %d\n",
                      cs_params->CallIdx,
                      pNotification->ContentControlID);
          Menu_SetCallState("HELD");
        break;

        case CCP_CS_REMOTELY_HELD:
          LOG_INFO_APP("Call %d is connected but held remotely on Telephone Bearer ID %d\n",
                      cs_params->CallIdx,
                      pNotification->ContentControlID);
          Menu_SetCallState("HELD");
        break;

