STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_TMAP_Peripheral/STM32_WPAN/App/tmap_app.c
        case CCP_CS_LOCALLY_REMOTELY_HELD:
          LOG_INFO_APP("Call %d is connected but held locally and remotely on Telephone Bearer ID %d\n",
                      cs_params->CallIdx,
                      pNotification->ContentControlID);
          Menu_SetCallState("HELD");
        break;
      }
      LOG_INFO_APP("     Call Flags : 0x%02X\n",cs_params->CallFlags);
      break;
    }

    case CCP_CLT_CURRENT_CALL_EVT:
    {
      CCP_CLT_Call_Item_Evt_t *bearer_info = (CCP_CLT_Call_Item_Evt_t *)pNotification->pInfo;

      LOG_INFO_APP("Current Call of Telephone Bearer Instance ID %d on remote CCP Server : \n",
                  pNotification->ContentControlID);
      LOG_INFO_APP("     Call Index : %d\n",bearer_info->CallIndex);
      if (p_conn != 0)
      {
        p_conn->CurrentCallID = bearer_info->CallIndex;
        p_conn->CurrentCallState = bearer_info->CallState;
      }
      switch(bearer_info->CallState)
      {
        case CCP_CS_IDLE:
          LOG_INFO_APP("     Call State : IDLE\n");
        break;

        case CCP_CS_INCOMING:
          LOG_INFO_APP("     Call State : INCOMING\n");
          if ((p_conn != 0) && ((p_conn->CurrentContentCtrlOp & CCP_CLT_OP_READ_FEATURES_STATUS) == 0) \
              && ((p_conn->PendingContentCtrlOp & CCP_CLT_OP_READ_FEATURES_STATUS) == 0))
          {
            ret = CCP_CLIENT_ReadFeaturesStatus(pNotification->ConnHandle,pNotification->ContentControlID);
            if (ret != BLE_STATUS_SUCCESS)
            {
              if (ret == BLE_STATUS_BUSY)
              {
                p_conn->PendingContentCtrlOp |= CCP_CLT_OP_READ_FEATURES_STATUS;
              }
              LOG_INFO_APP("  Fail   : CCP_CLIENT_ReadFeaturesStatus with ConnHandle 0x%04X and CCID %d - result: 0x%02X\n",
                           pNotification->ConnHandle,
                           pNotification->ContentControlID,
                           ret);
            }
            else
            {
              p_conn->CurrentContentCtrlOp |= CCP_CLT_OP_READ_FEATURES_STATUS;
              LOG_INFO_APP("  Success: CCP_CLIENT_ReadFeaturesStatus with ConnHandle 0x%04X and CCID %d\n",
                           pNotification->ConnHandle,
                           pNotification->ContentControlID);
            }
          }
        break;

        case CCP_CS_DIALING:
          LOG_INFO_APP("     Call State : DIALING\n");
          if ((p_conn != 0) && ((p_conn->CurrentContentCtrlOp & CCP_CLT_OP_READ_FEATURES_STATUS) == 0) \
              && ((p_conn->PendingContentCtrlOp & CCP_CLT_OP_READ_FEATURES_STATUS) == 0))
          {
            ret = CCP_CLIENT_ReadFeaturesStatus(pNotification->ConnHandle,pNotification->ContentControlID);
            if (ret != BLE_STATUS_SUCCESS)
            {
              if (ret == BLE_STATUS_BUSY)
              {
                p_conn->PendingContentCtrlOp |= CCP_CLT_OP_READ_FEATURES_STATUS;
              }
              LOG_INFO_APP("  Fail   : CCP_CLIENT_ReadFeaturesStatus with ConnHandle 0x%04X and CCID %d - result: 0x%02X\n",
                           pNotification->ConnHandle,
                           pNotification->ContentControlID,
                           ret);
            }
            else
            {
              p_conn->CurrentContentCtrlOp |= CCP_CLT_OP_READ_FEATURES_STATUS;
              LOG_INFO_APP("  Success: CCP_CLIENT_ReadFeaturesStatus with ConnHandle 0x%04X and CCID %d\n",
                           pNotification->ConnHandle,
                           pNotification->ContentControlID);
            }
          }
        break;

        case CCP_CS_ALERTING:
          LOG_INFO_APP("     Call State : ALERTING\n");
        break;

        case CCP_CS_ACTIVE:
          LOG_INFO_APP("     Call State : ACTIVE\n");
        break;

        case CCP_CS_LOCALLY_HELD:
          LOG_INFO_APP("     Call State : LOCALLY HELD\n");
        break;

        case CCP_CS_REMOTELY_HELD:
          LOG_INFO_APP("     Call State : REMOTELY HELD\n");
        break;

        case CCP_CS_LOCALLY_REMOTELY_HELD:
          LOG_INFO_APP("     Call State : LOCALLY AND REMOTELY HELD\n");
        break;
      }
      LOG_INFO_APP("     Call Flags : 0x%02X\n",bearer_info->CallFlags);
      if (bearer_info->CallURILength > 0u)
      {
        LOG_INFO_APP("     Call URI : ");
        Print_String(bearer_info->pCallURI, bearer_info->CallURILength);
        LOG_INFO_APP("\n");
      }
      break;
    }

    case CCP_CLT_GTBS_INFO_EVT:
    {
      CCP_CLT_BearerInfo_Evt_t *bearer_info = (CCP_CLT_BearerInfo_Evt_t *)pNotification->pInfo;

      LOG_INFO_APP("Generic Telephone Bearer with CCID %d on remote CCP Server (connection handle 0x%04X)\n",
                  pNotification->ContentControlID,
                  pNotification->ConnHandle);
      if (p_conn != 0)
      {
        p_conn->GenericTelephoneBearerCCID = pNotification->ContentControlID;
      }
      LOG_INFO_APP("Start ATT Handle : 0x%04X - End ATT Handle : 0x%04X\n",
                      bearer_info->StartAttHandle,
                      bearer_info->EndAttHandle);
      if (bearer_info->FeaturesMask & CCP_FEATURE_BEARER_SIGNAL_STRENGTH)
      {
        LOG_INFO_APP("Bearer Signal Strength ( and associated Signal Strength Reporting Interval) is supported on remote CCP Server\n");
      }
      if (bearer_info->FeaturesMask & CCP_FEATURE_INC_CALL_TARGET_BEARER_URI)
      {
        LOG_INFO_APP("Incoming Call Target Bearer URI is supported on remote CCP Server\n");
      }
      if (bearer_info->FeaturesMask & CCP_FEATURE_CALL_FRIENDLY_NAME)
      {
        LOG_INFO_APP("Call friendly Name is supported on remote CCP Server\n");
      }
      break;
    }

    case CCP_CLT_OPERATION_COMPLETE_EVT:
    {
      APP_ACL_Conn_t *p_conn;
      LOG_INFO_APP("CCP Client Operation with remote CCP Server on connection handle 0x%04X is complete with status 0x%02X\n",
                  pNotification->ConnHandle,
                  pNotification->Status);

      p_conn = APP_GetACLConn(pNotification->ConnHandle);
      if (p_conn != 0)
      {
        if (p_conn->CurrentContentCtrlOp & CCP_CLT_OP_READ_CALL_STATE)
        {
          p_conn->CurrentContentCtrlOp &= ~CCP_CLT_OP_READ_CALL_STATE;
        }
        else if (p_conn->CurrentContentCtrlOp & CCP_CLT_OP_READ_FEATURES_STATUS)
        {
          p_conn->CurrentContentCtrlOp &= ~CCP_CLT_OP_READ_FEATURES_STATUS;
        }
      }
      /* Schedule pending MCP/CCP operation if it exists*/
      TMAP_SchedulePendingContentControlOp(p_conn);
      break;
    }

    case CCP_CLT_OPERATION_TRANSMITTED_EVT:
    {
      CCP_CLT_CallCtrlOpTransmitted_Evt_t *p_event_params = (CCP_CLT_CallCtrlOpTransmitted_Evt_t *) pNotification->pInfo;
      LOG_INFO_APP("CCP Client Call Control Operation 0x02X with remote CCP Server on connection handle 0x%04X is transmitted with status 0x%02X\n",
                  pNotification->ConnHandle,
                  p_event_params->CallCtrlOp,
                  pNotification->Status);
      if (p_conn != 0)
      {
        if ((p_event_params->CallCtrlOp == CCP_CALL_CTRL_ACCEPT) && (p_conn->CurrentContentCtrlOp & CCP_CLT_OP_ANSWER_INC_CALL))
        {
          p_conn->CurrentContentCtrlOp &= ~CCP_CLT_OP_ANSWER_INC_CALL;
        }
        else if ((p_event_params->CallCtrlOp == CCP_CALL_CTRL_TERMINATE) && (p_conn->CurrentContentCtrlOp & CCP_CLT_OP_TERMINATE_CALL))
        {
          p_conn->CurrentContentCtrlOp &= ~CCP_CLT_OP_TERMINATE_CALL;
        }
      }
      /* Schedule pending MCP/CCP operation if it exists*/
      TMAP_SchedulePendingContentControlOp(p_conn);
      break;
    }

