STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_TMAP_Peripheral/STM32_WPAN/App/tmap_app.c
    case CCP_CLT_PROVIDER_NAME_EVT:
    {
      CCP_CLT_Bearer_Provider_Name_Evt_t *info = (CCP_CLT_Bearer_Provider_Name_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("Provider Name of Telephone Bearer Instance ID %d on remote CCP Server (len %d) : ",
                  pNotification->ContentControlID,
                  info->NameLength);
      Print_String(info->pName, info->NameLength);
      LOG_INFO_APP("\n");
      break;
    }

    case CCP_CLT_UCI_EVT:
    {
      CCP_CLT_Bearer_UCI_Evt_t *info = (CCP_CLT_Bearer_UCI_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("UCI of Telephone Bearer Instance ID %d on remote CCP Server (len %d) : ",
                  pNotification->ContentControlID,
                  info->Length);
      Print_String(info->pUCI, info->Length);
      LOG_INFO_APP("\n");
      break;
    }

    case CCP_CLT_TECHNOLOGY_EVT:
    {
      CCP_CLT_Bearer_Technology_Evt_t *info = (CCP_CLT_Bearer_Technology_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("Techoplogy of Telephone Bearer Instance ID %d on remote CCP Server : %d\n",
                  pNotification->ContentControlID,
                  info->Techno);
      UNUSED(info);
      break;
    }

    case CCP_CLT_URI_SCHEMES_LIST_EVT:
    {
      CCP_CLT_Bearer_URI_Schemes_List_Evt_t *info = (CCP_CLT_Bearer_URI_Schemes_List_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("Supported URI Schemes of Telephone Bearer Instance ID %d on remote CCP Server (len %d) : ",
                  pNotification->ContentControlID,
                  info->Length);
      Print_String(info->pURISchemes, info->Length);
      LOG_INFO_APP("\n");
      break;
    }

    case CCP_CLT_SIGNAL_STRENGTH_EVT:
    {
      CCP_CLT_Signal_Strength_Evt_t *info = (CCP_CLT_Signal_Strength_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("Signal Strength of Telephone Bearer Instance ID %d on remote CCP Server : %d\n",
                  pNotification->ContentControlID,
                  info->SignalStrength);
      UNUSED(info);
      break;
    }

    case CCP_CLT_SSR_INTERVAL_EVT:
    {
      CCP_CLT_SSR_Interval_Evt_t *info = (CCP_CLT_SSR_Interval_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("SSR Interval of Telephone Bearer Instance ID %d on remote CCP Server : %d seconds\n",
                  pNotification->ContentControlID,
                  info->SSR_Interval);
      UNUSED(info);
      break;
    }

    case CCP_CLT_NO_CURRENT_CALL_EVT:
    {
      LOG_INFO_APP("No Call in Progress on Telephone Bearer Instance ID %d on remote CCP Server\n",
                   pNotification->ContentControlID);
      break;
    }

    case CCP_CLT_INC_CALL_TARGET_URI_EVT:
    {
      CCP_CLT_Call_URI_Evt_t *info = (CCP_CLT_Call_URI_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("Incoming Call Target URI for Call ID %d of Telephone Bearer Instance ID %d on remote CCP Server (len %d) : ",
                  info->CallIndex,
                  pNotification->ContentControlID,
                  info->URILength);
      Print_String(info->pURI, info->URILength);
      LOG_INFO_APP("\n");
      break;
    }

    case CCP_CLT_FEATURES_STATUS_EVT:
    {
      CCP_CLT_Features_Status_Evt_t *info = (CCP_CLT_Features_Status_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("Features Status of Telephone Bearer Instance ID %d on remote CCP Server :\n",
                  pNotification->ContentControlID);
      if (info->InbandRingtone == CCP_INBAND_RINGTONE_ENABLED)
      {
        /* InBand RingTone supported by remote device.
         * If RingTone Audio Contexts is available, the CAP Acceptor doesn't need to generate out-of-band ringtones.
         */
        LOG_INFO_APP("   InBand RingTone : Enabled\n");
      }
      else
      {
        /* InBand RingTone not supported by remote device, the CAP Acceptor needs to generate out-of-band ringtones. */
        LOG_INFO_APP("   InBand RingTone : Disabled\n");
      }
      if (info->SilentMode == CCP_SILENT_MODE_ON)
      {
        LOG_INFO_APP("   Silent Mode : ON\n");
      }
      else
      {
        LOG_INFO_APP("   Silent Mode : OFF\n");
      }
      break;
    }

    case CCP_CLT_CALL_CTRL_OPTIONS_EVT:
    {
      CCP_CLT_Call_Ctrl_Options_Evt_t *info = (CCP_CLT_Call_Ctrl_Options_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("Call Control Options of Telephone Bearer Instance ID %d on remote CCP Server :\n",
                  pNotification->ContentControlID);
      if (info->LocalHoldOption == CCP_LOCAL_HOLD_FEATURE_SUPPORTED)
      {
        LOG_INFO_APP("   Local Hold and Local Retrieve Call Control supported\n");
      }
      else
      {
        LOG_INFO_APP("   Local Hold and Local Retrieve Call Control not supported\n");
      }
      if (info->JoinOption == CCP_JOIN_FEATURE_SUPPORTED)
      {
        LOG_INFO_APP("   Join Call Control Point supported\n");
      }
      else
      {
        LOG_INFO_APP("   Join Call Control Point not supported\n");
      }
      break;
    }

    case CCP_CLT_INCOMING_CALL_EVT:
    {
      CCP_CLT_Call_URI_Evt_t *info = (CCP_CLT_Call_URI_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("Incoming Caller URI for Call ID %d of Telephone Bearer Instance ID %d on remote CCP Server (len %d) : ",
                  info->CallIndex,
                  pNotification->ContentControlID,
                  info->URILength);
      Print_String(info->pURI, info->URILength);
      LOG_INFO_APP("\n");
      break;
    }

    case CCP_CLT_CALL_FRIENDLY_NAME_EVT:
    {
      CCP_CLT_Call_Name_Evt_t *info = (CCP_CLT_Call_Name_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("Friendly Name for Call ID %d of Telephone Bearer Instance ID %d on remote CCP Server (len %d) : ",
                  info->CallIndex,
                  pNotification->ContentControlID,
                  info->NameLength);
      Print_String(info->pName, info->NameLength);
      LOG_INFO_APP("\n");
      break;
    }

    case CCP_CLT_CALL_TERMINATION_EVT:
    {
      CCP_CLT_Call_Termination_Evt_t *info = (CCP_CLT_Call_Termination_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("Termination of Call ID %d of Telephone Bearer Instance ID %d on remote CCP Server for Reason: %d\n",
                  info->CallIndex,
                  pNotification->ContentControlID,
                  info->Reason);
      UNUSED(info);
      break;
    }

    case CCP_CLT_RESPONSE_EVT:
    {
      CCP_CLT_Call_Ctrl_Rsp_Evt_t *info = (CCP_CLT_Call_Ctrl_Rsp_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("Response for Call Control Operation 0x%02X on Call ID %d of Telephone Bearer Instance ID %d : 0x%02X\n",
                  info->CallCtrlOp,
                  info->CallIndex,
                  pNotification->ContentControlID,
                  info->CallCtrlResp);
      UNUSED(info);
      break;
    }

    default:
      break;
  }
}
#endif /*(APP_CCP_ROLE_CLIENT_SUPPORT == 1u)*/

