STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_TMAP_Peripheral/STM32_WPAN/App/tmap_app.c
#if (APP_MCP_ROLE_CLIENT_SUPPORT == 1u)
/**
  * @brief  Notify MCP Meta Events
  * @param  pNotification: pointer on notification information
 */
static void MCP_MetaEvt_Notification(MCP_Notification_Evt_t *pNotification)
{
  switch(pNotification->EvtOpcode)
  {
    case MCP_CLT_GMP_INFO_EVT:
    case MCP_CLT_MPI_INFO_EVT:
    {
      MCP_CLT_MediaPlayerInfo_Evt_t *mp_info = (MCP_CLT_MediaPlayerInfo_Evt_t *)pNotification->pInfo;
      if (pNotification->EvtOpcode == MCP_CLT_GMP_INFO_EVT)
      {
        APP_ACL_Conn_t *p_conn = APP_GetACLConn(pNotification->ConnHandle);
        LOG_INFO_APP("Generic Media Player with CCID %d on remote MCP Server (connection handle 0x%04X)\n",
                    pNotification->ContentControlID,
                    pNotification->ConnHandle);
        if (p_conn != 0)
        {
          p_conn->GenericMediaPlayerCCID = pNotification->ContentControlID;
        }
      }
      else
      {
        LOG_INFO_APP("Media Player Instance with CCID %d on remote MCP Server (connection handle 0x%04X)\n",
                    pNotification->ContentControlID,
                    pNotification->ConnHandle);
      }
      if (mp_info->OptionFeaturesMask & MCP_FEATURE_PLAYBACK_SPEED)
      {
        LOG_INFO_APP("Playback Speed feature is supported on remote MCP Server\n");
      }
      if (mp_info->OptionFeaturesMask & MCP_FEATURE_SEEKING_SPEED)
      {
        LOG_INFO_APP("Seeking Speed feature is supported on remote MCP Server\n");
      }
      if (mp_info->OptionFeaturesMask & MCP_FEATURE_PLAYING_ORDER)
      {
        LOG_INFO_APP("Playing Order feature is supported on remote MCP Server\n");
      }
      if (mp_info->OptionFeaturesMask & MCP_FEATURE_PLAYING_ORDERS_SUPPORTED)
      {
        LOG_INFO_APP("Supported Playing Orders feature is supported on remote MCP Server\n");
      }
      if (mp_info->OptionFeaturesMask & MCP_FEATURE_MEDIA_CTRL_OP)
      {
        LOG_INFO_APP("Media Control Operation feature is supported on remote MCP Server\n");
      }
      if (mp_info->NotifUpdateMask & MCP_NOTIFICATION_MEDIA_PLAYER_NAME)
      {
        LOG_INFO_APP("Media Player Name update Notification feature is supported on remote MCP Server\n");
      }
      if (mp_info->NotifUpdateMask & MCP_NOTIFICATION_TRACK_TITLE)
      {
        LOG_INFO_APP("Track Title update Notification feature is supported on remote MCP Server\n");
      }
      if (mp_info->NotifUpdateMask & MCP_NOTIFICATION_TRACK_DURATION)
      {
        LOG_INFO_APP("Track Duration update Notification feature is supported on remote MCP Server\n");
      }
      if (mp_info->NotifUpdateMask & MCP_NOTIFICATION_TRACK_POSITION)
      {
        LOG_INFO_APP("Track Position update Notification feature is supported on remote MCP Server\n");
      }
      if (mp_info->NotifUpdateMask & MCP_NOTIFICATION_PLAYBACK_SPEED)
      {
        LOG_INFO_APP("Playback Speed update Notification feature is supported on remote MCP Server\n");
      }
      if (mp_info->NotifUpdateMask & MCP_NOTIFICATION_SEEKING_SPEED)
      {
        LOG_INFO_APP("Seeking Speed update Notification feature is supported on remote MCP Server\n");
      }
      if (mp_info->NotifUpdateMask & MCP_NOTIFICATION_PLAYING_ORDER)
      {
        LOG_INFO_APP("Playing Order update Notification feature is supported on remote MCP Server\n");
      }
      if (mp_info->NotifUpdateMask & MCP_NOTIFICATION_MEDIA_CTRL_OP_SUPPORTED)
      {
        LOG_INFO_APP("Supported Media Control Operation update Notification feature is supported on remote MCP Server\n");
      }
      LOG_INFO_APP("Start ATT Handle : 0x%04X - End ATT Handle : 0x%04X\n",
                      mp_info->StartAttHandle,
                      mp_info->EndAttHandle);
      break;
    }

    case MCP_CLT_OPERATION_COMPLETE_EVT:
    {
      tBleStatus ret;
      LOG_INFO_APP("[MP %d] MCP Client operation with connection handle 0x%04X is complete with status 0x%02X\n",
                  pNotification->ContentControlID,
                  pNotification->ConnHandle,
                  pNotification->Status);
      APP_ACL_Conn_t *p_conn = APP_GetACLConn(pNotification->ConnHandle);
      if (p_conn != 0)
      {
        uint16_t CurrentContentCtrlOp = 0;

        LOG_INFO_APP("CurrentContentCtrlOp 0x%08X, PlayPauseOperation : %d, MediaState : %d\n",
                  p_conn->CurrentContentCtrlOp,
                  p_conn->PlayPauseOperation,
                  p_conn->MediaState);
        if (p_conn->CurrentContentCtrlOp & MCP_CLT_OP_CONFIGURE_TRACK_TITLE_NOTIFICATION)
        {
          CurrentContentCtrlOp = MCP_CLT_OP_CONFIGURE_TRACK_TITLE_NOTIFICATION;
        }
        else if (p_conn->CurrentContentCtrlOp & MCP_CLT_OP_READ_MEDIA_STATE)
        {
          CurrentContentCtrlOp = MCP_CLT_OP_READ_MEDIA_STATE;
        }
        else if (p_conn->CurrentContentCtrlOp & MCP_CLT_OP_READ_TRACK_TITLE)
        {
          CurrentContentCtrlOp = MCP_CLT_OP_READ_TRACK_TITLE;
        }
        p_conn->CurrentContentCtrlOp &= ~CurrentContentCtrlOp;
        if ((p_conn->PlayPauseOperation == 1u) && (CurrentContentCtrlOp == MCP_CLT_OP_READ_MEDIA_STATE))
        {
          p_conn->PlayPauseOperation = 0;

          if (p_conn->MediaState == MCP_MEDIA_STATE_INACTIVE || p_conn->MediaState == MCP_MEDIA_STATE_PAUSED)
          {
            ret = MCP_CLIENT_PlayTrack(pNotification->ConnHandle, p_conn->GenericMediaPlayerCCID);
            if (ret != BLE_STATUS_SUCCESS)
            {
              LOG_INFO_APP("  Fail   : MCP_CLIENT_PlayTrack with ConnHandle 0x%04X and CCID %d - result: 0x%02X\n",
                           pNotification->ConnHandle,
                           p_conn->GenericMediaPlayerCCID,
                           ret);
              if ((ret == BLE_STATUS_BUSY) && (p_conn != 0))
              {
                p_conn->PendingContentCtrlOp |= MCP_CLT_OP_PLAY_TRACK;
              }
            }
            else
            {
              if (p_conn != 0)
              {
                p_conn->CurrentContentCtrlOp |= MCP_CLT_OP_PLAY_TRACK;
              }
              LOG_INFO_APP("  Success: MCP_CLIENT_PlayTrack with ConnHandle 0x%04X and CCID %d\n",
                           pNotification->ConnHandle,
                           p_conn->GenericMediaPlayerCCID);
              return;
            }
          }
          else if (p_conn->MediaState == MCP_MEDIA_STATE_PLAYING)
          {
            ret = MCP_CLIENT_PauseTrack(pNotification->ConnHandle, p_conn->GenericMediaPlayerCCID);
            if (ret != BLE_STATUS_SUCCESS)
            {
              LOG_INFO_APP("  Fail   : MCP_CLIENT_PauseTrack with ConnHandle 0x%04X and CCID %d - result: 0x%02X\n",
                           pNotification->ConnHandle,
                           p_conn->GenericMediaPlayerCCID,
                           ret);
              if ((ret == BLE_STATUS_BUSY) && (p_conn != 0))
              {
                p_conn->PendingContentCtrlOp |= MCP_CLT_OP_PAUSE_TRACK;
              }
            }
            else
            {
              if (p_conn != 0)
              {
                p_conn->CurrentContentCtrlOp |= MCP_CLT_OP_PAUSE_TRACK;
              }
              LOG_INFO_APP("  Success: MCP_CLIENT_PauseTrack with ConnHandle 0x%04X and CCID %d\n",
                           pNotification->ConnHandle,
                           p_conn->GenericMediaPlayerCCID);
              return;
            }
          }
        }
        else if (p_conn->MCPLinkupState == APP_MCP_LINKUP_STATE_CONFIGURE_TRACK_TITLE_NOTIF)
        {
          ret = MCP_CLIENT_ReadMediaState(pNotification->ConnHandle, p_conn->GenericMediaPlayerCCID);
          LOG_INFO_APP("MCP_CLIENT_ReadMediaState with status 0x%02X\n", ret);
          if (ret == BLE_STATUS_SUCCESS)
          {
            p_conn->MCPLinkupState = APP_MCP_LINKUP_STATE_READ_MEDIA_STATE;
            p_conn->CurrentContentCtrlOp |= MCP_CLT_OP_READ_MEDIA_STATE;
            return;
          }
        }
        else if (p_conn->MCPLinkupState == APP_MCP_LINKUP_STATE_READ_MEDIA_STATE)
        {
          ret = MCP_CLIENT_ReadTrackTitle(pNotification->ConnHandle, p_conn->GenericMediaPlayerCCID);
          LOG_INFO_APP("MCP_CLIENT_ReadTrackTitle with status 0x%02X\n", ret);
          if (ret == BLE_STATUS_SUCCESS)
          {
            p_conn->MCPLinkupState = APP_MCP_LINKUP_STATE_READ_TRACK_TITLE;
            p_conn->CurrentContentCtrlOp |= MCP_CLT_OP_READ_TRACK_TITLE;
            return;
          }
        }
        else if (p_conn->MCPLinkupState == APP_MCP_LINKUP_STATE_READ_TRACK_TITLE)
        {
          p_conn->MCPLinkupState = APP_MCP_LINKUP_STATE_IDLE;
        }
        /* schedule pending MCP/CCP operation if it exists*/
        TMAP_SchedulePendingContentControlOp(p_conn);
      }
      UNUSED(ret);
      break;
    }

    case MCP_CLT_OPERATION_TRANSMITTED_EVT:
    {
      MCP_CLT_MediaCtrlOpTransmitted_Evt_t *p_event_params = (MCP_CLT_MediaCtrlOpTransmitted_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("[MP %d] MCP Client operation 0x%02X with connection handle 0x%04X is transmitted with status 0x%02X\n",
                  pNotification->ContentControlID,
                  p_event_params->CtrlOp,
                  pNotification->ConnHandle,
                  pNotification->Status);
      UNUSED(p_event_params);
      APP_ACL_Conn_t *p_conn = APP_GetACLConn(pNotification->ConnHandle);
      if (p_conn != 0)
      {
        if ((p_event_params->CtrlOp == MCP_MEDIA_CTRL_PLAY) && (p_conn->CurrentContentCtrlOp & MCP_CLT_OP_PLAY_TRACK))
        {
          p_conn->CurrentContentCtrlOp &= ~MCP_CLT_OP_PLAY_TRACK;
        }
        else if ((p_event_params->CtrlOp == MCP_MEDIA_CTRL_PAUSE) && (p_conn->CurrentContentCtrlOp & MCP_CLT_OP_PAUSE_TRACK))
        {
          p_conn->CurrentContentCtrlOp &= ~MCP_CLT_OP_PAUSE_TRACK;
        }
        else if ((p_event_params->CtrlOp == MCP_MEDIA_CTRL_NEXT_TRACK) && (p_conn->CurrentContentCtrlOp & MCP_CLT_OP_MOVE_NEXT_TRACK))
        {
          p_conn->CurrentContentCtrlOp &= ~MCP_CLT_OP_MOVE_NEXT_TRACK;
        }
        else if ((p_event_params->CtrlOp == MCP_MEDIA_CTRL_PREVIOUS_TRACK) && (p_conn->CurrentContentCtrlOp & MCP_CLT_OP_MOVE_PREVIOUS_TRACK))
        {
          p_conn->CurrentContentCtrlOp &= ~MCP_CLT_OP_MOVE_PREVIOUS_TRACK;
        }
        /* schedule pending MCP/CCP operation if it exists*/
        TMAP_SchedulePendingContentControlOp(p_conn);
      }
      break;
    }

    case MCP_CLT_RESPONSE_EVT:
    {
      MCP_CLT_MediaCtrlRsp_Evt_t *p_event_params = (MCP_CLT_MediaCtrlRsp_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("[MP %d] MCP Client receives response 0x%02X for MCP Ctrl operation 0x%02X (ConnHandle 0x%04X)\n",
                  pNotification->ContentControlID,
                  p_event_params->ResultCode,
                  p_event_params->CtrlOp,
                  pNotification->ConnHandle);
      UNUSED(p_event_params);
      break;
    }

    case MCP_CLT_MEDIA_PLAYER_NAME_EVT:
    {
      MCP_CLT_MediaPlayerName_Evt_t *p_event_params = (MCP_CLT_MediaPlayerName_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("[MP %d] MCP Client receives Media Player Name ",
                  pNotification->ContentControlID);
      Print_String(p_event_params->pName, p_event_params->NameLength);
      LOG_INFO_APP(" (offset %d, length %d)\n",
                  p_event_params->Offset,
                  p_event_params->NameLength);
      break;
    }

    case MCP_CLT_TRACK_CHANGED_EVT:
    {
      LOG_INFO_APP("[MP %d] MCP Client is notified that Track has changed in MCP Server (ConnHandle 0x%04X)\n",
                  pNotification->ContentControlID,
                  pNotification->ConnHandle);
      break;
    }

