STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_TMAP_Peripheral/STM32_WPAN/App/tmap_app.c
    case MCP_CLT_TRACK_TITLE_EVT:
    {
      MCP_CLT_TrackTitle_Evt_t *p_event_params = (MCP_CLT_TrackTitle_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("[MP %d] MCP Client receives Track Title ",
                  pNotification->ContentControlID);
      Print_String(p_event_params->pTitle, p_event_params->TitleLength);
      LOG_INFO_APP(" (offset %d, length %d)\n",
                  p_event_params->Offset,
                  p_event_params->TitleLength);
      Menu_SetTrackTitle(p_event_params->pTitle, p_event_params->TitleLength);
      break;
    }

    case MCP_CLT_TRACK_DURATION_EVT:
    {
      MCP_CLT_TrackDuration_Evt_t *p_event_params = (MCP_CLT_TrackDuration_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("[MP %d] MCP Client receives Track Duration %d\n",
                  pNotification->ContentControlID,
                  p_event_params->Duration);
      UNUSED(p_event_params);
      break;
    }

    case MCP_CLT_TRACK_POSITION_EVT:
    {
      MCP_CLT_TrackPosition_Evt_t *p_event_params = (MCP_CLT_TrackPosition_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("[MP %d] MCP Client receives Track Position %d\n",
                  pNotification->ContentControlID,
                  p_event_params->Position);
      UNUSED(p_event_params);
      break;
    }

    case MCP_CLT_PLAYBACK_SPEED_EVT:
    {
        MCP_CLT_PlaybackSpeed_Evt_t *p_event_params = (MCP_CLT_PlaybackSpeed_Evt_t *)pNotification->pInfo;
        uint16_t speed_rate = ((uint32_t)(p_event_params->Speed) * 100);
        LOG_INFO_APP("[MP %d] MCP Client receives Playback Speed : %f (%d %) of normal playback speed\n",
                    pNotification->ContentControlID,
                    (uint32_t) p_event_params->Speed,
                    speed_rate);
      UNUSED(speed_rate);
      break;
    }

    case MCP_CLT_SEEKING_SPEED_EVT:
    {
      MCP_CLT_SeekingSpeed_Evt_t *p_event_params = (MCP_CLT_SeekingSpeed_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("[MP %d] MCP Client receives Seeking Speed : %d of real-time playback\n",
                  pNotification->ContentControlID,
                  p_event_params->Speed);
      UNUSED(p_event_params);
      break;
    }

    case MCP_CLT_PLAYING_ORDER_EVT:
    {
      MCP_CLT_PlayingOrder_Evt_t *p_event_params = (MCP_CLT_PlayingOrder_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("[MP %d] MCP Client receives Playing Order type 0x%02X from remote MCP Server\n",
                  pNotification->ContentControlID,
                  p_event_params->PlayingOrder);
      UNUSED(p_event_params);
      break;
    }

    case MCP_CLT_PLAYING_ORDERS_SUPPORTED_EVT:
    {
      MCP_CLT_SupportedPlayingOrders_Evt_t *p_event_params = (MCP_CLT_SupportedPlayingOrders_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("[MP %d] MCP Client receives Playing Orders mask 0x%04X from remote MCP Server\n",
                  pNotification->ContentControlID,
                  p_event_params->PlayingOrdersMask);
      UNUSED(p_event_params);
      break;
    }

    case MCP_MEDIA_STATE_EVT:
    {
      MCP_MediaState_Evt_t *p_event_params = (MCP_MediaState_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("[MP %d] MCP Client receives Media State 0x%02X from remote MCP Server\n",
                  pNotification->ContentControlID,
                  p_event_params->MediaState);

      APP_ACL_Conn_t *p_conn = APP_GetACLConn(pNotification->ConnHandle);
      if (p_conn != 0)
      {
        p_conn->MediaState = p_event_params->MediaState;
      }

      switch (p_event_params->MediaState)
      {
        case MCP_MEDIA_STATE_INACTIVE:
        {
          Menu_SetMediaState("INACTIVE");
        }
        break;
        case MCP_MEDIA_STATE_PAUSED:
        {
          Menu_SetMediaState("PAUSED");
        }
        break;
        case MCP_MEDIA_STATE_PLAYING:
        {
          Menu_SetMediaState("PLAYING");
        }
        break;
        case MCP_MEDIA_STATE_SEEKING:
        {
          Menu_SetMediaState("SEEKING");
        }
        break;
      }

      break;
    }

    case MCP_CLT_MEDIA_CTRL_OP_FEATURES_EVT:
    {
      MCP_CLT_MediaCtrlOpFeatures_Evt_t *p_event_params = (MCP_CLT_MediaCtrlOpFeatures_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("[MP %d] MCP Client receives Supported Media Ctrl Operation mask 0x%08X from remote MCP Server\n",
                  pNotification->ContentControlID,
                  p_event_params->CtrlOpFeatureMask);
      UNUSED(p_event_params);
      break;
    }

    default:
      break;
  }
}
#endif /*(APP_MCP_ROLE_CLIENT_SUPPORT == 1u)*/

static void TMAP_SchedulePendingContentControlOp(APP_ACL_Conn_t *pConn)
{
  if (pConn != 0)
  {
    tBleStatus ret;
    uint16_t PendingContentCtrlOp = pConn->PendingContentCtrlOp;
    if (PendingContentCtrlOp != 0x0000)
    {
      LOG_INFO_APP("Content Control Operation 0x%04X on ConnHandle 0x%04X is pending\n",
                   PendingContentCtrlOp,
                   pConn->Acl_Conn_Handle);
    }

#if (APP_MCP_ROLE_CLIENT_SUPPORT == 1u)
    if ((PendingContentCtrlOp & MCP_CLT_OP_CONFIGURE_TRACK_TITLE_NOTIFICATION) \
        && ((pConn->CurrentContentCtrlOp & MCP_CLT_OP_ALL) == 0x0000))
    {
      ret = MCP_CLIENT_ConfigureTrackTitleNotification(pConn->Acl_Conn_Handle,
                                                       pConn->GenericMediaPlayerCCID,
                                                       0x01u);
      if (ret != BLE_STATUS_SUCCESS)
      {
        if (ret != BLE_STATUS_BUSY)
        {
          pConn->PendingContentCtrlOp &= ~MCP_CLT_OP_CONFIGURE_TRACK_TITLE_NOTIFICATION;
        }
        LOG_INFO_APP("  Fail   : MCP_CLIENT_ConfigureTrackTitleNotification with ConnHandle 0x%04X and CCID %d - result: 0x%02X\n",
                     pConn->Acl_Conn_Handle,
                     pConn->GenericMediaPlayerCCID,
                     ret);
      }
      else
      {
        pConn->CurrentContentCtrlOp |= MCP_CLT_OP_CONFIGURE_TRACK_TITLE_NOTIFICATION;
        pConn->PendingContentCtrlOp &= ~MCP_CLT_OP_CONFIGURE_TRACK_TITLE_NOTIFICATION;
        LOG_INFO_APP("  Success: MCP_CLIENT_ConfigureTrackTitleNotification with ConnHandle 0x%04X and CCID %d\n",
                     pConn->Acl_Conn_Handle,
                     pConn->GenericMediaPlayerCCID);
      }
    }
    if ((PendingContentCtrlOp & MCP_CLT_OP_PLAY_TRACK) \
        && ((pConn->CurrentContentCtrlOp & MCP_CLT_OP_ALL) == 0x0000))
    {
      ret = MCP_CLIENT_PlayTrack(pConn->Acl_Conn_Handle, pConn->GenericMediaPlayerCCID);
      if (ret != BLE_STATUS_SUCCESS)
      {
        if (ret != BLE_STATUS_BUSY)
        {
          pConn->PendingContentCtrlOp &= ~MCP_CLT_OP_PLAY_TRACK;
        }
        LOG_INFO_APP("  Fail   : MCP_CLIENT_PlayTrack with ConnHandle 0x%04X and CCID %d - result: 0x%02X\n",
                     pConn->Acl_Conn_Handle,
                     pConn->GenericMediaPlayerCCID,
                     ret);
      }
      else
      {
        pConn->CurrentContentCtrlOp |= MCP_CLT_OP_PLAY_TRACK;
        pConn->PendingContentCtrlOp &= ~MCP_CLT_OP_PLAY_TRACK;
        LOG_INFO_APP("  Success: MCP_CLIENT_PlayTrack with ConnHandle 0x%04X and CCID %d\n",
                     pConn->Acl_Conn_Handle,
                     pConn->GenericMediaPlayerCCID);
      }
    }
    if ((PendingContentCtrlOp & MCP_CLT_OP_PAUSE_TRACK) \
        && ( (pConn->CurrentContentCtrlOp & MCP_CLT_OP_ALL) == 0x0000))
    {
      ret = MCP_CLIENT_PauseTrack(pConn->Acl_Conn_Handle, pConn->GenericMediaPlayerCCID);
      if (ret != BLE_STATUS_SUCCESS)
      {
        if (ret != BLE_STATUS_BUSY)
        {
          pConn->PendingContentCtrlOp &= ~MCP_CLT_OP_PAUSE_TRACK;
        }
        LOG_INFO_APP("  Fail   : MCP_CLIENT_PauseTrack with ConnHandle 0x%04X and CCID %d - result: 0x%02X\n",
                     pConn->Acl_Conn_Handle,
                     pConn->GenericMediaPlayerCCID,
                     ret);
      }
      else
      {
        pConn->CurrentContentCtrlOp |= MCP_CLT_OP_PAUSE_TRACK;
        pConn->PendingContentCtrlOp &= ~MCP_CLT_OP_PAUSE_TRACK;
        LOG_INFO_APP("  Success: MCP_CLIENT_PauseTrack with ConnHandle 0x%04X and CCID %d\n",
                     pConn->Acl_Conn_Handle,
                     pConn->GenericMediaPlayerCCID);
      }
    }
#endif /*(APP_MCP_ROLE_CLIENT_SUPPORT == 1u)*/
#if (APP_CCP_ROLE_CLIENT_SUPPORT == 1u)
    if ((PendingContentCtrlOp & CCP_CLT_OP_READ_CALL_STATE) \
        && ((pConn->CurrentContentCtrlOp & CCP_CLT_OP_ALL) == 0x0000))
    {
      ret = CCP_CLIENT_ReadCallState(pConn->Acl_Conn_Handle,
                                    pConn->GenericTelephoneBearerCCID);
      if (ret != BLE_STATUS_SUCCESS)
      {
        if (ret != BLE_STATUS_BUSY)
        {
          pConn->PendingContentCtrlOp &= ~CCP_CLT_OP_READ_CALL_STATE;
        }
        LOG_INFO_APP("  Fail   : CCP_CLIENT_ReadCallState with ConnHandle 0x%04X and CCID %d - result: 0x%02X\n",
                     pConn->Acl_Conn_Handle,
                     pConn->GenericTelephoneBearerCCID,
                     ret);
      }
      else
      {
        pConn->CurrentContentCtrlOp |= CCP_CLT_OP_READ_CALL_STATE;
        pConn->PendingContentCtrlOp &= ~CCP_CLT_OP_READ_CALL_STATE;
        LOG_INFO_APP("  Success: CCP_CLIENT_ReadCallState with ConnHandle 0x%04X and CCID %d\n",
                     pConn->Acl_Conn_Handle,
                     pConn->GenericTelephoneBearerCCID);
      }
    }
    if ((PendingContentCtrlOp & CCP_CLT_OP_READ_FEATURES_STATUS) \
        && ((pConn->CurrentContentCtrlOp & CCP_CLT_OP_ALL) == 0x0000))
    {
      ret = CCP_CLIENT_ReadFeaturesStatus(pConn->Acl_Conn_Handle,pConn->GenericTelephoneBearerCCID);
      if (ret != BLE_STATUS_SUCCESS)
      {
        if (ret != BLE_STATUS_BUSY)
        {
          pConn->PendingContentCtrlOp &= ~CCP_CLT_OP_READ_FEATURES_STATUS;
        }
        LOG_INFO_APP("  Fail   : CCP_CLIENT_ReadFeaturesStatus with ConnHandle 0x%04X and CCID %d - result: 0x%02X\n",
                     pConn->Acl_Conn_Handle,
                     pConn->GenericTelephoneBearerCCID,
                     ret);
      }
      else
      {
        pConn->CurrentContentCtrlOp |= CCP_CLT_OP_READ_FEATURES_STATUS;
        pConn->PendingContentCtrlOp &= ~CCP_CLT_OP_READ_FEATURES_STATUS;
        LOG_INFO_APP("  Success: CCP_CLIENT_ReadFeaturesStatus with ConnHandle 0x%04X and CCID %d\n",
                     pConn->Acl_Conn_Handle,
                     pConn->GenericTelephoneBearerCCID);
      }
    }

#endif /*(APP_CCP_ROLE_CLIENT_SUPPORT == 1u)*/
  }
}

#if (APP_VCP_ROLE_RENDERER_SUPPORT == 1u)
static void VCP_MetaEvt_Notification(VCP_Notification_Evt_t *pNotification)
{
  switch(pNotification->EvtOpcode)
  {
    case VCP_RENDERER_UPDATED_VOLUME_STATE_EVT:
    {
      VCP_VolumeState_Evt_t *p_info = (VCP_VolumeState_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("Updated Volume State :\n");
      LOG_INFO_APP("     Volume Setting : %d\n",p_info->VolSetting);
      LOG_INFO_APP("     Mute : %d\n",p_info->Mute);
      LOG_INFO_APP("     Change Counter : %d\n",p_info->ChangeCounter);
      Volume = p_info->VolSetting;
      Mute = p_info->Mute;
      if (Mute == 0)
      {
        Menu_SetVolume(Volume);
        Set_Volume(Volume);
      }
      else
      {
        Menu_SetVolume(0);
        Set_Volume(0);
      }
      break;
    }

    case VCP_RENDERER_UPDATED_AUDIO_INPUT_STATE_EVT:
    {
      VCP_AudioInputState_Evt_t *p_info = (VCP_AudioInputState_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("Updated Audio Input State :\n");
      LOG_INFO_APP("     Instance ID : %d\n",p_info->AICInst);
      LOG_INFO_APP("     Gain Setting : %d\n",p_info->State.GainSetting);
      LOG_INFO_APP("     Mute : %d\n",p_info->State.Mute);
      LOG_INFO_APP("     Gain Mode : %d\n",p_info->State.GainMode);
      LOG_INFO_APP("     Change Counter : %d\n",p_info->ChangeCounter);
      UNUSED(p_info);
      break;
    }

    case VCP_RENDERER_UPDATED_AUDIO_INPUT_DESCRIPTION_EVT:
    {
      VCP_AudioDescription_Evt_t *p_info = (VCP_AudioDescription_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("Updated Audio Input Description :\n");
      LOG_INFO_APP("     Instance ID : %d\n",p_info->Inst);
      LOG_INFO_APP("     Description : ");
      Print_String(p_info->pData, p_info->DataLength);
      LOG_INFO_APP("\n");
      break;
    }

    case VCP_RENDERER_UPDATED_VOLUME_OFFSET_STATE_EVT:
    {
      VCP_VolumeOffsetState_Evt_t *p_info = (VCP_VolumeOffsetState_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("[VOC %d] Updated Volume Offset State :\n",p_info->VOCInst);
      LOG_INFO_APP("     Volume Offset: %d \n",p_info->VolumeOffset);
      LOG_INFO_APP("     Change Counter : %d\n",p_info->ChangeCounter);
      UNUSED(p_info);
      break;
    }

    case VCP_RENDERER_UPDATED_AUDIO_OUTPUT_LOCATION_EVT:
    {
      VCP_AudioLocation_Evt_t *p_info = (VCP_AudioLocation_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("[VOC %d] Updated Audio Location : 0x%08X\n",p_info->VOCInst,p_info->AudioLocation);
      UNUSED(p_info);
      break;
    }

