STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_TMAP_Peripheral/STM32_WPAN/App/tmap_app.c
    case VCP_RENDERER_UPDATED_AUDIO_OUTPUT_DESCRIPTION_EVT:
    {
      VCP_AudioDescription_Evt_t *p_info = (VCP_AudioDescription_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("Updated Audio Output Description :\n");
      LOG_INFO_APP("     Instance ID : %d\n",p_info->Inst);
      LOG_INFO_APP("     Description : ");
      Print_String(p_info->pData, p_info->DataLength);
      LOG_INFO_APP("\n");
      break;
    }
    default:
      break;
  }
}
#endif /*(APP_VCP_ROLE_RENDERER_SUPPORT == 1u)*/

#if (APP_CSIP_ROLE_SET_MEMBER_SUPPORT == 1u)
tBleStatus CSIPAPP_RegisterCSIS(uint8_t instance_id,
                                uint8_t SIRK_OOB,
                                uint8_t SIRK_type,
                                uint8_t* SIRK,
                                uint8_t size,
                                uint8_t rank)
{

  tBleStatus status;
  uint8_t inst_id = instance_id;
  CSIS_ServiceInit_t pInit = {0};
  Audio_Location_t audio_locations;

  pInit.SIRK_type = SIRK_type;
  for (uint8_t i =0 ; i < 16 ; i++)
  {
    pInit.SIRK[i] = SIRK[i];
  }
  pInit.Size = size;
  pInit.Rank = rank;
  pInit.SIRK_OOB = SIRK_OOB;
  status = CSIP_SET_MEMBER_RegisterServiceInstance(inst_id,&pInit);
  LOG_INFO_APP("CSIP_SET_MEMBER_RegisterServiceInstance() of Instance ID %d in rank %d/%d returns status 0x%02X\n",
               inst_id,
               pInit.Rank,
               pInit.Size,
               status);
  if (status == BLE_STATUS_SUCCESS)
  {
    TMAPAPP_Context.CSIPRank = rank;
    status = CAP_RegisterCoordinatedSetMember(inst_id);
    LOG_INFO_APP("CAP_RegisterCoordinatedSetMember() of Instance ID %d returns status 0x%02X\n",
                 inst_id,
                 status);
    audio_locations =  (1u << (TMAPAPP_Context.CSIPRank - 1u));
    if(TMAPAPP_Context.NumSnkASEs >= 1){
      status = CAP_SetSnkAudioLocations(audio_locations);
      if (status == BLE_STATUS_SUCCESS)
      {
        LOG_INFO_APP("Successfully set the Supported Sink Audio Locations 0x%08X\n",audio_locations);
        TMAPAPP_Context.SnkAudioLocations = audio_locations;
      }
      else
      {
        LOG_INFO_APP("Failed to set the Supported Sink Audio Locations\n");
        return status;
      }
    }
    if(TMAPAPP_Context.NumSrcASEs >= 1){
      status = CAP_SetSrcAudioLocations(audio_locations);
      if (status == BLE_STATUS_SUCCESS)
      {
        LOG_INFO_APP("Successfully set the Supported Source Audio Locations 0x%08X\n",audio_locations);
        TMAPAPP_Context.SrcAudioLocations = audio_locations;
      }
      else
      {
        LOG_INFO_APP("Failed to set the Supported Source Audio Locations\n");
        return status;
      }
    }

  }
  return status;
}
#endif /*APP_CSIP_ROLE_SET_MEMBER_SUPPORT == 1u)*/

static char Hex_To_Char(uint8_t Hex)
{
  if (Hex < 0xA)
  {
    return (char) Hex + 48;
  }
  else
  {
    return (char) Hex + 55;
  }
}

static void Print_String(uint8_t *pString, uint8_t StringLen)
{
  uint8_t i;
  for (i = 0; i< StringLen; i++)
  {
    LOG_INFO_APP("%c", pString[i]);
  }
}
